Run by AMM on 12 Oct 2016 12:16:52





================================================================================
 1 phenotype predictions by site
================================================================================
 make bar chart of which methods differ on which antibiotic





================================================================================
 2 phenotype predictions compared to gold standard
================================================================================

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         - |       172          3         17          0          7        803 |     1,002 
         I |         6          0          0          0          0         74 |        80 
        NA |        87          5         12          0          2        896 |     1,002 
         R |     2,542          7        181          2          3         90 |     2,825 
         S |        90         12          8          4         19     11,506 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,897         27        218          6         31     13,369 |    16,548 






================================================================================
 3 find sensitivity and specifity of each method/antibiotic
================================================================================
restrict to sites with clear gold standard values only
14464 results are R/S
Typewriter
vancomycin has no positive samples

     +---------------------------------------------------------------------------------+
     |          site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |---------------------------------------------------------------------------------|
  1. | ciprofloxacin   .9525316    .996139   .9229159   .9731923    .990144    .998947 |
  2. |   clindamycin    .972973   .9211469    .938058   .9911674   .8830481    .949925 |
  3. |  erythromycin   .9827586   .9892578   .9628524   .9936471   .9808607   .9946257 |
  4. |   fusidicacid   .8888889   .9942197   .8300889   .9328041   .9881268   .9976729 |
  5. |    gentamicin   .7765958   .9976544   .6790029   .8560738   .9931607    .999516 |
     |---------------------------------------------------------------------------------|
  6. |   methicillin   .9744245   .9948025   .9534699   .9876689   .9879128   .9983103 |
  7. |     mupirocin          1   .9940886   .5407419          1   .9871782   .9978276 |
  8. |    penicillin   .9885664    .862069   .9805276   .9938985   .8108956   .9037048 |
  9. |    rifampicin        .92   .9992576   .7396942   .9901604   .9958706   .9999812 |
 10. |  tetracycline   .9491525   .9952153   .8926097   .9811139    .989615   .9982421 |
     |---------------------------------------------------------------------------------|
 11. |  trimethoprim   .8604651   .9984051   .7206752   .9470235   .9911461   .9999596 |
 12. |    vancomycin          .          1          .          .   .9973169          1 |
     +---------------------------------------------------------------------------------+
restrict to sites with clear gold standard values only
14464 results are R/S
Genefinder
vancomycin has no positive samples

     +---------------------------------------------------------------------------------+
     |          site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |---------------------------------------------------------------------------------|
  1. | ciprofloxacin   .9525316   .9951738   .9229159   .9731923   .9887733   .9984311 |
  2. |   clindamycin    .972973   .9139785    .938058   .9911674   .8747111   .9441066 |
  3. |  erythromycin   .9827586   .9833984   .9628524   .9936471    .973552      .9903 |
  4. |   fusidicacid   .9074074   .9933939   .8518829   .9472466    .987025   .9971437 |
  5. |    gentamicin   .7872341   .9976544   .6907066   .8649268   .9931607    .999516 |
     |---------------------------------------------------------------------------------|
  6. |   methicillin   .9795396   .9948025   .9600844   .9911263   .9879128   .9983103 |
  7. |     mupirocin          1   .9921182   .5407419          1   .9845291   .9965913 |
  8. |    penicillin   .9903254   .8577586   .9827555   .9951609    .806078   .9000219 |
  9. |    rifampicin        .92   .9992576   .7396942   .9901604   .9958706   .9999812 |
 10. |  tetracycline   .9576271   .9928229   .9038842   .9861006   .9864197   .9967131 |
     |---------------------------------------------------------------------------------|
 11. |  trimethoprim   .8604651   .9984051   .7206752   .9470235   .9911461   .9999596 |
 12. |    vancomycin          .          1          .          .   .9973169          1 |
     +---------------------------------------------------------------------------------+
restrict to sites with clear gold standard values only
14464 results are R/S
Mykrobe
vancomycin has no positive samples

     +---------------------------------------------------------------------------------+
     |          site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |---------------------------------------------------------------------------------|
  1. | ciprofloxacin   .9303797    .996139   .8964891   .9558581    .990144    .998947 |
  2. |   clindamycin    .972973     .90681    .938058   .9911674   .8664392   .9382196 |
  3. |  erythromycin   .9827586   .9755859   .9628524   .9936471   .9641699   .9841396 |
  4. |   fusidicacid   .5987654   .9966969   .5189639   .6748845   .9915646   .9990993 |
  5. |    gentamicin   .7978724   .9968725   .7024887   .8736973    .992012   .9991472 |
     |---------------------------------------------------------------------------------|
  6. |   methicillin   .9795396   .9948025   .9600844   .9911263   .9879128   .9983103 |
  7. |     mupirocin          1   .9940886   .5407419          1   .9871782   .9978276 |
  8. |    penicillin   .9041337   .8663793   .8855203   .9206232   .8157271   .9073731 |
  9. |    rifampicin        .24   .9985152   .0935644    .451288   .9946468   .9998201 |
 10. |  tetracycline   .9576271   .9888358   .9038842   .9861006   .9813391   .9938833 |
     |---------------------------------------------------------------------------------|
 11. |  trimethoprim   .6511628          1   .4907337   .7899218   .9941339          1 |
 12. |    vancomycin          .          1          .          .   .9973169          1 |
     +---------------------------------------------------------------------------------+
all methods
14464 results are R/S
14464 results are R/S
14464 results are R/S

     +-----------------------------------------------------------------------------+
     |    method   sensit~y      lsens      usens   specif~y      lspec      uspec |
     |-----------------------------------------------------------------------------|
  1. |    valuez   .9033628   .8918688   .9140131   .9896039   .9875906   .9913663 |
  2. | valuetype   .9638938   .9563399   .9704657     .99158   .9897482   .9931591 |
  3. | valuegene   .9670796   .9598206   .9733485   .9902053   .9882452    .991914 |
     +-----------------------------------------------------------------------------+

. 
end of do-file

. use pipeline_clean_all_values_long, clear

. use pipeline_clean_all_values_wide, clear

. noi tab site ValueA, m

               |                                        ValueAll
          site |       AAA        AAP        APA        APP        PAA        PAP        PPA        PPP |     Total
---------------+----------------------------------------------------------------------------------------+----------
      aac6aph2 |     1,300          0          2          1          0          0          0         76 |     1,379 
    aaddaph4ia |     1,291          0          2          0          0          0          0         86 |     1,379 
    aadeant6ia |     1,328          0         28          2          0          0          0         21 |     1,379 
        ant9ia |     1,227          0          4          3          0          0          0        145 |     1,379 
        ant9ib |     1,379          0          0          0          0          0          0          0 |     1,379 
        aph2ic |     1,379          0          0          0          0          0          0          0 |     1,379 
  apha3aph3iii |     1,327          0          0          1          0          0          0         51 |     1,379 
          arca |     1,372          0          1          0          0          0          0          6 |     1,379 
          arcb |     1,373          0          0          0          0          0          6          0 |     1,379 
          arcc |     1,373          0          0          0          0          0          6          0 |     1,379 
          arcd |     1,373          0          0          0          0          0          6          0 |     1,379 
          blaz |       240          4          1          3          1        282          0        848 |     1,379 
           cat |     1,379          0          0          0          0          0          0          0 |     1,379 
          ccra |     1,009          0          2          3          0          0          0        365 |     1,379 
          ccrb |     1,010          9          1         22          0          0          1        336 |     1,379 
         ccrca |     1,338          0          8          1          0          0          9         23 |     1,379 
         ccrcb |     1,333          0         22          0          0          0         22          2 |     1,379 
         ccrcc |     1,338          0         16          1          0          0          6         18 |     1,379 
           cfr |     1,376          0          0          1          0          0          0          2 |     1,379 
           chp |       449          0          1         46          0          0          0        883 |     1,379 
          dfra |     1,341          0          3          0          0          0          1         34 |     1,379 
          dfrb |     1,297          0          0          0          0         39          0         43 |     1,379 
          dfrc |     1,341          0          0          3          0          0         34          1 |     1,379 
          dfrd |     1,379          0          0          0          0          0          0          0 |     1,379 
          dfrg |     1,325          0          1          0          0          0          0         53 |     1,379 
          dfrk |     1,373          0          0          0          0          0          0          6 |     1,379 
          erma |     1,229          0          1          5          0          0          0        144 |     1,379 
          ermb |     1,375          0          1          0          0          0          0          3 |     1,379 
          ermc |     1,191          0         10          2          0          0          0        176 |     1,379 
          ermt |     1,359          0          0          0          0          0          0         20 |     1,379 
          ermy |     1,379          0          0          0          0          0          0          0 |     1,379 
           eta |     1,338          0          1          0          0          0          0         40 |     1,379 
           etb |     1,372          0          1          1          0          0          0          5 |     1,379 
           etd |     1,320          0          1          1          0          0          0         57 |     1,379 
          fusa |     1,320          2          0          0          0         57          0          0 |     1,379 
          fusb |     1,355          0          2          0          0          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0          0          0         74 |     1,379 
          grla |     1,072          1          0          0          0          7          0        299 |     1,379 
          gyra |     1,087          0          0          0          1        212          0         79 |     1,379 
          iles |     1,379          0          0          0          0          0          0          0 |     1,379 
          isab |     1,379          0          0          0          0          0          0          0 |     1,379 
          lnua |     1,364          6          0          0          0          0          0          9 |     1,379 
          lnub |     1,378          0          0          0          0          0          0          1 |     1,379 
          lukm |     1,370          0          0          0          0          0          0          9 |     1,379 
         lukmf |     1,370          0          0          0          0          0          6          3 |     1,379 
        lukpvf |     1,266          0          2          0          0          0          0        111 |     1,379 
        lukpvs |     1,266          0          3          1          0          0          0        109 |     1,379 
          meca |       999          0          1          2          0          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0          0         17 |     1,379 
          mphc |     1,361          0          1          0          0          0          0         17 |     1,379 
          msra |     1,360          0          1          0          0          0          0         18 |     1,379 
          mupa |     1,362          2          0          0          0          0          0         15 |     1,379 
          mupb |     1,379          0          0          0          0          0          0          0 |     1,379 
          qaca |     1,333          0          1          1          0          0          0         44 |     1,379 
          qacb |     1,333          0          2          0          0          0         44          0 |     1,379 
       qaccsmr |     1,319          0          7          2          0          0          1         50 |     1,379 
          rpob |     1,354          0          1          0          0         17          0          7 |     1,379 
           sak |       306          0          3          5          0          0          0      1,065 |     1,379 
          sasx |     1,364          0          1          0          0          0         14          0 |     1,379 
          sat4 |     1,327          0          2          1          0          0          0         49 |     1,379 
           scn |       144          0          3         15          0          0          0      1,217 |     1,379 
           sea |     1,080          0          1          3          0          0          0        295 |     1,379 
           seb |     1,267          0          1          2          0          0          0        109 |     1,379 
           sec |     1,149          0          1          4          0          0          0        225 |     1,379 
           sed |     1,313          0          0          0          0          0          0         66 |     1,379 
           see |     1,375          0          0          0          0          0          0          4 |     1,379 
           seg |       600          0          6         20          0          0          0        753 |     1,379 
           seh |     1,241          0          2          2          0          0          0        134 |     1,379 
           sei |       596          0          3         33          0          0          6        741 |     1,379 
           sej |     1,310          0          0          0          0          0          0         69 |     1,379 
          selr |     1,312          0          0          0          0          0          0         67 |     1,379 
           sep |     1,268          0          0          2          0          0          1        108 |     1,379 
           seu |       595          0          2         57          0          0          0        725 |     1,379 
           str |     1,375          0          0          0          0          0          0          4 |     1,379 
          tetk |     1,272          0          4          4          0          0          0         99 |     1,379 
          tetl |     1,377          0          0          0          0          0          0          2 |     1,379 
          tetm |     1,339          0          1          1          0          0          0         38 |     1,379 
          teto |     1,379          0          0          0          0          0          0          0 |     1,379 
         tsst1 |     1,119          0          1          4          0          0          0        255 |     1,379 
          vana |     1,379          0          0          0          0          0          0          0 |     1,379 
          vanb |     1,379          0          0          0          0          0          0          0 |     1,379 
          vanc |     1,379          0          0          0          0          0          0          0 |     1,379 
          vgaa |     1,378          0          0          0          0          0          0          1 |     1,379 
          vgab |     1,379          0          0          0          0          0          0          0 |     1,379 
          vgba |     1,379          0          0          0          0          0          0          0 |     1,379 
---------------+----------------------------------------------------------------------------------------+----------
         Total |   105,264         24        160        257          2        614        163     10,731 |   117,215 


. gen agree=( ValueA=="AAA"| ValueA=="PPP")

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |    117,215    .9895918    .1014888          0          1

. drop agree

. gen agree=1 if ( ValueA=="AAA"| ValueA=="PPP")
(1,220 missing values generated)

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |    115,995           1           0          1          1

. noi di r(sum) " out of " _N " site predictions" agree
115995 out of 117215 site predictions1

. 
. noi di r(sum)/_N*100
98.959178

. 
. summ agree if strpos(type, "Aqu") |strpos(type, "Chro")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     70,886           1           0          1          1

. 
. noi di r(sum) " out of " _N " aquired or chromosonal resistance site predictions" agree
70886 out of 117215 aquired or chromosonal resistance site predictions1

. 
. noi di r(sum)/_N*100
60.475195

. di r(N)
70886

. drop agree

. gen agree=1  = ValueA=="AAA"| ValueA=="PPP" 
invalid syntax
r(198);

. 
. summ agree
variable agree not found
r(111);

. 
. noi di r(sum) " out of " _N " site predictions" agree
70886 out of 117215 site predictionsagree not found
r(111);

. 
. noi di r(sum)/_N*100
60.475195

. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |    117,215    .9895918    .1014888          0          1

. 
. noi di r(sum) " out of " _N " site predictions" agree
115995 out of 117215 site predictions1

. 
. noi di r(sum)/_N*100
98.959178

. noi di r(sum) " out of " r(N) " site predictions" agree
115995 out of 117215 site predictions1

. 
. noi di r(sum)/_N*100
98.959178

. summ agree if strpos(type, "Aqu") |strpos(type, "Chro")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     71,708    .9885368    .1064514          0          1

. 
. noi di r(sum) " out of " r(N) " aquired or chromosonal resistance site predictions" agree
70886 out of 71708 aquired or chromosonal resistance site predictions1

. 
. noi di r(sum)/_N*100
60.475195

. noi di r(sum)/r(N)*100
98.853684

. 
. *************************************************

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. ****************************************

. 
. 
. 
. ******************************************************

. 
. noi di _n(5) _dup(80) "=" _n " Overall summary" _n _dup(80) "="





================================================================================
 Overall summary
================================================================================

. 
. **************************

. 
. noi di  "Recall order is  Typewriter Mykrobe Genefinder"
Recall order is  Typewriter Mykrobe Genefinder

. 
. noi tab ValueAll, sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |    105,264       89.80       89.80
        PPP |     10,731        9.15       98.96
        PAP |        614        0.52       99.48
        APP |        257        0.22       99.70
        PPA |        163        0.14       99.84
        APA |        160        0.14       99.98
        AAP |         24        0.02      100.00
        PAA |          2        0.00      100.00
------------+-----------------------------------
      Total |    117,215      100.00

. tab site Value

               |                                        ValueAll
          site |       AAA        AAP        APA        APP        PAA        PAP        PPA        PPP |     Total
---------------+----------------------------------------------------------------------------------------+----------
      aac6aph2 |     1,300          0          2          1          0          0          0         76 |     1,379 
    aaddaph4ia |     1,291          0          2          0          0          0          0         86 |     1,379 
    aadeant6ia |     1,328          0         28          2          0          0          0         21 |     1,379 
        ant9ia |     1,227          0          4          3          0          0          0        145 |     1,379 
        ant9ib |     1,379          0          0          0          0          0          0          0 |     1,379 
        aph2ic |     1,379          0          0          0          0          0          0          0 |     1,379 
  apha3aph3iii |     1,327          0          0          1          0          0          0         51 |     1,379 
          arca |     1,372          0          1          0          0          0          0          6 |     1,379 
          arcb |     1,373          0          0          0          0          0          6          0 |     1,379 
          arcc |     1,373          0          0          0          0          0          6          0 |     1,379 
          arcd |     1,373          0          0          0          0          0          6          0 |     1,379 
          blaz |       240          4          1          3          1        282          0        848 |     1,379 
           cat |     1,379          0          0          0          0          0          0          0 |     1,379 
          ccra |     1,009          0          2          3          0          0          0        365 |     1,379 
          ccrb |     1,010          9          1         22          0          0          1        336 |     1,379 
         ccrca |     1,338          0          8          1          0          0          9         23 |     1,379 
         ccrcb |     1,333          0         22          0          0          0         22          2 |     1,379 
         ccrcc |     1,338          0         16          1          0          0          6         18 |     1,379 
           cfr |     1,376          0          0          1          0          0          0          2 |     1,379 
           chp |       449          0          1         46          0          0          0        883 |     1,379 
          dfra |     1,341          0          3          0          0          0          1         34 |     1,379 
          dfrb |     1,297          0          0          0          0         39          0         43 |     1,379 
          dfrc |     1,341          0          0          3          0          0         34          1 |     1,379 
          dfrd |     1,379          0          0          0          0          0          0          0 |     1,379 
          dfrg |     1,325          0          1          0          0          0          0         53 |     1,379 
          dfrk |     1,373          0          0          0          0          0          0          6 |     1,379 
          erma |     1,229          0          1          5          0          0          0        144 |     1,379 
          ermb |     1,375          0          1          0          0          0          0          3 |     1,379 
          ermc |     1,191          0         10          2          0          0          0        176 |     1,379 
          ermt |     1,359          0          0          0          0          0          0         20 |     1,379 
          ermy |     1,379          0          0          0          0          0          0          0 |     1,379 
           eta |     1,338          0          1          0          0          0          0         40 |     1,379 
           etb |     1,372          0          1          1          0          0          0          5 |     1,379 
           etd |     1,320          0          1          1          0          0          0         57 |     1,379 
          fusa |     1,320          2          0          0          0         57          0          0 |     1,379 
          fusb |     1,355          0          2          0          0          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0          0          0         74 |     1,379 
          grla |     1,072          1          0          0          0          7          0        299 |     1,379 
          gyra |     1,087          0          0          0          1        212          0         79 |     1,379 
          iles |     1,379          0          0          0          0          0          0          0 |     1,379 
          isab |     1,379          0          0          0          0          0          0          0 |     1,379 
          lnua |     1,364          6          0          0          0          0          0          9 |     1,379 
          lnub |     1,378          0          0          0          0          0          0          1 |     1,379 
          lukm |     1,370          0          0          0          0          0          0          9 |     1,379 
         lukmf |     1,370          0          0          0          0          0          6          3 |     1,379 
        lukpvf |     1,266          0          2          0          0          0          0        111 |     1,379 
        lukpvs |     1,266          0          3          1          0          0          0        109 |     1,379 
          meca |       999          0          1          2          0          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0          0         17 |     1,379 
          mphc |     1,361          0          1          0          0          0          0         17 |     1,379 
          msra |     1,360          0          1          0          0          0          0         18 |     1,379 
          mupa |     1,362          2          0          0          0          0          0         15 |     1,379 
          mupb |     1,379          0          0          0          0          0          0          0 |     1,379 
          qaca |     1,333          0          1          1          0          0          0         44 |     1,379 
          qacb |     1,333          0          2          0          0          0         44          0 |     1,379 
       qaccsmr |     1,319          0          7          2          0          0          1         50 |     1,379 
          rpob |     1,354          0          1          0          0         17          0          7 |     1,379 
           sak |       306          0          3          5          0          0          0      1,065 |     1,379 
          sasx |     1,364          0          1          0          0          0         14          0 |     1,379 
          sat4 |     1,327          0          2          1          0          0          0         49 |     1,379 
           scn |       144          0          3         15          0          0          0      1,217 |     1,379 
           sea |     1,080          0          1          3          0          0          0        295 |     1,379 
           seb |     1,267          0          1          2          0          0          0        109 |     1,379 
           sec |     1,149          0          1          4          0          0          0        225 |     1,379 
           sed |     1,313          0          0          0          0          0          0         66 |     1,379 
           see |     1,375          0          0          0          0          0          0          4 |     1,379 
           seg |       600          0          6         20          0          0          0        753 |     1,379 
           seh |     1,241          0          2          2          0          0          0        134 |     1,379 
           sei |       596          0          3         33          0          0          6        741 |     1,379 
           sej |     1,310          0          0          0          0          0          0         69 |     1,379 
          selr |     1,312          0          0          0          0          0          0         67 |     1,379 
           sep |     1,268          0          0          2          0          0          1        108 |     1,379 
           seu |       595          0          2         57          0          0          0        725 |     1,379 
           str |     1,375          0          0          0          0          0          0          4 |     1,379 
          tetk |     1,272          0          4          4          0          0          0         99 |     1,379 
          tetl |     1,377          0          0          0          0          0          0          2 |     1,379 
          tetm |     1,339          0          1          1          0          0          0         38 |     1,379 
          teto |     1,379          0          0          0          0          0          0          0 |     1,379 
         tsst1 |     1,119          0          1          4          0          0          0        255 |     1,379 
          vana |     1,379          0          0          0          0          0          0          0 |     1,379 
          vanb |     1,379          0          0          0          0          0          0          0 |     1,379 
          vanc |     1,379          0          0          0          0          0          0          0 |     1,379 
          vgaa |     1,378          0          0          0          0          0          0          1 |     1,379 
          vgab |     1,379          0          0          0          0          0          0          0 |     1,379 
          vgba |     1,379          0          0          0          0          0          0          0 |     1,379 
---------------+----------------------------------------------------------------------------------------+----------
         Total |   105,264         24        160        257          2        614        163     10,731 |   117,215 


. 
. *********** create phenotype predictions by site

. 
. use anti_panel_all, clear

. tab site gold

              |                      goldstandard
         site |         -          I         NA          R          S |     Total
--------------+-------------------------------------------------------+----------
ciprofloxacin |         0         21          6        316      1,036 |     1,379 
  clindamycin |       501          2        412        185        279 |     1,379 
 erythromycin |         0          1          6        348      1,024 |     1,379 
  fusidicacid |         0          0          6        162      1,211 |     1,379 
   gentamicin |         0          0          6         94      1,279 |     1,379 
  methicillin |         0         20          6        391        962 |     1,379 
    mupirocin |       323         24         11          6      1,015 |     1,379 
   penicillin |         0          5          5      1,137        232 |     1,379 
   rifampicin |         0          1          6         25      1,347 |     1,379 
 tetracycline |         0          1          6        118      1,254 |     1,379 
 trimethoprim |       178          5        526         43        627 |     1,379 
   vancomycin |         0          0          6          0      1,373 |     1,379 
--------------+-------------------------------------------------------+----------
        Total |     1,002         80      1,002      2,825     11,639 |    16,548 


. drop if gold=="-"
(1,002 observations deleted)

. tab site gold

              |                goldstandard
         site |         I         NA          R          S |     Total
--------------+--------------------------------------------+----------
ciprofloxacin |        21          6        316      1,036 |     1,379 
  clindamycin |         2        412        185        279 |       878 
 erythromycin |         1          6        348      1,024 |     1,379 
  fusidicacid |         0          6        162      1,211 |     1,379 
   gentamicin |         0          6         94      1,279 |     1,379 
  methicillin |        20          6        391        962 |     1,379 
    mupirocin |        24         11          6      1,015 |     1,056 
   penicillin |         5          5      1,137        232 |     1,379 
   rifampicin |         1          6         25      1,347 |     1,379 
 tetracycline |         1          6        118      1,254 |     1,379 
 trimethoprim |         5        526         43        627 |     1,201 
   vancomycin |         0          6          0      1,373 |     1,379 
--------------+--------------------------------------------+----------
        Total |        80      1,002      2,825     11,639 |    15,546 


. tab site valuea

              |                             valueall
         site |       rrr        rrs        rsr        rss        srs        sss |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |       299          0          7          1          0      1,072 |     1,379 
  clindamycin |       205          4          0          0          3        666 |       878 
 erythromycin |       354          6          0          0          8      1,011 |     1,379 
  fusidicacid |        96          2         55          2          3      1,221 |     1,379 
   gentamicin |        76          1          0          0          2      1,300 |     1,379 
  methicillin |       393          2          0          0          0        984 |     1,379 
    mupirocin |        12          0          0          2          0      1,042 |     1,056 
   penicillin |     1,061          2        100          1          1        214 |     1,379 
   rifampicin |         7          0         17          0          1      1,354 |     1,379 
 tetracycline |       121          4          0          0          5      1,249 |     1,379 
 trimethoprim |       101          3         22          0          1      1,074 |     1,201 
   vancomycin |         0          0          0          0          0      1,379 |     1,379 
--------------+------------------------------------------------------------------+----------
        Total |     2,725         24        201          6         24     12,566 |    15,546 


. 
. * in table

. 
. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         I |         6          0          0          0          0         74 |        80 
        NA |        87          5         12          0          2        896 |     1,002 
         R |     2,542          7        181          2          3         90 |     2,825 
         S |        90         12          8          4         19     11,506 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,725         24        201          6         24     12,566 |    15,546 


.  drop if !inlist(gold, "R", "S")
(1,082 observations deleted)

. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         R |     2,542          7        181          2          3         90 |     2,825 
         S |        90         12          8          4         19     11,506 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,632         19        189          6         22     11,596 |    14,464 


. 
. ******************************************************

. 
. noi di _n(5) _dup(80) "=" _n " 2 phenotype predictions compared to gold standard" _n _dup(80) "="





================================================================================
 2 phenotype predictions compared to gold standard
================================================================================

. 
. use anti_panel_all, clear

. 
. 
. 
. * in table

. 
. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         - |       172          3         17          0          7        803 |     1,002 
         I |         6          0          0          0          0         74 |        80 
        NA |        87          5         12          0          2        896 |     1,002 
         R |     2,542          7        181          2          3         90 |     2,825 
         S |        90         12          8          4         19     11,506 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,897         27        218          6         31     13,369 |    16,548 


. 
. 
. 
. * reduced table

. 
. drop if !inlist(gold, "R", "S")
(2,084 observations deleted)

. 
. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         R |     2,542          7        181          2          3         90 |     2,825 
         S |        90         12          8          4         19     11,506 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,632         19        189          6         22     11,596 |    14,464 


. 
. gen agree = (valueall=="rrr" & gold=="R")|(valueall=="sss" & gold=="S")

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     14,464    .9712389      .16714          0          1

. 
. noi di r(sum) " out of " r(N) results agree between all methods and gold standard
14048 out of 14464results not found
r(111);

. noi di r(sum)/r(N)*100
97.123894

. noi tab site valueall if agree!=1

              |                             valueall
         site |       rrr        rrs        rsr        rss        srs        sss |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |         4          0          7          1          0         15 |        27 
  clindamycin |        22          2          0          0          2          5 |        31 
 erythromycin |        11          6          0          0          8          6 |        31 
  fusidicacid |         3          2         55          2          3         13 |        78 
   gentamicin |         3          1          0          0          2         19 |        25 
  methicillin |         5          2          0          0          0          8 |        15 
    mupirocin |         6          0          0          2          0          0 |         8 
   penicillin |        29          2        100          1          1         11 |       144 
   rifampicin |         1          0         17          0          1          2 |        21 
 tetracycline |         6          4          0          0          5          5 |        20 
 trimethoprim |         0          0         10          0          0          6 |        16 
--------------+------------------------------------------------------------------+----------
        Total |        90         19        189          6         22         90 |       416 


. 
. 
. 
. 
. 
. noi di "all methods"
all methods

. 
. tempfile temp

. 
. use anti_panel_all, clear

. 
. assert site!=""

. 
. assert _N==16548

. 
. * restrict to clear goldstandard values

. 
. gen clear=inlist(gold, "R", "S")

. 
. summ clear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       clear |     16,548    .8740633     .331788          0          1

. 
. noi di r(sum) " results are R/S"
14464 results are R/S

. 
. drop if clear!=1
(2,084 observations deleted)

. 
. contract  gold valuegene

. 
. rename value predict

. 
. assert predict!=""

. 
. * reshape

. 
. reshape wide _freq, i( gold) j(predict) string
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------

. 
. rename _freq* *

. 
. rename r combor

. 
. rename s combos

. 
. gen method = "valuegene"

. 
. reshape wide combo*, i(method) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

. 
. rename combo* *

. 
. 
. 
. * remember : resistance = postive result

. 
. rename sS TN

. 
. rename rR TP

. 
. rename sR FN 

. 
. *so predicted sensitive but actually resistant

. 
. rename rS FP 

. 
. * predicted resistant but actually sensitive

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. foreach k in valuetype valuez{
  2. 
. use anti_panel_all, clear
  3. 
. assert site!=""
  4. 
. assert _N==16548
  5. 
. * restrict to clear goldstandard values
. 
. gen clear=inlist(gold, "R", "S")
  6. 
. summ clear
  7. 
. noi di r(sum) " results are R/S"
  8. 
. drop if clear!=1
  9. 
. contract  gold `k'
 10. 
. rename value predict
 11. 
. assert predict!=""
 12. 
. * reshape
. 
. reshape wide _freq, i( gold) j(predict) string
 13. 
. rename _freq* *
 14. 
. rename r combor
 15. 
. rename s combos
 16. 
. gen method = "`k'"
 17. 
. reshape wide combo*, i(method) j(gold) string
 18. 
. rename combo* *
 19. 
. 
. 
. * remember : resistance = postive result
. 
. rename sS TN
 20. 
. rename rR TP
 21. 
. rename sR FN 
 22. 
. *so predicted sensitive but actually resistant
. 
. rename rS FP 
 23. 
. * predicted resistant but actually sensitive
. 
. append using temp
 24. 
. save temp, replace
 25. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       clear |     16,548    .8740633     .331788          0          1
14464 results are R/S
(2,084 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
file temp.dta saved

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       clear |     16,548    .8740633     .331788          0          1
14464 results are R/S
(2,084 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable method was str6, now str9 to accommodate using data's values)
file temp.dta saved

. 
. 
. 
. 
. 
. 
. 
. for any TN TP FN FP: replace X=0 if X==.

->  replace TN=0 if TN==.
(0 real changes made)

->  replace TP=0 if TP==.
(0 real changes made)

->  replace FN=0 if FN==.
(0 real changes made)

->  replace FP=0 if FP==.
(0 real changes made)

. 
. 
. 
. gen sensitivity = TP/(TP+FN)

. 
. gen specificity = TN/(TN+FP)

. 
. 
. 
. gen predictPOS = TP+FP

. 
. gen predictNEG = TN +FN

. 
. 
. 
. gen trueNeg= TN +FP

. 
. gen truePos= TP +FN

. 
. 
. 
. gen MajorErrorRate = FN/truePos

. 
. gen VeryMajorErrorRate = FP/trueNeg

. 
. gen Agreement = (TP+TN)/(trueNeg+truePos)

. 
. 
. 
. * get confidence intervals

. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(3 missing values generated)

->  gen usens=.
(3 missing values generated)

->  gen lspec=.
(3 missing values generated)

->  gen uspec=.
(3 missing values generated)

->  gen lme=.
(3 missing values generated)

->  gen ume=.
(3 missing values generated)

->  gen lvme=.
(3 missing values generated)

->  gen uvme=.
(3 missing values generated)

. 
. local max=_N

. 
. forvalues i=1(1)`max'{
  2. 
. if truePos[`i']>0{
  3. 
. cii prop  truePos[`i'] TP[`i']
  4. 
. replace lsens = r(lb) if _n==`i'
  5. 
. replace usens = r(ub) if _n==`i'
  6. 
. cii prop truePos[`i'] FN[`i']
  7. 
. replace lvme = r(lb) if _n==`i'
  8. 
. replace uvme = r(ub) if _n==`i'
  9. 
. }
 10. 
. else{
 11. 
. noi di site[`i'] " has no positive samples"
 12. 
. }
 13. 
. if trueNeg[`i']>0{
 14. 
. cii prop trueNeg[`i'] TN[`i']
 15. 
. replace lspec = r(lb) if _n==`i'
 16. 
. replace uspec = r(ub) if _n==`i'
 17. 
. cii prop trueNeg[`i'] FP[`i']
 18. 
. replace lme = r(lb) if _n==`i'
 19. 
. replace ume = r(ub) if _n==`i'
 20. 
. }
 21. 
. else{
 22. 
. noi di site[`i'] " has no negative samples"
 23. 
. }
 24. 
. }

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      2,825    .9033628     .005559        .8918688    .9140131
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      2,825    .0966372     .005559        .0859869    .1081312
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |     11,639    .9896039    .0009402        .9875906    .9913663
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |     11,639    .0103961    .0009402        .0086337    .0124094
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      2,825    .9638938    .0035099        .9563399    .9704657
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      2,825    .0361062    .0035099        .0295343    .0436601
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |     11,639      .99158     .000847        .9897482    .9931591
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |     11,639      .00842     .000847        .0068409    .0102518
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      2,825    .9670796     .003357        .9598206    .9733485
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      2,825    .0329204     .003357        .0266515    .0401794
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |     11,639    .9902053    .0009128        .9882452     .991914
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |     11,639    .0097947    .0009128         .008086    .0117548
(1 real change made)
(1 real change made)

. 
. 
. 
. * save values for combining for table

. 
. noi list method sens lsens usens spec lspec uspec

     +-----------------------------------------------------------------------------+
     |    method   sensit~y      lsens      usens   specif~y      lspec      uspec |
     |-----------------------------------------------------------------------------|
  1. |    valuez   .9033628   .8918688   .9140131   .9896039   .9875906   .9913663 |
  2. | valuetype   .9638938   .9563399   .9704657     .99158   .9897482   .9931591 |
  3. | valuegene   .9670796   .9598206   .9733485   .9902053   .9882452    .991914 |
     +-----------------------------------------------------------------------------+

. use pipeline_clean_all_values_wide, clear

. keep if site=="rpob"
(115,836 observations deleted)

. tab ValueAll

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,354       98.19       98.19
        APA |          1        0.07       98.26
        PAP |         17        1.23       99.49
        PPP |          7        0.51      100.00
------------+-----------------------------------
      Total |      1,379      100.00

. use anti_panel_all, clear

. keep if strpos(site, "rif")
(15,169 observations deleted)

. tab site valuea

              |                  valueall
         site |       rrr        rsr        srs        sss |     Total
--------------+--------------------------------------------+----------
   rifampicin |         7         17          1      1,354 |     1,379 
--------------+--------------------------------------------+----------
        Total |         7         17          1      1,354 |     1,379 


. tab gold valuea

goldstanda |                  valueall
        rd |       rrr        rsr        srs        sss |     Total
-----------+--------------------------------------------+----------
         I |         0          0          0          1 |         1 
        NA |         0          0          0          6 |         6 
         R |         6         17          0          2 |        25 
         S |         1          0          1      1,345 |     1,347 
-----------+--------------------------------------------+----------
     Total |         7         17          1      1,354 |     1,379 


. noi di "results for fusidic acid: fusb, fusc, fusa, far"
results for fusidic acid: fusb, fusc, fusa, far

. 
. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "fusa", "fusb", "fusc", "far")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                             ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPP |     Total
---------------+------------------------------------------------------------------+----------
          fusa |     1,320          2          0          0         57          0 |     1,379 
          fusb |     1,355          0          2          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0         74 |     1,379 
---------------+------------------------------------------------------------------+----------
         Total |     3,977          2          3          2         57         96 |     4,137 


. use anti_panel_all, clear

. 
. keep if strpos(site, "fus")
(15,169 observations deleted)

. 
. noi di "Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)"
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

. 
. noi tab gold valuea

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
        NA |         0          0          0          0          0          6 |         6 
         R |        93          2         51          1          2         13 |       162 
         S |         3          0          4          1          1      1,202 |     1,211 
-----------+------------------------------------------------------------------+----------
     Total |        96          2         55          2          3      1,221 |     1,379 


. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "fusa", "fusb", "fusc")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                             ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPP |     Total
---------------+------------------------------------------------------------------+----------
          fusa |     1,320          2          0          0         57          0 |     1,379 
          fusb |     1,355          0          2          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0         74 |     1,379 
---------------+------------------------------------------------------------------+----------
         Total |     3,977          2          3          2         57         96 |     4,137 


. keep site ValueA

. noi di "results for fusidic acid: fusb, fusc, fusa"
results for fusidic acid: fusb, fusc, fusa

. 
. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "fusa", "fusb", "fusc")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                             ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPP |     Total
---------------+------------------------------------------------------------------+----------
          fusa |     1,320          2          0          0         57          0 |     1,379 
          fusb |     1,355          0          2          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0         74 |     1,379 
---------------+------------------------------------------------------------------+----------
         Total |     3,977          2          3          2         57         96 |     4,137 


. 
. keep sample site ValueA

. 
. reshape wide ValueA, i(sample) j(site)
variable site is string; specify string option
r(109);

. reshape wide ValueA, i(sample) j(site) string
(note: j = fusa fusb fusc)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     4137   ->    1379
Number of variables                   3   ->       4
j variable (3 values)              site   ->   (dropped)
xij variables:
                               ValueAll   ->   ValueAllfusa ValueAllfusb ValueAllfusc
-----------------------------------------------------------------------------

. compress  ValueAllfusa ValueAllfusb ValueAllfusc
  (0 bytes saved)

. contract  ValueAllfusa ValueAllfusb ValueAllfusc

. use anti_panel_all, clear

. 
. keep if strpos(site, "fus")
(15,169 observations deleted)

. 
. noi di "results for fusidic acid: fusb, fusc, fusa"
results for fusidic acid: fusb, fusc, fusa

. 
. use anti_panel_all, clear

. 
. keep if strpos(site, "fus")
(15,169 observations deleted)

. 
. noi di "Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)"
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

. 
. noi tab gold valuea

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
        NA |         0          0          0          0          0          6 |         6 
         R |        93          2         51          1          2         13 |       162 
         S |         3          0          4          1          1      1,202 |     1,211 
-----------+------------------------------------------------------------------+----------
     Total |        96          2         55          2          3      1,221 |     1,379 


. 
. * split into site by site results

. 
. tempfile fustemp

. 
. keep sample gold

. 
. 
. 
. 
. 
. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "fusa", "fusb", "fusc")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                             ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPP |     Total
---------------+------------------------------------------------------------------+----------
          fusa |     1,320          2          0          0         57          0 |     1,379 
          fusb |     1,355          0          2          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0         74 |     1,379 
---------------+------------------------------------------------------------------+----------
         Total |     3,977          2          3          2         57         96 |     4,137 


. 
. keep sample site ValueA

. 
. reshape wide ValueA, i(sample) j(site)
variable site is string; specify string option
r(109);

. 
. merge 1:1 sample using fustemp, update
file fustemp.dta not found
r(601);

. noi di "results for fusidic acid: fusb, fusc, fusa"
results for fusidic acid: fusb, fusc, fusa

. 
. use anti_panel_all, clear

. 
. keep if strpos(site, "fus")
(15,169 observations deleted)

. 
. noi di "Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)"
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

. 
. noi tab gold valuea

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
        NA |         0          0          0          0          0          6 |         6 
         R |        93          2         51          1          2         13 |       162 
         S |         3          0          4          1          1      1,202 |     1,211 
-----------+------------------------------------------------------------------+----------
     Total |        96          2         55          2          3      1,221 |     1,379 


. 
. * split into site by site results

. 
. tempfile fustemp

. 
. keep sample gold

. 
. save fustemp
file fustemp.dta saved

. 
. 
. 
. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "fusa", "fusb", "fusc")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                             ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPP |     Total
---------------+------------------------------------------------------------------+----------
          fusa |     1,320          2          0          0         57          0 |     1,379 
          fusb |     1,355          0          2          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0         74 |     1,379 
---------------+------------------------------------------------------------------+----------
         Total |     3,977          2          3          2         57         96 |     4,137 


. 
. keep sample site ValueA

. 
. reshape wide ValueA, i(sample) j(site) string
(note: j = fusa fusb fusc)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     4137   ->    1379
Number of variables                   3   ->       4
j variable (3 values)              site   ->   (dropped)
xij variables:
                               ValueAll   ->   ValueAllfusa ValueAllfusb ValueAllfusc
-----------------------------------------------------------------------------

. 
. merge 1:1 sample using fustemp, update

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                             1,379
        not updated                     1,379  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. gen ABC= "fusA:" + ValueAllfusa + ",fusB:"+  ValueAllfusb + ",fusc:" + ValueAllfusc

. tab gold ABC

goldstanda |                                                ABC
        rd | fusA:AA..  fusA:AA..  fusA:AA..  fusA:AA..  fusA:AA..  fusA:AA..  fusA:AA..  fusA:PA..  fusA:PA.. |     Total
-----------+---------------------------------------------------------------------------------------------------+----------
        NA |         6          0          0          0          0          0          0          0          0 |         6 
         R |        13          1          2         73          1         18          1         51          2 |       162 
         S |     1,202          0          0          1          1          2          1          4          0 |     1,211 
-----------+---------------------------------------------------------------------------------------------------+----------
     Total |     1,221          1          2         74          2         20          2         55          2 |     1,379 


. tab ABC gold

                      |           goldstandard
                  ABC |        NA          R          S |     Total
----------------------+---------------------------------+----------
fusA:AAA,fusB:AAA,f.. |         6         13      1,202 |     1,221 
fusA:AAA,fusB:AAA,f.. |         0          1          0 |         1 
fusA:AAA,fusB:AAA,f.. |         0          2          0 |         2 
fusA:AAA,fusB:AAA,f.. |         0         73          1 |        74 
fusA:AAA,fusB:APA,f.. |         0          1          1 |         2 
fusA:AAA,fusB:PPP,f.. |         0         18          2 |        20 
fusA:AAP,fusB:AAA,f.. |         0          1          1 |         2 
fusA:PAP,fusB:AAA,f.. |         0         51          4 |        55 
fusA:PAP,fusB:PPP,f.. |         0          2          0 |         2 
----------------------+---------------------------------+----------
                Total |         6        162      1,211 |     1,379 


. help tab

. tab ABC gold, wide
option wide not allowed
r(198);

. help tab

. drop ABC

. gen ABC= "A:" + ValueAllfusa + ",B:"+  ValueAllfusb + ",C:" + ValueAllfusc

. tab ABC gold, wide
option wide not allowed
r(198);

. tab ABC gold

                  |           goldstandard
              ABC |        NA          R          S |     Total
------------------+---------------------------------+----------
A:AAA,B:AAA,C:AAA |         6         13      1,202 |     1,221 
A:AAA,B:AAA,C:APA |         0          1          0 |         1 
A:AAA,B:AAA,C:APP |         0          2          0 |         2 
A:AAA,B:AAA,C:PPP |         0         73          1 |        74 
A:AAA,B:APA,C:AAA |         0          1          1 |         2 
A:AAA,B:PPP,C:AAA |         0         18          2 |        20 
A:AAP,B:AAA,C:AAA |         0          1          1 |         2 
A:PAP,B:AAA,C:AAA |         0         51          4 |        55 
A:PAP,B:PPP,C:AAA |         0          2          0 |         2 
------------------+---------------------------------+----------
            Total |         6        162      1,211 |     1,379 


. keep if gold=="R"
(1,217 observations deleted)

. tab ABC gold

                  | goldstanda
                  |     rd
              ABC |         R |     Total
------------------+-----------+----------
A:AAA,B:AAA,C:AAA |        13 |        13 
A:AAA,B:AAA,C:APA |         1 |         1 
A:AAA,B:AAA,C:APP |         2 |         2 
A:AAA,B:AAA,C:PPP |        73 |        73 
A:AAA,B:APA,C:AAA |         1 |         1 
A:AAA,B:PPP,C:AAA |        18 |        18 
A:AAP,B:AAA,C:AAA |         1 |         1 
A:PAP,B:AAA,C:AAA |        51 |        51 
A:PAP,B:PPP,C:AAA |         2 |         2 
------------------+-----------+----------
            Total |       162 |       162 


. gen mykrobecall =  (inlist(ValueAllfusB, "APA", "PPP")
too few ')' or ']'
r(132);

. gen mykrobecall =  (inlist(ValueAllfusB, "APA", "PPP"))
ValueAllfusB not found
r(111);

. gen mykrobecall =  (inlist(ValueAllfusb, "APA", "PPP"))

. replace my =1 if inlist( ValueAllfusc, "APA", "APP", "PPP")
(76 real changes made)

. tab ABC gold

                  | goldstanda
                  |     rd
              ABC |         R |     Total
------------------+-----------+----------
A:AAA,B:AAA,C:AAA |        13 |        13 
A:AAA,B:AAA,C:APA |         1 |         1 
A:AAA,B:AAA,C:APP |         2 |         2 
A:AAA,B:AAA,C:PPP |        73 |        73 
A:AAA,B:APA,C:AAA |         1 |         1 
A:AAA,B:PPP,C:AAA |        18 |        18 
A:AAP,B:AAA,C:AAA |         1 |         1 
A:PAP,B:AAA,C:AAA |        51 |        51 
A:PAP,B:PPP,C:AAA |         2 |         2 
------------------+-----------+----------
            Total |       162 |       162 


. tab ABC m

                  |      mykrobecall
              ABC |         0          1 |     Total
------------------+----------------------+----------
A:AAA,B:AAA,C:AAA |        13          0 |        13 
A:AAA,B:AAA,C:APA |         0          1 |         1 
A:AAA,B:AAA,C:APP |         0          2 |         2 
A:AAA,B:AAA,C:PPP |         0         73 |        73 
A:AAA,B:APA,C:AAA |         0          1 |         1 
A:AAA,B:PPP,C:AAA |         0         18 |        18 
A:AAP,B:AAA,C:AAA |         1          0 |         1 
A:PAP,B:AAA,C:AAA |        51          0 |        51 
A:PAP,B:PPP,C:AAA |         0          2 |         2 
------------------+----------------------+----------
            Total |        65         97 |       162 


. 
. noi di "results for penicillin: meca, mecc, blaz"
results for penicillin: meca, mecc, blaz

. 
. use anti_panel_all, clear

. 
. keep if strpos(site, "pen")
(15,169 observations deleted)

. 
. noi di "Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)"
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

. 
. noi tab gold valuea

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         I |         1          0          0          0          0          4 |         5 
        NA |         4          0          0          0          0          1 |         5 
         R |     1,027          1         97          1          0         11 |     1,137 
         S |        29          1          3          0          1        198 |       232 
-----------+------------------------------------------------------------------+----------
     Total |     1,061          2        100          1          1        214 |     1,379 


. 
. * split into site by site results

. 
. tempfile pentemp

. 
. keep sample gold

. noi di "results for penicillin: meca, mecc, blaz"
results for penicillin: meca, mecc, blaz

. 
. use anti_panel_all, clear

. 
. keep if strpos(site, "pen")
(15,169 observations deleted)

. 
. noi di "Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)"
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

. 
. noi tab gold valuea

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         I |         1          0          0          0          0          4 |         5 
        NA |         4          0          0          0          0          1 |         5 
         R |     1,027          1         97          1          0         11 |     1,137 
         S |        29          1          3          0          1        198 |       232 
-----------+------------------------------------------------------------------+----------
     Total |     1,061          2        100          1          1        214 |     1,379 


. 
. * split into site by site results

. 
. tempfile pentemp

. 
. noi di "results for fusidic acid: fusb, fusc, fusa"
results for fusidic acid: fusb, fusc, fusa

. 
. use anti_panel_all, clear

. 
. keep if strpos(site, "fus")
(15,169 observations deleted)

. 
. noi di "Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)"
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

. 
. noi tab gold valuea

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
        NA |         0          0          0          0          0          6 |         6 
         R |        93          2         51          1          2         13 |       162 
         S |         3          0          4          1          1      1,202 |     1,211 
-----------+------------------------------------------------------------------+----------
     Total |        96          2         55          2          3      1,221 |     1,379 


. 
. * split into site by site results

. 
. tempfile fustemp

. 
. keep sample gold valuez

. 
. save fustemp, replace
file fustemp.dta saved

. 
. 
. 
. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "fusa", "fusb", "fusc")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                             ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPP |     Total
---------------+------------------------------------------------------------------+----------
          fusa |     1,320          2          0          0         57          0 |     1,379 
          fusb |     1,355          0          2          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0         74 |     1,379 
---------------+------------------------------------------------------------------+----------
         Total |     3,977          2          3          2         57         96 |     4,137 


. 
. keep sample site ValueA

. 
. reshape wide ValueA, i(sample) j(site) string
(note: j = fusa fusb fusc)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     4137   ->    1379
Number of variables                   3   ->       4
j variable (3 values)              site   ->   (dropped)
xij variables:
                               ValueAll   ->   ValueAllfusa ValueAllfusb ValueAllfusc
-----------------------------------------------------------------------------

. 
. merge 1:1 sample using fustemp, update

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                             1,379
        not updated                     1,379  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. assert _merge==3

. 
. drop _merge

. gen ABC= "A:" + ValueAllfusa + ",B:"+  ValueAllfusb + ",C:" + ValueAllfusc

. 
. noi tab ABC gold

                  |           goldstandard
              ABC |        NA          R          S |     Total
------------------+---------------------------------+----------
A:AAA,B:AAA,C:AAA |         6         13      1,202 |     1,221 
A:AAA,B:AAA,C:APA |         0          1          0 |         1 
A:AAA,B:AAA,C:APP |         0          2          0 |         2 
A:AAA,B:AAA,C:PPP |         0         73          1 |        74 
A:AAA,B:APA,C:AAA |         0          1          1 |         2 
A:AAA,B:PPP,C:AAA |         0         18          2 |        20 
A:AAP,B:AAA,C:AAA |         0          1          1 |         2 
A:PAP,B:AAA,C:AAA |         0         51          4 |        55 
A:PAP,B:PPP,C:AAA |         0          2          0 |         2 
------------------+---------------------------------+----------
            Total |         6        162      1,211 |     1,379 


. 
. keep if gold=="R"
(1,217 observations deleted)

. 
. noi di "for resistant samples"
for resistant samples

. 
. noi tab ABC valuez

                  |       zam value
              ABC |         r          s |     Total
------------------+----------------------+----------
A:AAA,B:AAA,C:AAA |         0         13 |        13 
A:AAA,B:AAA,C:APA |         1          0 |         1 
A:AAA,B:AAA,C:APP |         2          0 |         2 
A:AAA,B:AAA,C:PPP |        73          0 |        73 
A:AAA,B:APA,C:AAA |         1          0 |         1 
A:AAA,B:PPP,C:AAA |        18          0 |        18 
A:AAP,B:AAA,C:AAA |         0          1 |         1 
A:PAP,B:AAA,C:AAA |         0         51 |        51 
A:PAP,B:PPP,C:AAA |         2          0 |         2 
------------------+----------------------+----------
            Total |        97         65 |       162 


. * meca, mecc, blaz

. 
. noi di "results for penicillin: meca, mecc, blaz"
results for penicillin: meca, mecc, blaz

. 
. use anti_panel_all, clear

. 
. keep if strpos(site, "pen")
(15,169 observations deleted)

. 
. noi di "Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)"
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

. 
. noi tab gold valuea

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         I |         1          0          0          0          0          4 |         5 
        NA |         4          0          0          0          0          1 |         5 
         R |     1,027          1         97          1          0         11 |     1,137 
         S |        29          1          3          0          1        198 |       232 
-----------+------------------------------------------------------------------+----------
     Total |     1,061          2        100          1          1        214 |     1,379 


. 
. * split into site by site results

. 
. tempfile pentemp

. 
. keep sample gold valuez

. 
. save pentemp, replace
(note: file pentemp.dta not found)
file pentemp.dta saved

. 
. 
. 
. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "meca", "mecc", "blaz")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                                   ValueAll
          site |       AAA        AAP        APA        APP        PAA        PAP        PPP |     Total
---------------+-----------------------------------------------------------------------------+----------
          blaz |       240          4          1          3          1        282        848 |     1,379 
          meca |       999          0          1          2          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0         17 |     1,379 
---------------+-----------------------------------------------------------------------------+----------
         Total |     2,601          4          2          5          1        282      1,242 |     4,137 


. 
. keep sample site ValueA

. 
. reshape wide ValueA, i(sample) j(site) string
(note: j = blaz meca mecc)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     4137   ->    1379
Number of variables                   3   ->       4
j variable (3 values)              site   ->   (dropped)
xij variables:
                               ValueAll   ->   ValueAllblaz ValueAllmeca ValueAllmecc
-----------------------------------------------------------------------------

. 
. merge 1:1 sample using fustemp, update

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                             1,379
        not updated                     1,379  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. assert _merge==3

. 
. drop _merge

. gen ABC= "A:" + ValueAllmeca + ",C:"+  ValueAllmecc + ",Z:" + ValueAllblaz

. 
. noi tab ABC gold

                  |           goldstandard
              ABC |        NA          R          S |     Total
------------------+---------------------------------+----------
A:AAA,C:AAA,Z:AAA |         1         19        194 |       214 
A:AAA,C:AAA,Z:AAP |         0          0          1 |         1 
A:AAA,C:AAA,Z:APA |         0          0          1 |         1 
A:AAA,C:AAA,Z:APP |         0          1          1 |         2 
A:AAA,C:AAA,Z:PAP |         0         30         70 |       100 
A:AAA,C:AAA,Z:PPP |         2         61        603 |       666 
A:AAA,C:PPP,Z:AAA |         0          0         15 |        15 
A:APA,C:PPP,Z:APP |         0          0          1 |         1 
A:APP,C:AAA,Z:PPP |         0          1          1 |         2 
A:PPP,C:AAA,Z:AAA |         0          4          7 |        11 
A:PPP,C:AAA,Z:AAP |         0          0          3 |         3 
A:PPP,C:AAA,Z:PAA |         0          0          1 |         1 
A:PPP,C:AAA,Z:PAP |         0         11        170 |       181 
A:PPP,C:AAA,Z:PPP |         3         35        142 |       180 
A:PPP,C:PPP,Z:PAP |         0          0          1 |         1 
------------------+---------------------------------+----------
            Total |         6        162      1,211 |     1,379 


. keep if gold=="R"
(1,217 observations deleted)

. 
. noi di "for resistant samples"
for resistant samples

. 
. noi tab ABC valuez

                  |       zam value
              ABC |         r          s |     Total
------------------+----------------------+----------
A:AAA,C:AAA,Z:AAA |        14          5 |        19 
A:AAA,C:AAA,Z:APP |         1          0 |         1 
A:AAA,C:AAA,Z:PAP |        24          6 |        30 
A:AAA,C:AAA,Z:PPP |        34         27 |        61 
A:APP,C:AAA,Z:PPP |         0          1 |         1 
A:PPP,C:AAA,Z:AAA |         2          2 |         4 
A:PPP,C:AAA,Z:PAP |         2          9 |        11 
A:PPP,C:AAA,Z:PPP |        20         15 |        35 
------------------+----------------------+----------
            Total |        97         65 |       162 


. 
. use pipeline_clean_all_values_wide, clear

. 
. keep if inlist(site, "meca", "mecc", "blaz")
(113,078 observations deleted)

. 
. noi tab site ValueA

               |                                   ValueAll
          site |       AAA        AAP        APA        APP        PAA        PAP        PPP |     Total
---------------+-----------------------------------------------------------------------------+----------
          blaz |       240          4          1          3          1        282        848 |     1,379 
          meca |       999          0          1          2          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0         17 |     1,379 
---------------+-----------------------------------------------------------------------------+----------
         Total |     2,601          4          2          5          1        282      1,242 |     4,137 


. 
. keep sample site ValueA

. 
. reshape wide ValueA, i(sample) j(site) string
(note: j = blaz meca mecc)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     4137   ->    1379
Number of variables                   3   ->       4
j variable (3 values)              site   ->   (dropped)
xij variables:
                               ValueAll   ->   ValueAllblaz ValueAllmeca ValueAllmecc
-----------------------------------------------------------------------------

. 
. merge 1:1 sample using pentemp, update

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                             1,379
        not updated                     1,379  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. assert _merge==3

. 
. drop _merge

. 
. 
. 
. gen ABC= "A:" + ValueAllmeca + ",C:"+  ValueAllmecc + ",Z:" + ValueAllblaz

. 
. noi tab ABC gold

                  |                goldstandard
              ABC |         I         NA          R          S |     Total
------------------+--------------------------------------------+----------
A:AAA,C:AAA,Z:AAA |         4          1         11        198 |       214 
A:AAA,C:AAA,Z:AAP |         0          0          1          0 |         1 
A:AAA,C:AAA,Z:APA |         0          0          0          1 |         1 
A:AAA,C:AAA,Z:APP |         0          0          1          1 |         2 
A:AAA,C:AAA,Z:PAP |         0          0         97          3 |       100 
A:AAA,C:AAA,Z:PPP |         1          1        636         28 |       666 
A:AAA,C:PPP,Z:AAA |         0          0         15          0 |        15 
A:APA,C:PPP,Z:APP |         0          0          1          0 |         1 
A:APP,C:AAA,Z:PPP |         0          0          2          0 |         2 
A:PPP,C:AAA,Z:AAA |         0          0         11          0 |        11 
A:PPP,C:AAA,Z:AAP |         0          0          2          1 |         3 
A:PPP,C:AAA,Z:PAA |         0          0          1          0 |         1 
A:PPP,C:AAA,Z:PAP |         0          0        181          0 |       181 
A:PPP,C:AAA,Z:PPP |         0          3        177          0 |       180 
A:PPP,C:PPP,Z:PAP |         0          0          1          0 |         1 
------------------+--------------------------------------------+----------
            Total |         5          5      1,137        232 |     1,379 


. 
. keep if gold=="R"
(242 observations deleted)

. 
. noi di "for resistant samples"
for resistant samples

. 
. noi tab ABC valuez

                  |       zam value
              ABC |         r          s |     Total
------------------+----------------------+----------
A:AAA,C:AAA,Z:AAA |         0         11 |        11 
A:AAA,C:AAA,Z:AAP |         0          1 |         1 
A:AAA,C:AAA,Z:APP |         1          0 |         1 
A:AAA,C:AAA,Z:PAP |         0         97 |        97 
A:AAA,C:AAA,Z:PPP |       636          0 |       636 
A:AAA,C:PPP,Z:AAA |        15          0 |        15 
A:APA,C:PPP,Z:APP |         1          0 |         1 
A:APP,C:AAA,Z:PPP |         2          0 |         2 
A:PPP,C:AAA,Z:AAA |        11          0 |        11 
A:PPP,C:AAA,Z:AAP |         2          0 |         2 
A:PPP,C:AAA,Z:PAA |         1          0 |         1 
A:PPP,C:AAA,Z:PAP |       181          0 |       181 
A:PPP,C:AAA,Z:PPP |       177          0 |       177 
A:PPP,C:PPP,Z:PAP |         1          0 |         1 
------------------+----------------------+----------
            Total |     1,028        109 |     1,137 


. use viru_panel_all, clear

. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. run create_predict_viru.do
