----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\users\amy.mason\Pipeline_27_07_2016\analysis2.log
  log type:  text
 opened on:   7 Oct 2016, 18:44:12

. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on  7 Oct 2016 18:44:12

. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. *********** create phenotype predictions by site
. use anti_panel_all, clear

. 
. noi di" make bar chart of which methods differ on which antibiotic"
 make bar chart of which methods differ on which antibiotic

. preserve

. contract  site  value*

. rename valueall all

. drop value*

. 
. reshape wide _freq, i(site) j(all) string
(note: j = rrr rrs rsr rss srs sss)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       48   ->      12
Number of variables                   3   ->       7
j variable (6 values)               all   ->   (dropped)
xij variables:
                                  _freq   ->   _freqrrr _freqrrs ... _freqsss
-----------------------------------------------------------------------------

. rename _freq* *

. 
. 
. * bar graph of predictions (antibiotics)
. graph bar (asis)  rrr rrs rsr rss srs sss,  over(site, label(angle(90))) stack title("Combinations of Results") subtitle("Result
> s given as Genefinder Mykrobe Typewriter ") legend( label(1 "rrr") label( 2 "rrs" ) label (3 "rsr") label (4 "rss" ) label (5 "s
> rs") label( 6 "sss" )) bar(1, color(gs8)) bar(2, color(cyan)) bar(3, color(red)) bar(4, color(blue)) bar(5, color(yellow)) bar(6
> , color(gs12))

. graph export "E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\phenotype_disagreements.tif", as(tif) width(2550) replace
(file E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\phenotype_disagreements.tif written in TIFF format)

. 
. restore

. *************************************************************
. 
. noi di "compare to gold standard"
compare to gold standard

. 
. * in table
. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         - |       172          3         17          0         18        792 |     1,002 
         I |         6          0          0          0          1         73 |        80 
        NA |        87          5         12          0          5        893 |     1,002 
         R |     2,487          6        236          3          7         86 |     2,825 
         S |        89         14          9          2         63     11,462 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,841         28        274          5         94     13,306 |    16,548 


. 
. * in graph
. preserve

. contract  site  gold valueall

. 
. reshape wide _freq, i(site gold) j(valueall) string
(note: j = rrr rrs rsr rss srs sss)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      120   ->      47
Number of variables                   4   ->       8
j variable (6 values)          valueall   ->   (dropped)
xij variables:
                                  _freq   ->   _freqrrr _freqrrs ... _freqsss
-----------------------------------------------------------------------------

. rename _freq* *

. 
. 
. gen graphx = site + " " + gold

. drop if !inlist(gold, "R", "S")
(24 observations deleted)

. sort gold site

.  gen num =_n

.  replace num=num+1 if gold=="S"
(12 real changes made)

. labmask num, values(site)

. gen goldlabel = "Gold standard " + gold

. 
. * bar graph of predictions (antibiotics)
. graph bar (asis) rrr rrs rsr rss srs sss if inlist(golds,"R", "S"),graphregion(color(white))    over(site, label(angle(90) labsi
> ze(tiny)) )  over(goldlabel, label(labsize(small)) ) stack  title("Prediction combinations") subtitle("Results given as Genefind
> er Mykrobe Typewriter") legend(rows(2) label(1 "rrr") label( 2 "rrs" ) label (3 "rsr") label (4 "rss" ) label (5 "srs") label( 6
>  "sss" )) bar(1, color(gs8)) bar(2, color(cyan)) bar(3, color(red)) bar(4, color(blue)) bar(5, color(yellow)) bar(6, color(gs12)
> ) ylabel(0(500)1000 1400)

. graph export "E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\phenotype_disagreements_withgold.tif", as(tif) width(2550) r
> eplace
(file E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\phenotype_disagreements_withgold.tif written in TIFF format)

. 
. restore

. 
. * sensitivity/ specificity
. noi di "find sensitivity and specifity of each method/antibiotic"
find sensitivity and specifity of each method/antibiotic

. 
. use anti_panel_all, clear

. 
. assert site!=""

. assert _N==16548

. 
. noi di "restrict to sites with clear gold standard values only"
restrict to sites with clear gold standard values only

. 
. gen clear=inlist(gold, "R", "S")

. summ clear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       clear |     16,548    .8740633     .331788          0          1

. noi di r(sum) " results are R/S"
14464 results are R/S

. drop if clear!=1
(2,084 observations deleted)

. 
. 
. noi di "Typewriter"
Typewriter

. 
. contract  site  gold valuetype

. rename value predict

. 
. assert predict!=""

. * reshape
. 
. reshape wide _freq, i(site gold) j(predict) string
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       44   ->      23
Number of variables                   4   ->       4
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------

. rename _freq* *

. 
. rename r combor

. rename s combos

. reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

. rename combo* *

. 
. * remember : resistance = postive result
. rename sS TN

. rename rR TP

. rename sR FN 

. *so predicted sensitive but actually resistant
. rename rS FP 

. * predicted resistant but actually sensitive
. 
. for any TN TP FN FP: replace X=0 if X==.

->  replace TN=0 if TN==.
(0 real changes made)

->  replace TP=0 if TP==.
(1 real change made)

->  replace FN=0 if FN==.
(2 real changes made)

->  replace FP=0 if FP==.
(1 real change made)

. 
. gen sensitivity = TP/(TP+FN)
(1 missing value generated)

. gen specificity = TN/(TN+FP)

. 
. gen predictPOS = TP+FP

. gen predictNEG = TN +FN

. 
. gen trueNeg= TN +FP

. gen truePos= TP +FN

. 
. gen MajorErrorRate = FN/truePos
(1 missing value generated)

. gen VeryMajorErrorRate = FP/trueNeg

. gen Agreement = (TP+TN)/(trueNeg+truePos)

. 
. * get confidence intervals
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. local max=_N

. forvalues i=1(1)`max'{
  2. if truePos[`i']>0{
  3. cii prop  truePos[`i'] TP[`i']
  4. replace lsens = r(lb) if _n==`i'
  5. replace usens = r(ub) if _n==`i'
  6. cii prop truePos[`i'] FN[`i']
  7. replace lvme = r(lb) if _n==`i'
  8. replace uvme = r(ub) if _n==`i'
  9. }
 10. else{
 11. noi di site[`i'] " has no positive samples"
 12. }
 13. if trueNeg[`i']>0{
 14. cii prop trueNeg[`i'] TN[`i']
 15. replace lspec = r(lb) if _n==`i'
 16. replace uspec = r(ub) if _n==`i'
 17. cii prop trueNeg[`i'] FP[`i']
 18. replace lme = r(lb) if _n==`i'
 19. replace ume = r(ub) if _n==`i'
 20. }
 21. else{
 22. noi di site[`i'] " has no negative samples"
 23. }
 24. }

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .9525316    .0119618        .9229159    .9731923
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .0474684    .0119618        .0268077    .0770841
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,036     .996139    .0019268         .990144     .998947
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,036     .003861    .0019268         .001053     .009856
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .972973    .0119224         .938058    .9911674
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .027027    .0119224        .0088326     .061942
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279     .921147    .0161351        .8830481     .949925
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279     .078853    .0161351         .050075    .1169519
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .9827586    .0069778        .9628523    .9936471
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .0172414    .0069778        .0063529    .0371477
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .9892578    .0032214        .9808607    .9946257
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .0107422    .0032214        .0053743    .0191393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .8888889    .0246914        .8300889    .9328041
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .1111111    .0246914        .0671959    .1699111
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .9942197    .0021784        .9881267    .9976729
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .0057803    .0021784        .0023271    .0118733
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94    .7765957    .0429615        .6790029    .8560738
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94    .2234043    .0429615        .1439262    .3209971
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .9976544    .0013526        .9931607     .999516
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .0023456    .0013526         .000484    .0068393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .9744246    .0079836        .9534699     .987669
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .0255754    .0079836         .012331    .0465301
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .9948025    .0023183        .9879127    .9983103
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .0051975    .0023183        .0016897    .0120873
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           1           0        .5407419           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           0           0               0    .4592581*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .9940887    .0024061        .9871782    .9978276
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .0059113    .0024061        .0021724    .0128218
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .9885664    .0031529        .9805276    .9938984
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .0114336    .0031529        .0061016    .0194724
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232     .862069     .022639        .8108955    .9037048
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232     .137931     .022639        .0962952    .1891045
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .92    .0542586        .7396942    .9901604
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .08    .0542586        .0098396    .2603058
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .9992576    .0007421        .9958707    .9999812
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .0007424    .0007421        .0000188    .0041293
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .9491525    .0202237        .8926097    .9811139
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .0508475    .0202237        .0188861    .1073903
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254    .9952153    .0019487         .989615    .9982421
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254    .0047847    .0019487        .0017579     .010385
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         43    .8604651    .0528413        .7206752    .9470234
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         43    .1395349    .0528413        .0529766    .2793248
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .9984051    .0015936        .9911461    .9999596
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .0015949    .0015936        .0000404    .0088539
(1 real change made)
(1 real change made)
vancomycin has no positive samples

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           1           0        .9973169           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           0           0               0    .0026831*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

. 
. * save values for combining into graphs
. 
. preserve

. keep site  sens spec lsens usens lspec uspec

. rename * tw_*

. rename tw_site site

. save typewriter, replace
file typewriter.dta saved

. restore

. 
. * graph
. use typewriter, clear

. sort site

. gen num =_n 

. labmask num, values(site)

. local max= _N

. 
. #delimit ;
delimiter now ;
. twoway rcap tw_usens tw_lsens num || scatter tw_sens num,  xlabel(1(1)`max', valuelabel angle(90))
> legend(off) title("Typewriter vs. Lab") 
> subtitle("Sensitivity in Phenotype prediction");

. #delimit cr
delimiter now cr
. graph save Graph "E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\tw_sens.gph", replace
(file E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\tw_sens.gph saved)

. graph export "E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\tw_sens.tif", as(tif) replace
(file E:\users\amy.mason\Pipeline_27_07_2016\Graphs_Outputs\tw_sens.tif written in TIFF format)

. 
. 
end of do-file

. use anti_panel_all, clear

. 
. 
. 
. assert site!=""

. 
. assert _N==16548

. 
. 
. 
. noi di "restrict to sites with clear gold standard values only"
restrict to sites with clear gold standard values only

. 
. 
. 
. gen clear=inlist(gold, "R", "S")

. 
. summ clear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       clear |     16,548    .8740633     .331788          0          1

. 
. noi di r(sum) " results are R/S"
14464 results are R/S

. 
. drop if clear!=1
(2,084 observations deleted)

. 
. 
. 
. 
. 
. noi di "Typewriter"
Typewriter

. 
. 
. 
. contract  site  gold valuetype

. 
. rename value predict

. 
. 
. 
. assert predict!=""

. 
. * reshape

. 
. 
. 
. reshape wide _freq, i(site gold) j(predict) string
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       44   ->      23
Number of variables                   4   ->       4
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------

. 
. rename _freq* *

. 
. 
. 
. rename r combor

. 
. rename s combos

. 
. reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

. 
. rename combo* *

. 
. 
. 
. * remember : resistance = postive result

. 
. rename sS TN

. 
. rename rR TP

. 
. rename sR FN 

. 
. *so predicted sensitive but actually resistant

. 
. rename rS FP 

. 
. * predicted resistant but actually sensitive

. 
. 
. 
. for any TN TP FN FP: replace X=0 if X==.

->  replace TN=0 if TN==.
(0 real changes made)

->  replace TP=0 if TP==.
(1 real change made)

->  replace FN=0 if FN==.
(2 real changes made)

->  replace FP=0 if FP==.
(1 real change made)

. 
. 
. 
. gen sensitivity = TP/(TP+FN)
(1 missing value generated)

. 
. gen specificity = TN/(TN+FP)

. 
. 
. 
. gen predictPOS = TP+FP

. 
. gen predictNEG = TN +FN

. 
. 
. 
. gen trueNeg= TN +FP

. 
. gen truePos= TP +FN

. 
. 
. 
. gen MajorErrorRate = FN/truePos
(1 missing value generated)

. 
. gen VeryMajorErrorRate = FP/trueNeg

. 
. gen Agreement = (TP+TN)/(trueNeg+truePos)

. 
. 
. 
. * get confidence intervals

. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. 
. local max=_N

. 
. forvalues i=1(1)`max'{
  2. 
. if truePos[`i']>0{
  3. 
. cii prop  truePos[`i'] TP[`i']
  4. 
. replace lsens = r(lb) if _n==`i'
  5. 
. replace usens = r(ub) if _n==`i'
  6. 
. cii prop truePos[`i'] FN[`i']
  7. 
. replace lvme = r(lb) if _n==`i'
  8. 
. replace uvme = r(ub) if _n==`i'
  9. 
. }
 10. 
. else{
 11. 
. noi di site[`i'] " has no positive samples"
 12. 
. }
 13. 
. if trueNeg[`i']>0{
 14. 
. cii prop trueNeg[`i'] TN[`i']
 15. 
. replace lspec = r(lb) if _n==`i'
 16. 
. replace uspec = r(ub) if _n==`i'
 17. 
. cii prop trueNeg[`i'] FP[`i']
 18. 
. replace lme = r(lb) if _n==`i'
 19. 
. replace ume = r(ub) if _n==`i'
 20. 
. }
 21. 
. else{
 22. 
. noi di site[`i'] " has no negative samples"
 23. 
. }
 24. 
. }

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .9525316    .0119618        .9229159    .9731923
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .0474684    .0119618        .0268077    .0770841
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,036     .996139    .0019268         .990144     .998947
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,036     .003861    .0019268         .001053     .009856
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .972973    .0119224         .938058    .9911674
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .027027    .0119224        .0088326     .061942
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279     .921147    .0161351        .8830481     .949925
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279     .078853    .0161351         .050075    .1169519
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .9827586    .0069778        .9628523    .9936471
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .0172414    .0069778        .0063529    .0371477
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .9892578    .0032214        .9808607    .9946257
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .0107422    .0032214        .0053743    .0191393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .8888889    .0246914        .8300889    .9328041
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .1111111    .0246914        .0671959    .1699111
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .9942197    .0021784        .9881267    .9976729
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .0057803    .0021784        .0023271    .0118733
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94    .7765957    .0429615        .6790029    .8560738
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94    .2234043    .0429615        .1439262    .3209971
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .9976544    .0013526        .9931607     .999516
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .0023456    .0013526         .000484    .0068393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .9744246    .0079836        .9534699     .987669
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .0255754    .0079836         .012331    .0465301
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .9948025    .0023183        .9879127    .9983103
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .0051975    .0023183        .0016897    .0120873
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           1           0        .5407419           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           0           0               0    .4592581*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .9940887    .0024061        .9871782    .9978276
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .0059113    .0024061        .0021724    .0128218
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .9885664    .0031529        .9805276    .9938984
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .0114336    .0031529        .0061016    .0194724
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232     .862069     .022639        .8108955    .9037048
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232     .137931     .022639        .0962952    .1891045
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .92    .0542586        .7396942    .9901604
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .08    .0542586        .0098396    .2603058
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .9992576    .0007421        .9958707    .9999812
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .0007424    .0007421        .0000188    .0041293
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .9491525    .0202237        .8926097    .9811139
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .0508475    .0202237        .0188861    .1073903
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254    .9952153    .0019487         .989615    .9982421
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254    .0047847    .0019487        .0017579     .010385
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         43    .8604651    .0528413        .7206752    .9470234
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         43    .1395349    .0528413        .0529766    .2793248
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .9984051    .0015936        .9911461    .9999596
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .0015949    .0015936        .0000404    .0088539
(1 real change made)
(1 real change made)
vancomycin has no positive samples

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           1           0        .9973169           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           0           0               0    .0026831*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

