Run by AMM on 27 Oct 2016 16:42:56





================================================================================
 1 Combine all predictive sets
================================================================================
combine
395178 results
on 109 sites
from 1429 samples





================================================================================
 1 Remove samples that were contaminated for all methods
================================================================================
153983 sample sites
10 samples contaminated
file problem_samples.dta saved
2820 values for contaminated samples dropped from study
(2,820 observations deleted)





================================================================================
consolidate names/ spelling errors for various sites
================================================================================
combining numbered variants into single sites

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          ccra |      2,758       16.67       16.67
          ccrb |      2,758       16.67       33.33
          erma |      2,758       16.67       50.00
           sea |      2,758       16.67       66.67
           seh |      2,758       16.67       83.33
           seu |      2,758       16.67      100.00
---------------+-----------------------------------
         Total |     16,548      100.00

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
        ccra_1 |      2,758        5.88        5.88
        ccra_2 |      2,758        5.88       11.76
        ccra_3 |      2,758        5.88       17.65
        ccra_4 |      2,758        5.88       23.53
        ccrb_1 |      2,758        5.88       29.41
        ccrb_2 |      2,758        5.88       35.29
        ccrb_3 |      2,758        5.88       41.18
        ccrb_4 |      2,758        5.88       47.06
        ccrb_6 |      2,758        5.88       52.94
        erma_1 |      2,758        5.88       58.82
        erma_2 |      2,758        5.88       64.71
         sea_1 |      2,758        5.88       70.59
         sea_2 |      2,758        5.88       76.47
         seh_1 |      2,758        5.88       82.35
         seh_2 |      2,758        5.88       88.24
         seu_1 |      2,758        5.88       94.12
         seu_2 |      2,758        5.88      100.00
---------------+-----------------------------------
         Total |     46,886      100.00

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,177        1.34        1.34
    aaddaph4ia |      4,177        1.34        2.68
    aadeant6ia |      4,177        1.34        4.02
allelicprofile |      1,379        0.44        4.46
        ant9ia |      4,177        1.34        5.80
        ant9ib |      4,177        1.34        7.14
        aph2ic |      4,177        1.34        8.48
  apha3aph3iii |      4,177        1.34        9.82
            ar |      1,419        0.45       10.27
          arca |      4,177        1.34       11.61
          arcb |      4,177        1.34       12.95
          arcc |      4,177        1.34       14.29
          arcd |      4,177        1.34       15.63
          blaz |      4,177        1.34       16.97
           cat |      4,177        1.34       18.31
         ccrca |      4,177        1.34       19.65
         ccrcb |      4,177        1.34       20.99
         ccrcc |      4,177        1.34       22.32
           cfr |      4,177        1.34       23.66
           chp |      4,177        1.34       25.00
          dfra |      4,177        1.34       26.34
          dfrb |      4,177        1.34       27.68
          dfrc |      4,177        1.34       29.02
          dfrd |      4,177        1.34       30.36
          dfrg |      4,177        1.34       31.70
          dfrk |      4,177        1.34       33.04
          ermb |      4,177        1.34       34.38
          ermc |      4,177        1.34       35.72
          ermt |      4,177        1.34       37.06
          ermy |      4,177        1.34       38.40
           eta |      4,177        1.34       39.73
           etb |      4,177        1.34       41.07
           etd |      4,177        1.34       42.41
          fusa |      4,177        1.34       43.75
          fusb |      4,177        1.34       45.09
          fusc |      4,177        1.34       46.43
          grla |      4,177        1.34       47.77
          gyra |      4,177        1.34       49.11
          iles |      2,758        0.88       49.99
          isab |      4,177        1.34       51.33
          lnua |      4,177        1.34       52.67
          lnub |      4,177        1.34       54.01
           luk |      1,419        0.45       54.47
          lukm |      4,177        1.34       55.81
         lukmf |      4,177        1.34       57.14
        lukpvf |      4,177        1.34       58.48
        lukpvs |      4,177        1.34       59.82
          meca |      4,177        1.34       61.16
          mecc |      4,177        1.34       62.50
          mlst |      2,758        0.88       63.39
          mphc |      4,177        1.34       64.73
          msra |      4,177        1.34       66.06
          mupa |      4,177        1.34       67.40
          mupb |      4,177        1.34       68.74
          qaca |      4,177        1.34       70.08
          qacb |      4,177        1.34       71.42
       qaccsmr |      4,177        1.34       72.76
          rpob |      4,177        1.34       74.10
           sak |      4,177        1.34       75.44
          sasx |      4,177        1.34       76.78
          sat4 |      4,177        1.34       78.12
           scn |      4,177        1.34       79.46
           seb |      4,177        1.34       80.80
           sec |      4,177        1.34       82.14
           sed |      4,177        1.34       83.47
           str |      4,177        1.34       84.81
          tetk |      4,177        1.34       86.15
          tetl |      4,177        1.34       87.49
          tetm |      4,177        1.34       88.83
          teto |      4,177        1.34       90.17
         tsst1 |      4,177        1.34       91.51
          vana |      4,177        1.34       92.85
          vanb |      4,177        1.34       94.19
          vanc |      4,177        1.34       95.53
          vgaa |      4,177        1.34       96.87
        vgaalc |      1,419        0.45       97.32
          vgab |      4,177        1.34       98.66
          vgba |      4,177        1.34      100.00
---------------+-----------------------------------
         Total |    311,896      100.00
127590 sample sites
1419 samples
90 sites
127590 sample sites

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |     65,274       52.91       52.91
Chromosomal Resistance |      8,474        6.87       59.78
                   ccr |      7,095        5.75       65.53
                  mlst |      1,379        1.12       66.65
             virulence |     41,151       33.35      100.00
-----------------------+-----------------------------------
                 Total |    123,373      100.00
1419 samples
90 sites

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                       |          3        3.33        3.33
    Aquired Resistance |         46       51.11       54.44
Chromosomal Resistance |          6        6.67       61.11
                   ccr |          5        5.56       66.67
                  mlst |          1        1.11       67.78
             virulence |         29       32.22      100.00
-----------------------+-----------------------------------
                 Total |         90      100.00

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379       32.70       32.70
            ar |      1,419       33.65       66.35
        vgaalc |      1,419       33.65      100.00
---------------+-----------------------------------
         Total |      4,217      100.00





================================================================================
 2 Missing data between methods
================================================================================
sample-sites missing values - key (typewriter mykrobe genefinder)
172 not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below
7445 Called only by mykrobe

               |    new
          site |       010 |     Total
---------------+-----------+----------
        vgaalc |     1,419 |     1,419 
---------------+-----------+----------
         Total |     1,419 |     1,419 

1419 vgaalc only supplied by mykrobe, drop from database
(1,419 observations deleted)
126171 sample sites remaining

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
           luk |     1,419          0 |     1,419 
          lukm |        40      1,379 |     1,419 
         lukmf |        40      1,379 |     1,419 
        lukpvf |        40      1,379 |     1,419 
        lukpvs |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 

1419 luk only supplied by mykrobe, drop from database
(1,419 observations deleted)
124752 sample sites remaining

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
            ar |     1,419          0 |     1,419 
          arca |        40      1,379 |     1,419 
          arcb |        40      1,379 |     1,419 
          arcc |        40      1,379 |     1,419 
          arcd |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 

1419ar only supplied by mykrobe, drop from database
(1,419 observations deleted)
123333 sample sites remaining

                     |          new
           Sample_id |       000        010 |     Total
---------------------+----------------------+----------
           C00001125 |         5         79 |        84 
           C00003094 |         5         79 |        84 
           C00003117 |         5         79 |        84 
           C00003123 |         5         79 |        84 
           C00003214 |         4         80 |        84 
           C00003273 |         5         79 |        84 
           C00003293 |         5         79 |        84 
           C00003342 |         5         79 |        84 
           C00009009 |         4         80 |        84 
           C00011569 |         4         80 |        84 
           C00011570 |         3         81 |        84 
           C00011571 |         5         79 |        84 
           C00011572 |         3         81 |        84 
           C00011581 |         5         79 |        84 
           C00011582 |         5         79 |        84 
           C00011584 |         5         79 |        84 
           C00011593 |         5         79 |        84 
           C00011594 |         2         82 |        84 
           C00011595 |         3         81 |        84 
           C00011596 |         3         81 |        84 
           C00011605 |         3         81 |        84 
           C00011606 |         5         79 |        84 
           C00011607 |         3         81 |        84 
           C00011608 |         5         79 |        84 
           C00011617 |         4         80 |        84 
           C00011618 |         5         79 |        84 
           C00011619 |         4         80 |        84 
           C00011620 |         5         79 |        84 
           C00011629 |         4         80 |        84 
           C00011630 |         5         79 |        84 
           C00011631 |         5         79 |        84 
           C00011632 |         5         79 |        84 
           C00011641 |         3         81 |        84 
           C00011642 |         5         79 |        84 
           C00011643 |         3         81 |        84 
           C00011644 |         3         81 |        84 
           C00011653 |         5         79 |        84 
           C00011654 |         5         79 |        84 
           C00011655 |         4         80 |        84 
           C00011656 |         5         79 |        84 
---------------------+----------------------+----------
               Total |       172      3,188 |     3,360 

40 samples are only processed by mykrobe - drop from comparision set
3360 sample sites affected
1379Called only by genefinder
sites in sample-sites only supplied by genefinder

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379      100.00      100.00
---------------+-----------------------------------
         Total |      1,379      100.00

               |    new
          site |       001 |     Total
---------------+-----------+----------
allelicprofile |     1,379 |     1,379 
---------------+-----------+----------
         Total |     1,379 |     1,379 

1379 allelicprofile only supplied by genefinder, drop from database
(1,379 observations deleted)
118594 sample sites remaining
8793 no value in mykrobe, eg fusa

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          dfrb |      1,298       14.76       14.76
          fusa |      1,318       14.99       29.75
          grla |        979       11.13       40.88
          gyra |      1,085       12.34       53.22
          iles |      1,379       15.68       68.91
          mlst |      1,379       15.68       84.59
          rpob |      1,355       15.41      100.00
---------------+-----------------------------------
         Total |      8,793      100.00

                              zam value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                 fus_E468V-GAA601104GTA |          1        1.64        1.64
                 fus_G452S-GGT601056AGT |          1        1.64        3.28
                 fus_H457Q-CAC601071CAA |          1        1.64        4.92
                 fus_H457Y-CAC601071TAC |          4        6.56       11.48
fus_H457Y-CAC601071TACfus_A67T-GCA599.. |          2        3.28       14.75
                 fus_L461F-TTA601083TTT |          1        1.64       16.39
                 fus_L461K-TTA601083AAA |         22       36.07       52.46
                 fus_L461S-TTA601083TCA |         17       27.87       80.33
fus_P404L-CCA600912CTAfus_L461F-TTA60.. |          1        1.64       81.97
                 fus_P404Q-CCA600912CAA |          1        1.64       83.61
                 fus_P406L-CCA600918CTA |          1        1.64       85.25
fus_P406L-CCA600918CTAfus_A67T-GCA599.. |          1        1.64       86.89
                  fus_V90I-GTA599970ATA |          8       13.11      100.00
----------------------------------------+-----------------------------------
                                  Total |         61      100.00

                      |         typewriter value
     genefinder value | 404:P=>..   656:T=>S         wt |     Total
----------------------+---------------------------------+----------
161:P-X;461:L-X;473.. |         1          0          0 |         1 
              373:D-G |         0          0          1 |         1 
              656:T-S |         0          1          0 |         1 
       71:A-X;160:A-X |         0          0          1 |         1 
71:A-X;373:D-X;456:.. |         0          0          2 |         2 
       71:A-X;456:L-X |         0          0          3 |         3 
                   wt |         0          0      1,309 |     1,309 
----------------------+---------------------------------+----------
                Total |         1          1      1,316 |     1,318 

 problem is that mykrobe is not reporting absence of mutation as other than blank
solution: replace 7414 blanks in these sites in mykroke with wt -  not mlst which is not a mutation site
(7,414 real changes made)

        new |      Freq.     Percent        Cum.
------------+-----------------------------------
        101 |      1,379        1.16        1.16
        111 |    117,215       98.84      100.00
------------+-----------------------------------
      Total |    118,594      100.00
all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)
mlst agreement between typewriter and genefinder in 1370 cases out of 1379
value missing for all mykrobe
rest

                      |   typewriter value
     genefinder value |        NF  Saur-ST.. |     Total
----------------------+----------------------+----------
                  182 |         1          0 |         1 
                   22 |         1          0 |         1 
                 2415 |         1          0 |         1 
                 2416 |         1          0 |         1 
                 2889 |         1          0 |         1 
                  425 |         1          0 |         1 
                    7 |         1          0 |         1 
                   80 |         1          0 |         1 
                Novel |         0          1 |         1 
----------------------+----------------------+----------
                Total |         8          1 |         9 

dropping 1379 mlst sites
(1,379 observations deleted)
117215 sample sites
1379 samples
85 sites
85 sites not including Phenotype results and mlst





================================================================================
 4 Match to antibiotic prediction
================================================================================
missing values
3 values have N/A or equivalent values, set these all to A

        +--------------+
        | site   value |
        |--------------|
133225. | gyra      ND |
143938. | iles      ND |
332620. |  etd       X |
        +--------------+
(3 real changes made)
all values equal A or P, unless chromosonal
792 replace => with - to create uniform recording of mutations
(792 real changes made)
4 remove all spaces in value reports
(4 real changes made)

. noi di "grla mutations"
grla mutations

. gen count =1 if strpos(value, "80:S-F" ) & strpos(site, "grla")
(350,746 missing values generated)

. replace count=1 if strpos(value, "80:S-Y") & strpos(site, "grla")
(12 real changes made)

. replace count=1 if strpos(value, "84:E-K") & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "84:E-G") & strpos(site, "grla")
(1 real change made)

. replace count=1 if strpos(value, "84:E-V" ) & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "432:D-G") & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "83:Y-N" ) & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "116: A-E" ) & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "45:I-M") & strpos(site, "grla")
(101 real changes made)

. replace count=1 if strpos(value, "48: A-T" ) & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "79:D-V" ) & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "41:V-G") & strpos(site, "grla")
(0 real changes made)

. replace count=1 if strpos(value, "108:S-N" ) & strpos(site, "grla")
(0 real changes made)

. drop if site!="grla"
(347,508 observations deleted)

. bysort sample: egen max = total(count)

. 
. drop if max==3
(900 observations deleted)

. 
. drop if max==0
(2,919 observations deleted)

. 
. gen problem=1 if value!="A" & method=="zam"
(212 missing values generated)

. 
. keep if problem ==1 & max!=2
(219 observations deleted)

. use anti_panel_all, clear

. keep if site=="ciprofloxacin"
(15,169 observations deleted)

. tab valueall

   valueall |      Freq.     Percent        Cum.
------------+-----------------------------------
        rrr |        304       22.04       22.04
        rrs |          1        0.07       22.12
        rsr |          2        0.15       22.26
        srs |        100        7.25       29.51
        sss |        972       70.49      100.00
------------+-----------------------------------
      Total |      1,379      100.00

. tab valueall gold

           |                goldstandard
  valueall |         I         NA          R          S |     Total
-----------+--------------------------------------------+----------
       rrr |         1          0        299          4 |       304 
       rrs |         0          0          0          1 |         1 
       rsr |         0          0          2          0 |         2 
       srs |         0          0          2         98 |       100 
       sss |        20          6         13        933 |       972 
-----------+--------------------------------------------+----------
     Total |        21          6        316      1,036 |     1,379 


. cd "E:\users\amy.mason\staph_carriage\Programs"
E:\users\amy.mason\staph_carriage\Programs

. 
. run Clean_maindata.do
