Run by AMM on 10 Aug 2016 18:59:29





================================================================================
 1 create virulence prediction panels
================================================================================
drop sites with no virulence test

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
        eta |      4,137        5.00        5.00
        etb |      4,137        5.00       10.00
        etd |      4,137        5.00       15.00
     lukpvf |      4,137        5.00       20.00
     lukpvs |      4,137        5.00       25.00
       meca |      4,137        5.00       30.00
       mecc |      4,137        5.00       35.00
        sea |      4,137        5.00       40.00
        seb |      4,137        5.00       45.00
        sec |      4,137        5.00       50.00
        sed |      4,137        5.00       55.00
        see |      4,137        5.00       60.00
        seg |      4,137        5.00       65.00
        seh |      4,137        5.00       70.00
        sei |      4,137        5.00       75.00
        sej |      4,137        5.00       80.00
       selr |      4,137        5.00       85.00
        sep |      4,137        5.00       90.00
        seu |      4,137        5.00       95.00
      tsst1 |      4,137        5.00      100.00
------------+-----------------------------------
      Total |     82,740      100.00
eta

        eta |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        130        3.14        3.14
          s |      4,007       96.86      100.00
------------+-----------------------------------
      Total |      4,137      100.00
etb

        etb |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |         25        0.60        0.60
          s |      4,112       99.40      100.00
------------+-----------------------------------
      Total |      4,137      100.00
etd

        etd |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        181        4.38        4.38
          s |      3,956       95.62      100.00
------------+-----------------------------------
      Total |      4,137      100.00
meca

       meca |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |      1,144       27.65       27.65
          s |      2,993       72.35      100.00
------------+-----------------------------------
      Total |      4,137      100.00
mecc

       mecc |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |         51        1.23        1.23
          s |      4,086       98.77      100.00
------------+-----------------------------------
      Total |      4,137      100.00
sea

        sea |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        940       22.72       22.72
          s |      3,197       77.28      100.00
------------+-----------------------------------
      Total |      4,137      100.00
seb

        seb |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        345        8.34        8.34
          s |      3,792       91.66      100.00
------------+-----------------------------------
      Total |      4,137      100.00
sec

        sec |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        711       17.19       17.19
          s |      3,426       82.81      100.00
------------+-----------------------------------
      Total |      4,137      100.00
sed

        sed |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        224        5.41        5.41
          s |      3,913       94.59      100.00
------------+-----------------------------------
      Total |      4,137      100.00
see

        see |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |         17        0.41        0.41
          s |      4,120       99.59      100.00
------------+-----------------------------------
      Total |      4,137      100.00
seg

        seg |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |      2,357       56.97       56.97
          s |      1,780       43.03      100.00
------------+-----------------------------------
      Total |      4,137      100.00
seh

        seh |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        442       10.68       10.68
          s |      3,695       89.32      100.00
------------+-----------------------------------
      Total |      4,137      100.00
sei

        sei |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |      2,343       56.64       56.64
          s |      1,794       43.36      100.00
------------+-----------------------------------
      Total |      4,137      100.00
sej

        sej |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        235        5.68        5.68
          s |      3,902       94.32      100.00
------------+-----------------------------------
      Total |      4,137      100.00
selr

       selr |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        228        5.51        5.51
          s |      3,909       94.49      100.00
------------+-----------------------------------
      Total |      4,137      100.00
sep

        sep |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        362        8.75        8.75
          s |      3,775       91.25      100.00
------------+-----------------------------------
      Total |      4,137      100.00
seu

        seu |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |      2,319       56.06       56.06
          s |      1,818       43.94      100.00
------------+-----------------------------------
      Total |      4,137      100.00
tsst1

      tsst1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        812       19.63       19.63
          s |      3,325       80.37      100.00
------------+-----------------------------------
      Total |      4,137      100.00
pvl

        pvl |      Freq.     Percent        Cum.
------------+-----------------------------------
          p |        340        8.22        8.22
          s |      3,797       91.78      100.00
------------+-----------------------------------
      Total |      4,137      100.00
save panal
basic virulence prediction counts

----------------------------------------------------------------------------------------------------------------------------------
-> method = genefinder

           |         value
      site |         p          s |     Total
-----------+----------------------+----------
       eta |        40      1,339 |     1,379 
       etb |         6      1,373 |     1,379 
       etd |        58      1,321 |     1,379 
      meca |       379      1,000 |     1,379 
      mecc |        17      1,362 |     1,379 
       pvl |       110      1,269 |     1,379 
       sea |       298      1,081 |     1,379 
       seb |       111      1,268 |     1,379 
       sec |       229      1,150 |     1,379 
       sed |        66      1,313 |     1,379 
       see |         4      1,375 |     1,379 
       seg |       773        606 |     1,379 
       seh |       136      1,243 |     1,379 
       sei |       774        605 |     1,379 
       sej |        69      1,310 |     1,379 
      selr |        67      1,312 |     1,379 
       sep |       110      1,269 |     1,379 
       seu |       782        597 |     1,379 
     tsst1 |       259      1,120 |     1,379 
-----------+----------------------+----------
     Total |     4,288     21,913 |    26,201 


----------------------------------------------------------------------------------------------------------------------------------
-> method = typewriter

           |         value
      site |         p          s |     Total
-----------+----------------------+----------
       eta |        40      1,339 |     1,379 
       etb |         5      1,374 |     1,379 
       etd |        57      1,322 |     1,379 
      meca |       377      1,002 |     1,379 
      mecc |        17      1,362 |     1,379 
       pvl |       109      1,270 |     1,379 
       sea |       295      1,084 |     1,379 
       seb |       109      1,270 |     1,379 
       sec |       225      1,154 |     1,379 
       sed |        66      1,313 |     1,379 
       see |         4      1,375 |     1,379 
       seg |       753        626 |     1,379 
       seh |       134      1,245 |     1,379 
       sei |       747        632 |     1,379 
       sej |        69      1,310 |     1,379 
      selr |        67      1,312 |     1,379 
       sep |       109      1,270 |     1,379 
       seu |       725        654 |     1,379 
     tsst1 |       255      1,124 |     1,379 
-----------+----------------------+----------
     Total |     4,163     22,038 |    26,201 


----------------------------------------------------------------------------------------------------------------------------------
-> method = zam

           |         value
      site |         p          s |     Total
-----------+----------------------+----------
       eta |        50      1,329 |     1,379 
       etb |        14      1,365 |     1,379 
       etd |        66      1,313 |     1,379 
      meca |       388        991 |     1,379 
      mecc |        17      1,362 |     1,379 
       pvl |       121      1,258 |     1,379 
       sea |       347      1,032 |     1,379 
       seb |       125      1,254 |     1,379 
       sec |       257      1,122 |     1,379 
       sed |        92      1,287 |     1,379 
       see |         9      1,370 |     1,379 
       seg |       831        548 |     1,379 
       seh |       172      1,207 |     1,379 
       sei |       822        557 |     1,379 
       sej |        97      1,282 |     1,379 
      selr |        94      1,285 |     1,379 
       sep |       143      1,236 |     1,379 
       seu |       812        567 |     1,379 
     tsst1 |       298      1,081 |     1,379 
-----------+----------------------+----------
     Total |     4,755     21,446 |    26,201 



----------------------------------------------------------------------------------------------------------------------------------
-> site = eta

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |        40      1,339 |     1,379 
typewriter |        40      1,339 |     1,379 
       zam |        50      1,329 |     1,379 
-----------+----------------------+----------
     Total |       130      4,007 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = etb

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |         6      1,373 |     1,379 
typewriter |         5      1,374 |     1,379 
       zam |        14      1,365 |     1,379 
-----------+----------------------+----------
     Total |        25      4,112 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = etd

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |        58      1,321 |     1,379 
typewriter |        57      1,322 |     1,379 
       zam |        66      1,313 |     1,379 
-----------+----------------------+----------
     Total |       181      3,956 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = meca

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       379      1,000 |     1,379 
typewriter |       377      1,002 |     1,379 
       zam |       388        991 |     1,379 
-----------+----------------------+----------
     Total |     1,144      2,993 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = mecc

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |        17      1,362 |     1,379 
typewriter |        17      1,362 |     1,379 
       zam |        17      1,362 |     1,379 
-----------+----------------------+----------
     Total |        51      4,086 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = pvl

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       110      1,269 |     1,379 
typewriter |       109      1,270 |     1,379 
       zam |       121      1,258 |     1,379 
-----------+----------------------+----------
     Total |       340      3,797 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = sea

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       298      1,081 |     1,379 
typewriter |       295      1,084 |     1,379 
       zam |       347      1,032 |     1,379 
-----------+----------------------+----------
     Total |       940      3,197 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = seb

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       111      1,268 |     1,379 
typewriter |       109      1,270 |     1,379 
       zam |       125      1,254 |     1,379 
-----------+----------------------+----------
     Total |       345      3,792 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = sec

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       229      1,150 |     1,379 
typewriter |       225      1,154 |     1,379 
       zam |       257      1,122 |     1,379 
-----------+----------------------+----------
     Total |       711      3,426 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = sed

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |        66      1,313 |     1,379 
typewriter |        66      1,313 |     1,379 
       zam |        92      1,287 |     1,379 
-----------+----------------------+----------
     Total |       224      3,913 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = see

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |         4      1,375 |     1,379 
typewriter |         4      1,375 |     1,379 
       zam |         9      1,370 |     1,379 
-----------+----------------------+----------
     Total |        17      4,120 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = seg

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       773        606 |     1,379 
typewriter |       753        626 |     1,379 
       zam |       831        548 |     1,379 
-----------+----------------------+----------
     Total |     2,357      1,780 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = seh

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       136      1,243 |     1,379 
typewriter |       134      1,245 |     1,379 
       zam |       172      1,207 |     1,379 
-----------+----------------------+----------
     Total |       442      3,695 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = sei

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       774        605 |     1,379 
typewriter |       747        632 |     1,379 
       zam |       822        557 |     1,379 
-----------+----------------------+----------
     Total |     2,343      1,794 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = sej

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |        69      1,310 |     1,379 
typewriter |        69      1,310 |     1,379 
       zam |        97      1,282 |     1,379 
-----------+----------------------+----------
     Total |       235      3,902 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = selr

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |        67      1,312 |     1,379 
typewriter |        67      1,312 |     1,379 
       zam |        94      1,285 |     1,379 
-----------+----------------------+----------
     Total |       228      3,909 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = sep

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       110      1,269 |     1,379 
typewriter |       109      1,270 |     1,379 
       zam |       143      1,236 |     1,379 
-----------+----------------------+----------
     Total |       362      3,775 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = seu

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       782        597 |     1,379 
typewriter |       725        654 |     1,379 
       zam |       812        567 |     1,379 
-----------+----------------------+----------
     Total |     2,319      1,818 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = tsst1

           |         value
    method |         p          s |     Total
-----------+----------------------+----------
genefinder |       259      1,120 |     1,379 
typewriter |       255      1,124 |     1,379 
       zam |       298      1,081 |     1,379 
-----------+----------------------+----------
     Total |       812      3,325 |     4,137 


counts differing between method: gene, type, mykrobe

   valueall |      Freq.     Percent        Cum.
------------+-----------------------------------
        sss |     21,446       81.85       81.85
        ppp |      4,156       15.86       97.71
        ssp |        460        1.76       99.47
        psp |        132        0.50       99.97
        spp |          7        0.03      100.00
------------+-----------------------------------
      Total |     26,201      100.00

           |                        valueall
      site |       ppp        psp        spp        ssp        sss |     Total
-----------+-------------------------------------------------------+----------
       eta |        40          0          0         10      1,329 |     1,379 
       etb |         5          1          0          8      1,365 |     1,379 
       etd |        57          1          0          8      1,313 |     1,379 
      meca |       377          2          0          9        991 |     1,379 
      mecc |        17          0          0          0      1,362 |     1,379 
       pvl |       109          1          0         11      1,258 |     1,379 
       sea |       295          3          0         49      1,032 |     1,379 
       seb |       109          2          0         14      1,254 |     1,379 
       sec |       225          4          0         28      1,122 |     1,379 
       sed |        66          0          0         26      1,287 |     1,379 
       see |         4          0          0          5      1,370 |     1,379 
       seg |       753         20          0         58        548 |     1,379 
       seh |       134          2          0         36      1,207 |     1,379 
       sei |       741         33          6         42        557 |     1,379 
       sej |        69          0          0         28      1,282 |     1,379 
      selr |        67          0          0         27      1,285 |     1,379 
       sep |       108          2          1         32      1,236 |     1,379 
       seu |       725         57          0         30        567 |     1,379 
     tsst1 |       255          4          0         39      1,081 |     1,379 
-----------+-------------------------------------------------------+----------
     Total |     4,156        132          7        460     21,446 |    26,201 






================================================================================
 1 add gold standard
================================================================================

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                            26,201
        not updated                    26,201  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------
predictive is gene, type, mykrobe

goldstanda |                        valueall
        rd |       ppp        psp        spp        ssp        sss |     Total
-----------+-------------------------------------------------------+----------
         - |     3,084         99          7        401     17,530 |    21,121 
         A |         1          1          0         18      1,084 |     1,104 
        NA |       452         22          0         39      2,820 |     3,333 
         P |       619         10          0          2         12 |       643 
-----------+-------------------------------------------------------+----------
     Total |     4,156        132          7        460     21,446 |    26,201 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = -

              |                        valueall
         site |       ppp        psp        spp        ssp        sss |     Total
--------------+-------------------------------------------------------+----------
          eta |        18          0          0          9      1,112 |     1,139 
          etb |         1          1          0          7      1,145 |     1,154 
          etd |        30          1          0          6      1,107 |     1,144 
         meca |       215          0          0          4        768 |       987 
         mecc |         0          0          0          0        987 |       987 
          pvl |        16          1          0          1        969 |       987 
          sea |       213          3          0         46        870 |     1,132 
          seb |        74          2          0         11      1,064 |     1,151 
          sec |       158          4          0         26        956 |     1,144 
          sed |        38          0          0         25      1,093 |     1,156 
          see |         0          0          0          5      1,164 |     1,169 
          seg |       604         20          0         54        417 |     1,095 
          seh |        79          1          0         35      1,031 |     1,146 
          sei |       605         21          6         36        428 |     1,096 
          sej |        38          0          0         27      1,087 |     1,152 
         selr |        55          0          0         26      1,091 |     1,172 
          sep |        89          2          1         29      1,051 |     1,172 
          seu |       647         40          0         26        438 |     1,151 
        tsst1 |       204          3          0         28        752 |       987 
--------------+-------------------------------------------------------+----------
        Total |     3,084         99          7        401     17,530 |    21,121 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = A

              |                  valueall
         site |       ppp        psp        ssp        sss |     Total
--------------+--------------------------------------------+----------
          eta |         0          0          0         36 |        36 
          etb |         0          0          0         36 |        36 
          etd |         0          0          0         36 |        36 
         meca |         1          0          4        172 |       177 
         mecc |         0          0          0        155 |       155 
          pvl |         0          0          8        231 |       239 
          sea |         0          0          0         20 |        20 
          seb |         0          0          0         20 |        20 
          sec |         0          0          0         20 |        20 
          sed |         0          0          0         20 |        20 
          see |         0          0          0         20 |        20 
          seg |         0          0          0         20 |        20 
          seh |         0          0          0         20 |        20 
          sei |         0          0          0         20 |        20 
          sej |         0          0          0         20 |        20 
         selr |         0          0          0         20 |        20 
          sep |         0          0          0         20 |        20 
          seu |         0          0          1         19 |        20 
        tsst1 |         0          1          5        179 |       185 
--------------+--------------------------------------------+----------
        Total |         1          1         18      1,084 |     1,104 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = NA

              |                  valueall
         site |       ppp        psp        ssp        sss |     Total
--------------+--------------------------------------------+----------
          eta |         4          0          1        181 |       186 
          etb |         1          0          1        184 |       186 
          etd |        14          0          2        170 |       186 
         meca |        11          1          1         51 |        64 
         mecc |         4          0          0        220 |       224 
          pvl |         2          0          1         55 |        58 
          sea |        45          0          3        139 |       187 
          seb |        14          0          3        170 |       187 
          sec |        40          0          2        145 |       187 
          sed |        12          0          1        174 |       187 
          see |         1          0          0        186 |       187 
          seg |        73          0          4        110 |       187 
          seh |        31          1          1        154 |       187 
          sei |        68          6          5        108 |       187 
          sej |        12          0          1        174 |       187 
         selr |        12          0          1        174 |       187 
          sep |        19          0          3        165 |       187 
          seu |        60         14          3        110 |       187 
        tsst1 |        29          0          6        150 |       185 
--------------+--------------------------------------------+----------
        Total |       452         22         39      2,820 |     3,333 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = P

              |                  valueall
         site |       ppp        psp        ssp        sss |     Total
--------------+--------------------------------------------+----------
          eta |        18          0          0          0 |        18 
          etb |         3          0          0          0 |         3 
          etd |        13          0          0          0 |        13 
         meca |       150          1          0          0 |       151 
         mecc |        13          0          0          0 |        13 
          pvl |        91          0          1          3 |        95 
          sea |        37          0          0          3 |        40 
          seb |        21          0          0          0 |        21 
          sec |        27          0          0          1 |        28 
          sed |        16          0          0          0 |        16 
          see |         3          0          0          0 |         3 
          seg |        76          0          0          1 |        77 
          seh |        24          0          0          2 |        26 
          sei |        68          6          1          1 |        76 
          sej |        19          0          0          1 |        20 
          seu |        18          3          0          0 |        21 
        tsst1 |        22          0          0          0 |        22 
--------------+--------------------------------------------+----------
        Total |       619         10          2         12 |       643 


. 
. * create prediction panals

. import excel "E:\users\amy.mason\philosophy.xlsx", sheet("Sheet2") firstrow clear

. sort starsign
variable starsign not found
r(111);

. sort Star

. gen p1 p2 p3 p4
=exp required
r(100);

. gen p1 p2 p3 p4 ==""
== invalid name
r(198);

. egen seq = fill("Love", "Gates", "Revels")
fill() invalid -- invalid numlist
r(121);

. 
. gen p1 = seq if Earth==1
seq not found
r(111);

. 
. drop seq
variable seq not found
r(111);

. sort character
variable character not found
r(111);

. 
. egen seq = fill(1, 2, 3)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(65 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
(0 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(0 real changes made)

. 
. drop seq

. egen seq = fill(1, 2, 3)

. drop seq p1

. sort character
variable character not found
r(111);

. 
. egen seq = fill(1 2 3)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(65 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
(0 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(0 real changes made)

. 
. drop seq

. egen seq = fill(1 2 3)

. help egen

. egen seq = fill(1 1 1)
variable seq already defined
r(110);

. drop seq

. egen seq = fill(1 1 1)

. egen seq = fill(1 2 1)
variable seq already defined
r(110);

. drop seq

. egen seq = fill(1 2 1)

. drop  p1 seq

. 
. sort character
variable character not found
r(111);

. 
. egen seq = fill(1 2 3 1)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(65 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
(0 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(0 real changes made)

. 
. drop seq

. egen seq = fill(1 2 3 1)

. drop seq

. egen seq = fill(1 2 3 1 1)

. drop seq

. drop p1

. sort character
variable character not found
r(111);

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(58 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
variable p1 was str8 now str10
(7 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(9 real changes made)

. 
. drop seq

. tab p1

         p1 |      Freq.     Percent        Cum.
------------+-----------------------------------
   Devotion |          8       33.33       33.33
   Euphoria |          9       37.50       70.83
 Liminality |          7       29.17      100.00
------------+-----------------------------------
      Total |         24      100.00

. sort group
variable group not found
r(111);

. 
. egen seq = fill(1 2 3 1)

. 
. gen p2 = "Delirium" if Air==1 & seq ==1
(65 missing values generated)

. 
. replace p2 = "Curiosity" if Air==1 & seq==2
(0 real changes made)

. 
. replace p2 = "Serendipity" if Air==3 & seq==3
(0 real changes made)

. drop seq p2

. sort Group

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p2 = "Delirium" if Air==1 & seq ==1
(54 missing values generated)

. 
. replace p2 = "Curiosity" if Air==1 & seq==2
variable p2 was str8 now str9
(9 real changes made)

. 
. replace p2 = "Serendipity" if Air==1 & seq==3
variable p2 was str9 now str11
(10 real changes made)

. 
. drop seq

. tab p2

         p2 |      Freq.     Percent        Cum.
------------+-----------------------------------
  Curiosity |          9       29.03       29.03
   Delirium |         12       38.71       67.74
Serendipity |         10       32.26      100.00
------------+-----------------------------------
      Total |         31      100.00

. sort Nation

. 
. egen seq = fill(1 2 1)

. 
. gen p3 = "Passion" if Water==1 & seq ==1
(49 missing values generated)

. 
. replace p3 = "Patriotism" if Water==1 & seq==2
variable p3 was str7 now str10
(19 real changes made)

. 
. drop seq

. sort p3

. tab p3

         p3 |      Freq.     Percent        Cum.
------------+-----------------------------------
    Passion |         17       47.22       47.22
 Patriotism |         19       52.78      100.00
------------+-----------------------------------
      Total |         36      100.00

. sort StarSign

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p4 = "Ingenuity" if Fire==1 & seq ==1
(59 missing values generated)

. 
. replace p4 = "Purity" if Fire==1 & seq==2
(5 real changes made)

. 
. replace p4 = "Domination" if Fire==1 & seq==3
variable p4 was str9 now str10
(7 real changes made)

. 
. drop seq

. tab p4

         p4 |      Freq.     Percent        Cum.
------------+-----------------------------------
 Domination |          7       36.84       36.84
  Ingenuity |          7       36.84       73.68
     Purity |          5       26.32      100.00
------------+-----------------------------------
      Total |         19      100.00

. replace p3 = p4 if p3==""
(12 real changes made)

. 
. replace p4 = "" if p3==p4
(12 real changes made)

. tab p4

         p4 |      Freq.     Percent        Cum.
------------+-----------------------------------
 Domination |          3       42.86       42.86
  Ingenuity |          1       14.29       57.14
     Purity |          3       42.86      100.00
------------+-----------------------------------
      Total |          7      100.00

. replace p2 = p3 if p2==""
(28 real changes made)

. 
. replace p3 = "" if p2==p3
(28 real changes made)

. 
. 
. 
. replace p2 = p4 if p2==""
(0 real changes made)

. 
. replace p4 = "" if p2==p4
(0 real changes made)

. 
. 
. 
. replace p3 = p4 if p3==""
(6 real changes made)

. 
. replace p4 = "" if p3==p4
(6 real changes made)

. replace p2 = p3 if p2==""
(0 real changes made)

. 
. replace p3 = "" if p2==p3
(0 real changes made)

. import excel "E:\users\amy.mason\philosophy.xlsx", sheet("Sheet2") firstrow clear

. 
. 
. 
. 
. 
. * gen values

. 
. sort Character

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(59 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
variable p1 was str8 now str10
(6 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(11 real changes made)

. 
. drop seq

. 
. sort Group

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p2 = "Delirium" if Air==1 & seq ==1
(57 missing values generated)

. 
. replace p2 = "Curiosity" if Air==1 & seq==2
variable p2 was str8 now str9
(14 real changes made)

. 
. replace p2 = "Serendipity" if Air==1 & seq==3
variable p2 was str9 now str11
(8 real changes made)

. 
. drop seq

. 
. sort Nation

. 
. egen seq = fill(1 2 1)

. 
. gen p3 = "Passion" if Water==1 & seq ==1
(47 missing values generated)

. 
. replace p3 = "Patriotism" if Water==1 & seq==2
variable p3 was str7 now str10
(17 real changes made)

. 
. drop seq

. 
. sort StarSign

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p4 = "Ingenuity" if Fire==1 & seq ==1
(62 missing values generated)

. 
. replace p4 = "Purity" if Fire==1 & seq==2
(8 real changes made)

. 
. replace p4 = "Domination" if Fire==1 & seq==3
variable p4 was str9 now str10
(7 real changes made)

. 
. drop seq

. 
. replace p1 = p2 if p1==""
variable p1 was str10 now str11
(17 real changes made)

. 
. replace p2 = "" if p1==p2
(17 real changes made)

. 
. 
. 
. replace p1 = p3 if p1==""
(19 real changes made)

. 
. replace p3 = "" if p1==p3
(19 real changes made)

. 
. 
. 
. replace p1 = p4 if p1==""
(3 real changes made)

. 
. replace p4 = "" if p1==p4
(3 real changes made)

. tab p1, m

         p1 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |          3        4.55        4.55
  Curiosity |          5        7.58       12.12
   Delirium |          8       12.12       24.24
   Devotion |          7       10.61       34.85
 Domination |          1        1.52       36.36
   Euphoria |         11       16.67       53.03
 Liminality |          6        9.09       62.12
    Passion |         10       15.15       77.27
 Patriotism |          9       13.64       90.91
     Purity |          2        3.03       93.94
Serendipity |          4        6.06      100.00
------------+-----------------------------------
      Total |         66      100.00

. list if p1 ==""

     +-------------------------------------------------------------------------------------------------------------------+
     |    Character                           Group   Nation   StarSign   Air   Earth   Fire   Water   p1   p2   p3   p4 |
     |-------------------------------------------------------------------------------------------------------------------|
  2. |  Androgenese            Children of Ismenius   Greece   Aquarius     0       0      0       0                     |
 61. | Livia Cassia                            null     Rome     Taurus     0       0      0       0                     |
 65. |       Mohsen   The Eternal Kingdom of Spring   Persia      Virgo     0       0      0       0                     |
     +-------------------------------------------------------------------------------------------------------------------+

. 
. replace p2 = p3 if p2==""
(11 real changes made)

. 
. replace p3 = "" if p2==p3
(11 real changes made)

. 
. 
. 
. replace p2 = p4 if p2==""
(14 real changes made)

. 
. replace p4 = "" if p2==p4
(14 real changes made)

. tab p2, m

         p2 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |         27       40.91       40.91
  Curiosity |          9       13.64       54.55
   Delirium |          1        1.52       56.06
 Domination |          5        7.58       63.64
  Ingenuity |          4        6.06       69.70
    Passion |          6        9.09       78.79
 Patriotism |          5        7.58       86.36
     Purity |          5        7.58       93.94
Serendipity |          4        6.06      100.00
------------+-----------------------------------
      Total |         66      100.00

. replace p3 = p4 if p3==""
(2 real changes made)

. 
. replace p4 = "" if p3==p4
(2 real changes made)

. tab p4, m

         p4 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |         66      100.00      100.00
------------+-----------------------------------
      Total |         66      100.00

. gen Principles = p1
(3 missing values generated)

. 
. replace Principles = p1+ ", "+p2  if p2!=""
variable Principles was str11 now str23
(39 real changes made)

. 
. replae Principles = p1+ ", "+p2 + ", " + p3 if p3!=""
command replae is unrecognized
r(199);

. replace Principles = p1+ ", "+p2 + ", " + p3 if p3!=""
variable Principles was str23 now str33
(8 real changes made)

. keep name p*
variable name not found
r(111);

. keep Char p*

. reshape long, i(Char) j(p)
invalid syntax
    In the reshape command that you typed, you omitted the word wide or long, or
    substituted some other word for it.  You should have typed

        . reshape wide varlist, ...
    or
        . reshape long varlist, ...

    You might have omitted varlist, too.  The basic syntax of reshape is

         long                                wide
        +---------------+                   +------------------+
        | i   j   a   b |                   | i   a1 a2  b1 b2 |
        |---------------| <--- reshape ---> |------------------|
        | 1   1   1   2 |                   | 1   1   3   2  4 |
        | 1   2   3   4 |                   | 2   5   7   6  8 |
        | 2   1   5   6 |                   +------------------+
        | 2   2   7   8 |
        +---------------+

        long to wide: reshape wide a b, i(i) j(j)    (j existing variable)
        wide to long: reshape long a b, i(i) j(j)    (j    new   variable)
r(198);

. reshape long p , i(Char) j(number)
(note: j = 1 2 3 4)
variable id does not uniquely identify the observations
    Your data are currently wide.  You are performing a reshape long.  You specified
    i(Character) and j(number).  In the current wide form, variable Character should
    uniquely identify the observations.  Remember this picture:

         long                                wide
        +---------------+                   +------------------+
        | i   j   a   b |                   | i   a1 a2  b1 b2 |
        |---------------| <--- reshape ---> |------------------|
        | 1   1   1   2 |                   | 1   1   3   2  4 |
        | 1   2   3   4 |                   | 2   5   7   6  8 |
        | 2   1   5   6 |                   +------------------+
        | 2   2   7   8 |
        +---------------+
    Type reshape error for a list of the problem observations.
r(9);

. duplicates tag Char, gen(huh)

Duplicates in terms of Character

. tab huh

        huh |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         50       75.76       75.76
          1 |         16       24.24      100.00
------------+-----------------------------------
      Total |         66      100.00

. list if huh==1

     +--------------------------------------------------------------------------+
     |                Character            p1           p2        p3   p4   huh |
     |--------------------------------------------------------------------------|
  2. |              Androgenese                                               1 |
 12. |                   Thutep       Passion   Domination                    1 |
 18. |                     Maya      Delirium   Patriotism                    1 |
 23. |              Androgenese      Devotion       Purity                    1 |
 27. |                   Thutep      Euphoria   Patriotism                    1 |
     |--------------------------------------------------------------------------|
 28. |            Marius Seneca       Passion                                 1 |
 29. |           Malazar Barzin   Serendipity                                 1 |
 32. |            Marius Seneca    Patriotism                                 1 |
 33. |                     Maya      Euphoria    Curiosity                    1 |
 35. |           Malazar Barzin      Euphoria    Curiosity   Passion          1 |
     |--------------------------------------------------------------------------|
 39. | kahi pet shadya (arrows)      Delirium   Patriotism                    1 |
 40. | kahi pet shadya (arrows)    Patriotism    Ingenuity                    1 |
 46. |                    Lyria    Patriotism    Ingenuity                    1 |
 49. |                    Lyria    Liminality   Patriotism                    1 |
 59. |             Vita Licinus      Delirium      Passion                    1 |
     |--------------------------------------------------------------------------|
 60. |             Vita Licinus      Euphoria    Curiosity                    1 |
     +--------------------------------------------------------------------------+

. import excel "E:\users\amy.mason\philosophy.xlsx", sheet("Sheet2") firstrow clear

. 
. 
. 
. 
. 
. * gen values

. 
. sort Character

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(60 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
variable p1 was str8 now str10
(6 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(12 real changes made)

. 
. drop seq

. 
. sort Group

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p2 = "Delirium" if Air==1 & seq ==1
(55 missing values generated)

. 
. replace p2 = "Curiosity" if Air==1 & seq==2
variable p2 was str8 now str9
(13 real changes made)

. 
. replace p2 = "Serendipity" if Air==1 & seq==3
variable p2 was str9 now str11
(7 real changes made)

. 
. drop seq

. 
. sort Nation

. 
. egen seq = fill(1 2 1)

. 
. gen p3 = "Passion" if Water==1 & seq ==1
(48 missing values generated)

. 
. replace p3 = "Patriotism" if Water==1 & seq==2
variable p3 was str7 now str10
(18 real changes made)

. 
. drop seq

. 
. sort StarSign

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p4 = "Ingenuity" if Fire==1 & seq ==1
(60 missing values generated)

. 
. replace p4 = "Purity" if Fire==1 & seq==2
(3 real changes made)

. 
. replace p4 = "Domination" if Fire==1 & seq==3
variable p4 was str9 now str10
(10 real changes made)

. 
. drop seq

. keep Char Group Nation p*

. duplicates tag Char G N, gen(huh)

Duplicates in terms of Character Group Nation

. tab huh

        huh |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       78.79       78.79
          1 |         14       21.21      100.00
------------+-----------------------------------
      Total |         66      100.00

. list if huh==1

     +-----------------------------------------------------------------------+
  4. |      Character |                Group |           Nation |         p1 |
     |    Androgenese | Children of Ismenius |           Greece |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |                  |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 12. |      Character |                Group |           Nation |         p1 |
     |         Thutep |                 null |            Egypt |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |    Patriotism    |    Domination     |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 15. |      Character |                Group |           Nation |         p1 |
     |           Maya | The Spears of Thebes |           Greece |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |      Curiosity    |       Passion    |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 21. |      Character |                Group |           Nation |         p1 |
     |         Thutep |                 null |            Egypt |   Euphoria |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |       Passion    |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 26. |      Character |                Group |           Nation |         p1 |
     |    Androgenese | Children of Ismenius |           Greece | Liminality |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |                  |        Purity     |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 28. |      Character |                Group |           Nation |         p1 |
     |  Marius Seneca |                 null |             Rome |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |    Patriotism    |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 29. |      Character |                Group |           Nation |         p1 |
     | Malazar Barzin |   The Sons of Marduk |           Persia |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |      Curiosity    |                  |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 32. |      Character |                Group |           Nation |         p1 |
     |  Marius Seneca |                 null |             Rome |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |       Passion    |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 33. |      Character |                Group |           Nation |         p1 |
     |           Maya | The Spears of Thebes |           Greece |   Euphoria |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |      Curiosity    |                  |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 38. |      Character |                Group |           Nation |         p1 |
     | Malazar Barzin |   The Sons of Marduk |           Persia |   Euphoria |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |      Curiosity    |    Patriotism    |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 46. |      Character |                Group |           Nation |         p1 |
     |          Lyria |  Sons of Bellerophon | Hellas Phoenicia |   Euphoria |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |       Passion    |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 49. |      Character |                Group |           Nation |         p1 |
     |          Lyria |  Sons of Bellerophon | Hellas Phoenicia |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |                   |    Patriotism    |     Ingenuity     |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 58. |      Character |                Group |           Nation |         p1 |
     |   Vita Licinus |        Neptunes Fist |             Rome |            |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |    Serendipity    |       Passion    |                   |      1     |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 61. |      Character |                Group |           Nation |         p1 |
     |   Vita Licinus |        Neptunes Fist |             Rome |   Euphoria |
     |----------------------------------------------------------+------------|
     |             p2    |            p3    |            p4     |    huh     |
     |      Curiosity    |                  |                   |      1     |
     +-----------------------------------------------------------------------+

. import excel "E:\users\amy.mason\philosophy.xlsx", sheet("Sheet2") firstrow clear

. egen total = rowsum(Air Earth Fire Water)
unknown egen function rowsum()
r(133);

. egen total = sum(Air Earth Fire Water)
AirEarthFireWater not found
r(111);

. help egen

. gen total = Air + Earth + Fire+ Water

. sort C G total

. 
. import excel "E:\users\amy.mason\philosophy.xlsx", sheet("Sheet2") firstrow clear

. 
. 
. 
. gen total = Air + Earth + Fire+ Water

. 
. gsort C G -total

. 
. by Char G: drop if _n>1
(7 observations deleted)

. 
. 
. 
. * gen values

. 
. sort Character

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(51 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
variable p1 was str8 now str10
(8 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(6 real changes made)

. 
. drop seq

. 
. sort Group

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p2 = "Delirium" if Air==1 & seq ==1
(52 missing values generated)

. 
. replace p2 = "Curiosity" if Air==1 & seq==2
variable p2 was str8 now str9
(9 real changes made)

. 
. replace p2 = "Serendipity" if Air==1 & seq==3
variable p2 was str9 now str11
(12 real changes made)

. 
. drop seq

. 
. sort Nation

. 
. egen seq = fill(1 2 1)

. 
. gen p3 = "Passion" if Water==1 & seq ==1
(44 missing values generated)

. 
. replace p3 = "Patriotism" if Water==1 & seq==2
variable p3 was str7 now str10
(17 real changes made)

. 
. drop seq

. 
. sort StarSign

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p4 = "Ingenuity" if Fire==1 & seq ==1
(55 missing values generated)

. 
. replace p4 = "Purity" if Fire==1 & seq==2
(10 real changes made)

. 
. replace p4 = "Domination" if Fire==1 & seq==3
variable p4 was str9 now str10
(4 real changes made)

. 
. drop seq

. 
. 
. 
. * collapse

. 
. 
. 
. replace p1 = p2 if p1==""
variable p1 was str10 now str11
(15 real changes made)

. 
. replace p2 = "" if p1==p2
(15 real changes made)

. 
. 
. 
. replace p1 = p3 if p1==""
(17 real changes made)

. 
. replace p3 = "" if p1==p3
(17 real changes made)

. 
. 
. 
. replace p1 = p4 if p1==""
(3 real changes made)

. 
. replace p4 = "" if p1==p4
(3 real changes made)

. 
. 
. 
. 
. 
. replace p2 = p3 if p2==""
(9 real changes made)

. 
. replace p3 = "" if p2==p3
(9 real changes made)

. 
. 
. 
. replace p2 = p4 if p2==""
(13 real changes made)

. 
. replace p4 = "" if p2==p4
(13 real changes made)

. 
. 
. 
. replace p3 = p4 if p3==""
(2 real changes made)

. 
. replace p4 = "" if p3==p4
(2 real changes made)

. 
. 
. 
. assert p4==""

. 
. drop p4

. 
. 
. 
. gen Principles = p1
(2 missing values generated)

. 
. replace Principles = p1+ ", "+p2  if p2!=""
variable Principles was str11 now str23
(35 real changes made)

. 
. replace Principles = p1+ ", "+p2 + ", " + p3 if p3!=""
variable Principles was str23 now str35
(8 real changes made)

. keep Char G p*

. reshape long p, i(C G) j(count)
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       59   ->     177
Number of variables                   5   ->       4
j variable (3 values)                     ->   count
xij variables:
                               p1 p2 p3   ->   p
-----------------------------------------------------------------------------

. tab p

          p |      Freq.     Percent        Cum.
------------+-----------------------------------
  Curiosity |          9        9.00        9.00
   Delirium |          7        7.00       16.00
   Devotion |          8        8.00       24.00
 Domination |          4        4.00       28.00
   Euphoria |          6        6.00       34.00
  Ingenuity |          4        4.00       38.00
 Liminality |          8        8.00       46.00
    Passion |         15       15.00       61.00
 Patriotism |         17       17.00       78.00
     Purity |         10       10.00       88.00
Serendipity |         12       12.00      100.00
------------+-----------------------------------
      Total |        100      100.00

. * philosophy

. 
. 
. 
. import excel "E:\users\amy.mason\philosophy.xlsx", sheet("Sheet2") firstrow clear

. 
. 
. 
. gen total = Air + Earth + Fire+ Water

. 
. gsort C G -total

. 
. by Char G: drop if _n>1
(7 observations deleted)

. 
. 
. 
. * gen values

. 
. sort Character

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(52 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
variable p1 was str8 now str10
(9 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(7 real changes made)

. 
. drop seq

. 
. sort Group

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p2 = "Delirium" if Air==1 & seq ==1
(51 missing values generated)

. 
. replace p2 = "Curiosity" if Air==1 & seq==2
variable p2 was str8 now str9
(9 real changes made)

. 
. replace p2 = "Serendipity" if Air==1 & seq==3
variable p2 was str9 now str11
(11 real changes made)

. 
. drop seq

. 
. sort Nation

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p3 = "Passion" if Water==1 & seq ==1
(52 missing values generated)

. 
. replace p3 = "Patriotism" if Water==1 & seq==2
variable p3 was str7 now str10
(12 real changes made)

. 
. replace p3 = "Patriotism" if Water==1 & seq==3
(12 real changes made)

. 
. drop seq

. 
. sort StarSign

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p4 = "Ingenuity" if Fire==1 & seq ==1
(55 missing values generated)

. 
. replace p4 = "Purity" if Fire==1 & seq==2
(10 real changes made)

. 
. replace p4 = "Domination" if Fire==1 & seq==3
variable p4 was str9 now str10
(4 real changes made)

. 
. drop seq

. 
. 
. 
. * collapse

. 
. 
. 
. replace p1 = p2 if p1==""
variable p1 was str10 now str11
(14 real changes made)

. 
. replace p2 = "" if p1==p2
(14 real changes made)

. 
. 
. 
. replace p1 = p3 if p1==""
(17 real changes made)

. 
. replace p3 = "" if p1==p3
(17 real changes made)

. 
. 
. 
. replace p1 = p4 if p1==""
(3 real changes made)

. 
. replace p4 = "" if p1==p4
(3 real changes made)

. 
. 
. 
. 
. 
. replace p2 = p3 if p2==""
(8 real changes made)

. 
. replace p3 = "" if p2==p3
(8 real changes made)

. 
. 
. 
. replace p2 = p4 if p2==""
(13 real changes made)

. 
. replace p4 = "" if p2==p4
(13 real changes made)

. 
. 
. 
. replace p3 = p4 if p3==""
(2 real changes made)

. 
. replace p4 = "" if p3==p4
(2 real changes made)

. 
. 
. 
. assert p4==""

. 
. drop p4

. 
. 
. 
. gen Principles = p1
(2 missing values generated)

. 
. replace Principles = p1+ ", "+p2  if p2!=""
variable Principles was str11 now str23
(35 real changes made)

. 
. replace Principles = p1+ ", "+p2 + ", " + p3 if p3!=""
variable Principles was str23 now str35
(8 real changes made)

. 
. 
. 
. * check counts

. 
. 
. 
. keep Char G p*

. 
. reshape long p, i(C G) j(count)
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       59   ->     177
Number of variables                   5   ->       4
j variable (3 values)                     ->   count
xij variables:
                               p1 p2 p3   ->   p
-----------------------------------------------------------------------------

. 
. tab p

          p |      Freq.     Percent        Cum.
------------+-----------------------------------
  Curiosity |          9        9.00        9.00
   Delirium |          8        8.00       17.00
   Devotion |          7        7.00       24.00
 Domination |          4        4.00       28.00
   Euphoria |          7        7.00       35.00
  Ingenuity |          4        4.00       39.00
 Liminality |          9        9.00       48.00
    Passion |          7        7.00       55.00
 Patriotism |         24       24.00       79.00
     Purity |         10       10.00       89.00
Serendipity |         11       11.00      100.00
------------+-----------------------------------
      Total |        100      100.00

. * philosophy

. 
. 
. 
. import excel "E:\users\amy.mason\philosophy.xlsx", sheet("Sheet2") firstrow clear

. 
. 
. 
. gen total = Air + Earth + Fire+ Water

. 
. gsort C G -total

. 
. by Char G: drop if _n>1
(7 observations deleted)

. 
. 
. 
. * gen values

. 
. sort Character

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p1 = "Devotion" if Earth==1 & seq==1
(51 missing values generated)

. 
. replace p1 = "Liminality" if Earth==1 & seq ==2
variable p1 was str8 now str10
(8 real changes made)

. 
. replace p1 = "Euphoria" if Earth==1 & seq ==3
(6 real changes made)

. 
. drop seq

. 
. sort Group

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p2 = "Delirium" if Air==1 & seq ==1
(49 missing values generated)

. 
. replace p2 = "Curiosity" if Air==1 & seq==2
variable p2 was str8 now str9
(8 real changes made)

. 
. replace p2 = "Serendipity" if Air==1 & seq==3
variable p2 was str9 now str11
(10 real changes made)

. 
. drop seq

. 
. sort Nation

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p3 = "Passion" if Water==1 & seq ==1
(49 missing values generated)

. 
. replace p3 = "Patriotism" if Water==1 & seq==2
variable p3 was str7 now str10
(10 real changes made)

. 
. replace p3 = "Patriotism" if Water==1 & seq==3
(12 real changes made)

. 
. drop seq

. 
. sort StarSign

. 
. egen seq = fill(1 2 3 1 1)

. 
. gen p4 = "Ingenuity" if Fire==1 & seq ==1
(55 missing values generated)

. 
. replace p4 = "Purity" if Fire==1 & seq==2
(4 real changes made)

. 
. replace p4 = "Domination" if Fire==1 & seq==3
variable p4 was str9 now str10
(10 real changes made)

. 
. drop seq

. 
. 
. 
. * collapse

. 
. 
. 
. replace p1 = p2 if p1==""
variable p1 was str10 now str11
(15 real changes made)

. 
. replace p2 = "" if p1==p2
(15 real changes made)

. 
. 
. 
. replace p1 = p3 if p1==""
(17 real changes made)

. 
. replace p3 = "" if p1==p3
(17 real changes made)

. 
. 
. 
. replace p1 = p4 if p1==""
(3 real changes made)

. 
. replace p4 = "" if p1==p4
(3 real changes made)

. 
. 
. 
. 
. 
. replace p2 = p3 if p2==""
(9 real changes made)

. 
. replace p3 = "" if p2==p3
(9 real changes made)

. 
. 
. 
. replace p2 = p4 if p2==""
(13 real changes made)

. 
. replace p4 = "" if p2==p4
(13 real changes made)

. 
. 
. 
. replace p3 = p4 if p3==""
(2 real changes made)

. 
. replace p4 = "" if p3==p4
(2 real changes made)

. 
. 
. 
. assert p4==""

. 
. drop p4

. 
. 
. 
. gen Principles = p1
(2 missing values generated)

. 
. replace Principles = p1+ ", "+p2  if p2!=""
variable Principles was str11 now str23
(35 real changes made)

. 
. replace Principles = p1+ ", "+p2 + ", " + p3 if p3!=""
variable Principles was str23 now str33
(8 real changes made)

. 
. 
. 
. tab Prin

                       Principles |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
                        Curiosity |          2        3.51        3.51
            Curiosity, Patriotism |          1        1.75        5.26
 Curiosity, Patriotism, Ingenuity |          1        1.75        7.02
             Delirium, Domination |          2        3.51       10.53
             Delirium, Patriotism |          2        3.51       14.04
                 Delirium, Purity |          2        3.51       17.54
              Devotion, Curiosity |          1        1.75       19.30
  Devotion, Curiosity, Patriotism |          1        1.75       21.05
               Devotion, Delirium |          1        1.75       22.81
   Devotion, Delirium, Patriotism |          1        1.75       24.56
             Devotion, Domination |          2        3.51       28.07
             Devotion, Patriotism |          1        1.75       29.82
            Devotion, Serendipity |          1        1.75       31.58
                       Domination |          2        3.51       35.09
                         Euphoria |          2        3.51       38.60
               Euphoria, Delirium |          1        1.75       40.35
              Euphoria, Ingenuity |          1        1.75       42.11
            Euphoria, Serendipity |          1        1.75       43.86
Euphoria, Serendipity, Patriotism |          1        1.75       45.61
                       Liminality |          2        3.51       49.12
            Liminality, Curiosity |          1        1.75       50.88
Liminality, Curiosity, Domination |          1        1.75       52.63
 Liminality, Delirium, Patriotism |          1        1.75       54.39
           Liminality, Patriotism |          1        1.75       56.14
 Liminality, Serendipity, Passion |          2        3.51       59.65
                          Passion |          4        7.02       66.67
              Passion, Domination |          2        3.51       70.18
                  Passion, Purity |          1        1.75       71.93
                       Patriotism |          8       14.04       85.96
            Patriotism, Ingenuity |          2        3.51       89.47
                           Purity |          1        1.75       91.23
                      Serendipity |          1        1.75       92.98
          Serendipity, Domination |          1        1.75       94.74
             Serendipity, Passion |          1        1.75       96.49
          Serendipity, Patriotism |          2        3.51      100.00
----------------------------------+-----------------------------------
                            Total |         57      100.00

. gen problem = 1 if strpos(Prin, "Devotion")
(51 missing values generated)

. gen problem = strpos(Prin, "Devotion")
variable problem already defined
r(110);

. drop pro

. gen problem = strpos(Prin, "Devotion")

. replace problem = problem +1 if strpos(Prin, "Delirium")
(10 real changes made)

. replace problem = problem +1 if strpos(Prin, "Passion")
(10 real changes made)

. replace problem = problem +1 if strpos(Prin, "Ingenuity")
(4 real changes made)

. tab problem

    problem |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         29       49.15       49.15
          1 |         28       47.46       96.61
          2 |          2        3.39      100.00
------------+-----------------------------------
      Total |         59      100.00

. list if problem==2

     +-----------------------------------------------------------------------------------+
 15. |    Character |                Group | Nation  | StarSign  | Air  | Earth  | Fire  |
     | Gabriel Heel |                 null | Persia  |   Cancer  |   1  |     1  |    0  |
     |-------------------------------------+---------------------------------------------|
     | Water | total |       p1 |       p2 |         p3 |                     Principles |
     |     1 |     3 | Devotion | Delirium | Patriotism | Devotion, Delirium, Patriotism |
     |-----------------------------------------------------------------------------------|
     |                                      problem                                      |
     |                                            2                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 30. |    Character |                Group | Nation  | StarSign  | Air  | Earth  | Fire  |
     |     Cassiana | The Spears of Thebes | Greece  |      Leo  |   1  |     1  |    0  |
     |-------------------------------------+---------------------------------------------|
     | Water | total |       p1 |       p2 |         p3 |                     Principles |
     |     0 |     2 | Devotion | Delirium |            |             Devotion, Delirium |
     |-----------------------------------------------------------------------------------|
     |                                      problem                                      |
     |                                            2                                      |
     +-----------------------------------------------------------------------------------+

. gsort -problem

. replace Principles = "Liminality, Delirium, Patriotism" in 1
(1 real change made)

. replace Principles = "Devotion, Serendipity" in 2
(1 real change made)

. sort Nation Character Group

. keep Nation Character Group Principles

. Order Nation C G P
command Order not defined by Order.ado
r(199);

. order Nation C G P

. export excel using "E:\users\amy.mason\phil2.xls", firstrow(variables)
file E:\users\amy.mason\phil2.xls saved

. noi di "combine"
combine

. 
. use pipeline_data_gf, clear

. 
. append using pipeline_data_tw.dta, force
(note: variable comments was str7, now str68 to accommodate using data's values)
(note: variable value was str27, now str34 to accommodate using data's values)

. 
. append using pipeline_data_z2.dta, force
(note: variable comments was str68, now str187 to accommodate using data's values)

. 
. replace site = lower(site)
(288,639 real changes made)

. 
. noi di _N " results"
393727 results

. 
. bysort site: gen tab=1 if _n==1
(393,595 missing values generated)

. 
. summ tab 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |        132           1           0          1          1

. 
. noi di "on " r(sum) " sites"
on 132 sites

. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      2,778        0.71        0.71
      aacaaphd |      1,429        0.36        1.07
    aaddaph4ia |      4,207        1.07        2.14
    aadeant6ia |      4,207        1.07        3.21
          acrb |      2,778        0.71        3.91
          acrc |      2,778        0.71        4.62
          acrd |      2,778        0.71        5.32
allelicprofile |      1,389        0.35        5.67
    ant9_iaspc |      2,778        0.71        6.38
    ant9_ibspc |      2,778        0.71        7.09
        ant9ia |      1,429        0.36        7.45
        ant9ib |      1,429        0.36        7.81
        aph2ic |      4,207        1.07        8.88
  apha3aph3iii |      4,207        1.07        9.95
          arca |      4,206        1.07       11.02
          arcb |      1,428        0.36       11.38
          arcc |      1,429        0.36       11.74
          arcd |      1,428        0.36       12.11
          blaz |      4,207        1.07       13.17
           cat |      4,207        1.07       14.24
          ccra |      1,429        0.36       14.61
        ccra_1 |      2,778        0.71       15.31
        ccra_2 |      2,778        0.71       16.02
        ccra_3 |      2,778        0.71       16.72
        ccra_4 |      2,778        0.71       17.43
          ccrb |      1,427        0.36       17.79
        ccrb_1 |      2,778        0.71       18.50
        ccrb_2 |      2,778        0.71       19.20
        ccrb_3 |      2,778        0.71       19.91
        ccrb_4 |      2,778        0.71       20.61
        ccrb_6 |      2,778        0.71       21.32
        ccrc_a |      2,778        0.71       22.02
        ccrc_b |      2,778        0.71       22.73
        ccrc_c |      2,778        0.71       23.43
         ccrca |      1,429        0.36       23.80
         ccrcb |      1,427        0.36       24.16
         ccrcc |      1,428        0.36       24.52
           cfr |      4,207        1.07       25.59
           chp |      4,207        1.07       26.66
         dfr_a |      2,778        0.71       27.37
         dfr_c |      2,778        0.71       28.07
         dfr_d |      2,778        0.71       28.78
         dfr_g |      2,778        0.71       29.48
         dfr_k |      2,778        0.71       30.19
          dfra |      1,429        0.36       30.55
          dfrb |      4,206        1.07       31.62
          dfrc |      1,429        0.36       31.98
          dfrd |      1,429        0.36       32.34
          dfrg |      1,429        0.36       32.71
          dfrk |      1,429        0.36       33.07
          erma |      1,429        0.36       33.43
        erma_1 |      2,778        0.71       34.14
        erma_2 |      2,778        0.71       34.84
          ermb |      4,207        1.07       35.91
          ermc |      4,207        1.07       36.98
          ermt |      4,207        1.07       38.05
          ermy |      4,207        1.07       39.12
           eta |      4,207        1.07       40.19
           etb |      4,205        1.07       41.26
           etd |      4,206        1.07       42.32
         fus_b |      2,778        0.71       43.03
         fus_c |      2,778        0.71       43.73
          fusa |      4,206        1.07       44.80
          fusb |      1,429        0.36       45.17
          fusc |      1,429        0.36       45.53
          grla |      4,206        1.07       46.60
          gyra |      4,205        1.07       47.67
         ile_s |        491        0.12       47.79
          iles |      2,287        0.58       48.37
          isab |      4,207        1.07       49.44
         lnu_a |      2,778        0.71       50.14
         lnu_b |      2,778        0.71       50.85
          lnua |      1,429        0.36       51.21
          lnub |      1,429        0.36       51.58
           luk |      1,429        0.36       51.94
          lukm |      4,207        1.07       53.01
         lukmf |      4,206        1.07       54.08
        lukpvf |      4,207        1.07       55.14
        lukpvs |      4,207        1.07       56.21
          meca |      4,207        1.07       57.28
          mecc |      4,207        1.07       58.35
          mlst |      1,389        0.35       58.70
          mphc |      4,207        1.07       59.77
          msra |      4,207        1.07       60.84
          mupa |      4,207        1.07       61.91
          mupb |      4,207        1.07       62.98
         qac_a |      2,778        0.71       63.68
         qac_b |      2,778        0.71       64.39
      qac_csmr |      2,778        0.71       65.09
          qaca |      1,429        0.36       65.46
          qacb |      1,429        0.36       65.82
       qaccsmr |      1,429        0.36       66.18
          rpob |      4,206        1.07       67.25
           sak |      4,207        1.07       68.32
          sasx |      4,207        1.07       69.39
          sat4 |      4,207        1.07       70.46
           scn |      4,207        1.07       71.52
           sea |      1,428        0.36       71.89
         sea_1 |      2,778        0.71       72.59
         sea_2 |      2,778        0.71       73.30
           seb |      4,206        1.07       74.37
           sec |      4,206        1.07       75.43
           sed |      4,206        1.07       76.50
           see |      4,207        1.07       77.57
           seg |      4,207        1.07       78.64
           seh |      1,429        0.36       79.00
         seh_1 |      2,778        0.71       79.71
         seh_2 |      2,778        0.71       80.41
           sei |      4,207        1.07       81.48
           sej |      4,207        1.07       82.55
          selr |      4,207        1.07       83.62
           sep |      4,207        1.07       84.69
           seu |      1,429        0.36       85.05
         seu_1 |      2,778        0.71       85.76
         seu_2 |      2,778        0.71       86.46
            st |      1,389        0.35       86.81
           str |      4,207        1.07       87.88
          tetk |      4,207        1.07       88.95
          tetl |      4,207        1.07       90.02
          tetm |      4,207        1.07       91.09
          teto |      4,207        1.07       92.16
         tsst1 |      4,207        1.07       93.23
         van_a |      2,778        0.71       93.93
         van_b |      2,778        0.71       94.64
         van_c |      2,778        0.71       95.34
          vana |      1,429        0.36       95.71
          vanb |      1,429        0.36       96.07
          vanc |      1,429        0.36       96.43
          vgaa |      4,207        1.07       97.50
        vgaalc |      1,429        0.36       97.86
          vgab |      4,207        1.07       98.93
          vgba |      4,207        1.07      100.00
---------------+-----------------------------------
         Total |    393,727      100.00

. 
. drop tab

. 
. bysort sample: gen tab=1 if _n==1
(392,298 missing values generated)

. 
. summ tab

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |      1,429           1           0          1          1

. 
. noi di "from " r(sum) " samples"
from 1429 samples

. 
. tab set if tab==1

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
 Collindale |        397       27.78       27.78
  Oxford491 |        492       34.43       62.21
  Oxford501 |        540       37.79      100.00
------------+-----------------------------------
      Total |      1,429      100.00

. 
. drop tab

. duplicates tag sample, gen(multi)

Duplicates in terms of sample

. tab mul

      multi |      Freq.     Percent        Cum.
------------+-----------------------------------
         73 |         74        0.02        0.02
         75 |         76        0.02        0.04
         85 |      3,268        0.83        0.87
        280 |    390,309       99.13      100.00
------------+-----------------------------------
      Total |    393,727      100.00

. drop multi

. duplicates tag sample method site, gen(multi)

Duplicates in terms of sample method site

. tab multi

      multi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    393,727      100.00      100.00
------------+-----------------------------------
      Total |    393,727      100.00

. tab samples if set=="Oxford501"
variable samples not found
r(111);

. tab sample if set=="Oxford501"

           Sample_id |      Freq.     Percent        Cum.
---------------------+-----------------------------------
           C00000784 |        281        0.19        0.19
           C00000785 |        281        0.19        0.39
           C00000786 |        281        0.19        0.58
           C00000787 |        281        0.19        0.78
           C00000788 |        281        0.19        0.97
           C00000789 |        281        0.19        1.17
           C00000790 |        281        0.19        1.36
           C00000795 |        281        0.19        1.56
           C00000796 |        281        0.19        1.75
           C00000799 |        281        0.19        1.95
           C00000800 |        281        0.19        2.14
           C00000805 |        281        0.19        2.34
           C00000806 |        281        0.19        2.53
           C00000808 |        281        0.19        2.73
           C00000809 |        281        0.19        2.92
           C00000814 |        281        0.19        3.12
           C00000815 |        281        0.19        3.31
           C00000816 |        281        0.19        3.51
           C00000817 |        281        0.19        3.70
           C00000818 |        281        0.19        3.90
           C00000819 |        281        0.19        4.09
           C00000820 |        281        0.19        4.29
           C00000825 |        281        0.19        4.48
           C00000826 |        281        0.19        4.68
           C00000827 |        281        0.19        4.87
           C00000828 |        281        0.19        5.07
           C00000829 |        281        0.19        5.26
           C00000830 |        281        0.19        5.46
           C00000831 |        281        0.19        5.65
           C00000834 |        281        0.19        5.85
           C00000835 |        281        0.19        6.04
           C00000836 |        281        0.19        6.24
           C00000837 |        281        0.19        6.43
           C00000838 |        281        0.19        6.63
           C00000839 |        281        0.19        6.82
           C00000840 |        281        0.19        7.02
           C00000845 |        281        0.19        7.21
           C00000846 |        281        0.19        7.41
           C00000847 |        281        0.19        7.60
           C00000848 |        281        0.19        7.80
           C00000849 |        281        0.19        7.99
           C00000850 |        281        0.19        8.19
           C00000851 |        281        0.19        8.38
           C00000852 |        281        0.19        8.58
           C00000857 |        281        0.19        8.77
           C00000858 |        281        0.19        8.97
           C00000859 |        281        0.19        9.16
           C00000860 |        281        0.19        9.36
           C00000861 |        281        0.19        9.55
           C00000862 |        281        0.19        9.75
           C00000863 |        281        0.19        9.94
           C00000864 |        281        0.19       10.14
           C00001384 |        281        0.19       10.33
           C00001385 |        281        0.19       10.53
           C00001386 |        281        0.19       10.72
           C00001387 |        281        0.19       10.92
           C00001388 |        281        0.19       11.11
           C00001389 |        281        0.19       11.31
           C00001390 |        281        0.19       11.50
           C00001397 |        281        0.19       11.70
           C00001399 |        281        0.19       11.89
           C00001400 |        281        0.19       12.09
           C00001401 |        281        0.19       12.28
           C00001402 |        281        0.19       12.48
           C00001404 |        281        0.19       12.67
           C00001405 |        281        0.19       12.87
           C00001406 |        281        0.19       13.06
           C00001440 |        281        0.19       13.26
           C00001441 |        281        0.19       13.45
           C00001442 |        281        0.19       13.65
           C00001443 |        281        0.19       13.84
           C00001445 |        281        0.19       14.04
           C00001446 |        281        0.19       14.23
           C00001447 |        281        0.19       14.43
           C00001448 |        281        0.19       14.62
           C00001449 |        281        0.19       14.82
           C00001451 |        281        0.19       15.01
           C00001452 |        281        0.19       15.21
           C00001453 |        281        0.19       15.40
           C00002649 |        281        0.19       15.60
           C00002652 |        281        0.19       15.79
           C00002653 |        281        0.19       15.99
           C00002655 |        281        0.19       16.18
           C00002656 |        281        0.19       16.38
           C00002657 |        281        0.19       16.57
           C00002658 |        281        0.19       16.77
           C00002661 |        281        0.19       16.96
           C00002662 |        281        0.19       17.16
           C00003083 |        281        0.19       17.35
           C00003084 |        281        0.19       17.55
           C00003085 |        281        0.19       17.74
           C00003086 |        281        0.19       17.94
           C00003087 |        281        0.19       18.13
           C00003088 |        281        0.19       18.33
           C00003089 |        281        0.19       18.52
           C00003090 |        281        0.19       18.72
           C00003091 |        281        0.19       18.91
           C00003092 |        281        0.19       19.11
           C00003093 |        281        0.19       19.30
           C00003094 |         86        0.06       19.36
           C00003095 |        281        0.19       19.56
           C00003096 |        281        0.19       19.75
           C00003098 |        281        0.19       19.95
           C00003099 |        281        0.19       20.14
           C00003100 |        281        0.19       20.34
           C00003101 |        281        0.19       20.53
           C00003102 |        281        0.19       20.73
           C00003103 |        281        0.19       20.92
           C00003104 |        281        0.19       21.12
           C00003106 |        281        0.19       21.31
           C00003107 |        281        0.19       21.51
           C00003108 |        281        0.19       21.70
           C00003109 |        281        0.19       21.90
           C00003110 |        281        0.19       22.09
           C00003111 |        281        0.19       22.29
           C00003112 |        281        0.19       22.48
           C00003113 |        281        0.19       22.68
           C00003114 |        281        0.19       22.87
           C00003115 |        281        0.19       23.07
           C00003116 |        281        0.19       23.26
           C00003117 |         86        0.06       23.32
           C00003118 |        281        0.19       23.52
           C00003119 |        281        0.19       23.71
           C00003120 |        281        0.19       23.91
           C00003121 |        281        0.19       24.10
           C00003122 |        281        0.19       24.30
           C00003123 |         86        0.06       24.36
           C00003124 |        281        0.19       24.55
           C00003125 |        281        0.19       24.75
           C00003126 |        281        0.19       24.94
           C00003127 |        281        0.19       25.14
           C00003128 |        281        0.19       25.33
           C00003129 |        281        0.19       25.53
           C00003130 |        281        0.19       25.72
           C00003131 |        281        0.19       25.92
           C00003132 |        281        0.19       26.11
           C00003133 |        281        0.19       26.31
           C00003134 |        281        0.19       26.50
           C00003135 |        281        0.19       26.70
           C00003136 |        281        0.19       26.89
           C00003137 |        281        0.19       27.09
           C00003138 |        281        0.19       27.28
           C00003139 |        281        0.19       27.48
           C00003140 |        281        0.19       27.67
           C00003141 |        281        0.19       27.87
           C00003142 |        281        0.19       28.06
           C00003143 |        281        0.19       28.26
           C00003144 |        281        0.19       28.45
           C00003145 |        281        0.19       28.65
           C00003147 |        281        0.19       28.84
           C00003148 |        281        0.19       29.04
           C00003149 |        281        0.19       29.23
           C00003150 |        281        0.19       29.43
           C00003151 |        281        0.19       29.62
           C00003152 |        281        0.19       29.82
           C00003153 |        281        0.19       30.01
           C00003154 |        281        0.19       30.21
           C00003155 |        281        0.19       30.40
           C00003156 |        281        0.19       30.60
           C00003158 |        281        0.19       30.79
           C00003159 |        281        0.19       30.99
           C00003160 |        281        0.19       31.18
           C00003161 |        281        0.19       31.38
           C00003162 |        281        0.19       31.57
           C00003163 |        281        0.19       31.77
           C00003164 |        281        0.19       31.96
           C00003165 |        281        0.19       32.16
           C00003166 |        281        0.19       32.35
           C00003167 |        281        0.19       32.55
           C00003168 |        281        0.19       32.74
           C00003169 |        281        0.19       32.94
           C00003170 |        281        0.19       33.13
           C00003171 |        281        0.19       33.33
           C00003172 |        281        0.19       33.52
           C00003173 |        281        0.19       33.72
           C00003174 |        281        0.19       33.91
           C00003175 |        281        0.19       34.11
           C00003176 |        281        0.19       34.30
           C00003177 |        281        0.19       34.50
           C00003178 |        281        0.19       34.69
           C00003179 |        281        0.19       34.89
           C00003180 |        281        0.19       35.08
           C00003181 |        281        0.19       35.28
           C00003182 |        281        0.19       35.47
           C00003183 |        281        0.19       35.67
           C00003184 |        281        0.19       35.86
           C00003185 |        281        0.19       36.06
           C00003186 |        281        0.19       36.25
           C00003187 |        281        0.19       36.45
           C00003188 |        281        0.19       36.64
           C00003189 |        281        0.19       36.84
           C00003190 |        281        0.19       37.03
           C00003191 |        281        0.19       37.23
           C00003192 |        281        0.19       37.42
           C00003193 |        281        0.19       37.62
           C00003194 |        281        0.19       37.81
           C00003195 |        281        0.19       38.01
           C00003196 |        281        0.19       38.20
           C00003197 |        281        0.19       38.40
           C00003198 |        281        0.19       38.59
           C00003199 |        281        0.19       38.79
           C00003200 |        281        0.19       38.98
           C00003201 |        281        0.19       39.18
           C00003202 |        281        0.19       39.37
           C00003203 |        281        0.19       39.57
           C00003204 |        281        0.19       39.76
           C00003205 |        281        0.19       39.96
           C00003206 |        281        0.19       40.15
           C00003207 |        281        0.19       40.35
           C00003208 |        281        0.19       40.54
           C00003209 |        281        0.19       40.74
           C00003210 |        281        0.19       40.93
           C00003211 |        281        0.19       41.13
           C00003212 |        281        0.19       41.32
           C00003213 |        281        0.19       41.52
           C00003214 |         86        0.06       41.58
           C00003215 |        281        0.19       41.77
           C00003216 |        281        0.19       41.97
           C00003217 |        281        0.19       42.16
           C00003218 |        281        0.19       42.36
           C00003219 |        281        0.19       42.55
           C00003220 |        281        0.19       42.75
           C00003221 |        281        0.19       42.94
           C00003222 |        281        0.19       43.14
           C00003223 |        281        0.19       43.33
           C00003224 |        281        0.19       43.53
           C00003225 |        281        0.19       43.72
           C00003226 |        281        0.19       43.92
           C00003227 |        281        0.19       44.11
           C00003228 |        281        0.19       44.31
           C00003229 |        281        0.19       44.50
           C00003231 |        281        0.19       44.70
           C00003232 |        281        0.19       44.89
           C00003233 |        281        0.19       45.09
           C00003235 |        281        0.19       45.28
           C00003236 |        281        0.19       45.48
           C00003237 |        281        0.19       45.67
           C00003238 |        281        0.19       45.87
           C00003239 |        281        0.19       46.06
           C00003240 |        281        0.19       46.26
           C00003241 |        281        0.19       46.45
           C00003242 |        281        0.19       46.65
           C00003243 |        281        0.19       46.84
           C00003244 |        281        0.19       47.04
           C00003245 |        281        0.19       47.23
           C00003246 |        281        0.19       47.43
           C00003247 |        281        0.19       47.62
           C00003248 |        281        0.19       47.82
           C00003249 |        281        0.19       48.01
           C00003250 |        281        0.19       48.21
           C00003251 |        281        0.19       48.40
           C00003252 |        281        0.19       48.60
           C00003253 |        281        0.19       48.79
           C00003254 |        281        0.19       48.99
           C00003255 |        281        0.19       49.18
           C00003256 |        281        0.19       49.38
           C00003257 |        281        0.19       49.57
           C00003258 |        281        0.19       49.77
           C00003259 |        281        0.19       49.96
           C00003260 |        281        0.19       50.16
           C00003261 |        281        0.19       50.35
           C00003262 |        281        0.19       50.55
           C00003263 |        281        0.19       50.74
           C00003264 |        281        0.19       50.94
           C00003265 |        281        0.19       51.13
           C00003266 |        281        0.19       51.33
           C00003267 |        281        0.19       51.52
           C00003268 |        281        0.19       51.71
           C00003269 |        281        0.19       51.91
           C00003270 |        281        0.19       52.10
           C00003271 |        281        0.19       52.30
           C00003272 |        281        0.19       52.49
           C00003273 |         86        0.06       52.55
           C00003274 |        281        0.19       52.75
           C00003275 |        281        0.19       52.94
           C00003276 |        281        0.19       53.14
           C00003277 |        281        0.19       53.33
           C00003278 |        281        0.19       53.53
           C00003279 |        281        0.19       53.72
           C00003280 |        281        0.19       53.92
           C00003281 |        281        0.19       54.11
           C00003282 |        281        0.19       54.31
           C00003283 |        281        0.19       54.50
           C00003284 |        281        0.19       54.70
           C00003285 |        281        0.19       54.89
           C00003286 |        281        0.19       55.09
           C00003287 |        281        0.19       55.28
           C00003288 |        281        0.19       55.48
           C00003289 |        281        0.19       55.67
           C00003290 |        281        0.19       55.87
           C00003291 |        281        0.19       56.06
           C00003292 |        281        0.19       56.26
           C00003293 |         86        0.06       56.32
           C00003294 |        281        0.19       56.51
           C00003295 |        281        0.19       56.71
           C00003296 |        281        0.19       56.90
           C00003298 |        281        0.19       57.10
           C00003299 |        281        0.19       57.29
           C00003301 |        281        0.19       57.49
           C00003302 |        281        0.19       57.68
           C00003303 |        281        0.19       57.88
           C00003304 |        281        0.19       58.07
           C00003305 |        281        0.19       58.27
           C00003306 |        281        0.19       58.46
           C00003307 |        281        0.19       58.66
           C00003308 |        281        0.19       58.85
           C00003309 |        281        0.19       59.05
           C00003310 |        281        0.19       59.24
           C00003311 |        281        0.19       59.44
           C00003312 |        281        0.19       59.63
           C00003313 |        281        0.19       59.83
           C00003314 |        281        0.19       60.02
           C00003315 |        281        0.19       60.22
           C00003316 |        281        0.19       60.41
           C00003317 |        281        0.19       60.61
           C00003318 |        281        0.19       60.80
           C00003319 |        281        0.19       61.00
           C00003320 |        281        0.19       61.19
           C00003321 |        281        0.19       61.39
           C00003322 |        281        0.19       61.58
           C00003323 |        281        0.19       61.78
           C00003324 |        281        0.19       61.97
           C00003325 |        281        0.19       62.17
           C00003328 |        281        0.19       62.36
           C00003329 |        281        0.19       62.56
           C00003330 |        281        0.19       62.75
           C00003332 |        281        0.19       62.95
           C00003333 |        281        0.19       63.14
           C00003334 |        281        0.19       63.34
           C00003335 |        281        0.19       63.53
           C00003336 |        281        0.19       63.73
           C00003337 |        281        0.19       63.92
           C00003338 |        281        0.19       64.12
           C00003339 |        281        0.19       64.31
           C00003340 |        281        0.19       64.51
           C00003341 |        281        0.19       64.70
           C00003342 |         86        0.06       64.76
           C00003343 |        281        0.19       64.96
           C00003344 |        281        0.19       65.15
           C00003345 |        281        0.19       65.35
           C00003346 |        281        0.19       65.54
           C00003347 |        281        0.19       65.74
           C00003348 |        281        0.19       65.93
           C00003349 |        281        0.19       66.13
           C00003350 |        281        0.19       66.32
           C00003351 |        281        0.19       66.52
           C00003352 |        281        0.19       66.71
           C00003353 |        281        0.19       66.91
           C00003354 |        281        0.19       67.10
           C00003355 |        281        0.19       67.30
           C00003356 |        281        0.19       67.49
           C00003357 |        281        0.19       67.69
           C00003358 |        281        0.19       67.88
           C00003359 |        281        0.19       68.08
           C00003360 |        281        0.19       68.27
           C00003361 |        281        0.19       68.47
           C00003362 |        281        0.19       68.66
           C00003363 |        281        0.19       68.86
           C00003364 |        281        0.19       69.05
           C00003365 |        281        0.19       69.25
           C00003366 |        281        0.19       69.44
           C00003367 |        281        0.19       69.64
           C00003368 |        281        0.19       69.83
           C00003369 |        281        0.19       70.03
           C00003370 |        281        0.19       70.22
           C00003371 |        281        0.19       70.42
           C00003372 |        281        0.19       70.61
           C00003373 |        281        0.19       70.81
           C00003374 |        281        0.19       71.00
           C00003375 |        281        0.19       71.20
           C00003376 |        281        0.19       71.39
           C00003377 |        281        0.19       71.59
           C00003378 |        281        0.19       71.78
           C00003379 |        281        0.19       71.98
           C00003380 |        281        0.19       72.17
           C00003381 |        281        0.19       72.37
           C00003382 |        281        0.19       72.56
           C00003383 |        281        0.19       72.76
           C00003384 |        281        0.19       72.95
           C00003385 |        281        0.19       73.15
           C00003386 |        281        0.19       73.34
           C00003387 |        281        0.19       73.54
           C00003388 |        281        0.19       73.73
           C00003389 |        281        0.19       73.93
           C00003390 |        281        0.19       74.12
           C00003391 |        281        0.19       74.32
           C00003392 |        281        0.19       74.51
           C00003393 |        281        0.19       74.71
           C00003394 |        281        0.19       74.90
           C00003395 |        281        0.19       75.10
           C00003396 |        281        0.19       75.29
           C00003397 |        281        0.19       75.49
           C00003398 |        281        0.19       75.68
           C00003399 |        281        0.19       75.88
           C00003400 |        281        0.19       76.07
           C00003402 |        281        0.19       76.27
           C00003403 |        281        0.19       76.46
           C00003404 |        281        0.19       76.66
           C00003405 |        281        0.19       76.85
           C00003406 |        281        0.19       77.05
           C00003407 |        281        0.19       77.24
           C00003408 |        281        0.19       77.44
           C00003409 |        281        0.19       77.63
           C00003410 |        281        0.19       77.83
           C00003411 |        281        0.19       78.02
           C00003412 |        281        0.19       78.22
           C00003413 |        281        0.19       78.41
           C00003414 |        281        0.19       78.61
           C00003415 |        281        0.19       78.80
           C00003417 |        281        0.19       79.00
           C00003418 |        281        0.19       79.19
           C00003419 |        281        0.19       79.39
           C00003420 |        281        0.19       79.58
           C00003421 |        281        0.19       79.78
           C00003422 |        281        0.19       79.97
           C00003423 |        281        0.19       80.17
           C00003424 |        281        0.19       80.36
           C00003425 |        281        0.19       80.56
           C00007061 |        281        0.19       80.75
           C00007062 |        281        0.19       80.95
           C00007063 |        281        0.19       81.14
           C00007064 |        281        0.19       81.34
           C00007065 |        281        0.19       81.53
           C00007066 |        281        0.19       81.73
           C00007067 |        281        0.19       81.92
           C00007068 |        281        0.19       82.12
           C00007069 |        281        0.19       82.31
           C00007070 |        281        0.19       82.51
           C00007071 |        281        0.19       82.70
           C00007072 |        281        0.19       82.90
           C00007073 |        281        0.19       83.09
           C00007074 |        281        0.19       83.29
           C00007075 |        281        0.19       83.48
           C00007076 |        281        0.19       83.68
           C00007077 |        281        0.19       83.87
           C00007078 |        281        0.19       84.07
           C00007079 |        281        0.19       84.26
           C00007080 |        281        0.19       84.46
           C00007081 |        281        0.19       84.65
           C00007082 |        281        0.19       84.85
           C00007083 |        281        0.19       85.04
           C00007085 |        281        0.19       85.24
           C00007086 |        281        0.19       85.43
           C00007087 |        281        0.19       85.63
           C00007089 |        281        0.19       85.82
           C00007091 |        281        0.19       86.02
           C00007092 |        281        0.19       86.21
           C00007093 |        281        0.19       86.41
           C00007094 |        281        0.19       86.60
           C00007095 |        281        0.19       86.80
           C00007096 |        281        0.19       86.99
           C00007097 |        281        0.19       87.19
           C00007098 |        281        0.19       87.38
           C00007099 |        281        0.19       87.58
           C00007100 |        281        0.19       87.77
           C00007101 |        281        0.19       87.97
           C00007102 |        281        0.19       88.16
           C00007103 |        281        0.19       88.36
           C00007104 |        281        0.19       88.55
           C00007105 |        281        0.19       88.75
           C00007106 |        281        0.19       88.94
           C00007107 |        281        0.19       89.14
           C00007108 |        281        0.19       89.33
           C00007109 |        281        0.19       89.53
           C00007110 |        281        0.19       89.72
           C00007111 |        281        0.19       89.92
           C00007112 |        281        0.19       90.11
           C00007113 |        281        0.19       90.31
           C00007114 |        281        0.19       90.50
           C00007116 |        281        0.19       90.70
           C00008625 |        281        0.19       90.89
           C00008626 |        281        0.19       91.09
           C00008627 |        281        0.19       91.28
           C00008628 |        281        0.19       91.48
           C00008629 |        281        0.19       91.67
           C00008630 |        281        0.19       91.87
           C00008632 |        281        0.19       92.06
           C00008633 |        281        0.19       92.26
           C00008635 |        281        0.19       92.45
           C00008636 |        281        0.19       92.65
           C00008637 |        281        0.19       92.84
           C00008638 |        281        0.19       93.04
           C00008946 |        281        0.19       93.23
           C00008947 |        281        0.19       93.43
           C00008948 |        281        0.19       93.62
           C00008949 |        281        0.19       93.82
           C00008958 |        281        0.19       94.01
           C00008959 |        281        0.19       94.21
           C00008960 |        281        0.19       94.40
           C00008970 |        281        0.19       94.60
           C00008971 |        281        0.19       94.79
           C00008972 |        281        0.19       94.99
           C00008973 |        281        0.19       95.18
           C00008982 |        281        0.19       95.38
           C00008984 |        281        0.19       95.57
           C00008985 |        281        0.19       95.77
           C00008994 |        281        0.19       95.96
           C00008996 |        281        0.19       96.16
           C00008997 |        281        0.19       96.35
           C00009006 |        281        0.19       96.55
           C00009008 |        281        0.19       96.74
           C00009009 |         86        0.06       96.80
           C00009017 |        281        0.19       97.00
           C00009018 |        281        0.19       97.19
           C00009020 |        281        0.19       97.39
           C00009021 |        281        0.19       97.58
           C00009029 |        281        0.19       97.78
           C00009030 |        281        0.19       97.97
           C00009033 |        281        0.19       98.17
           C00011569 |         86        0.06       98.23
           C00011570 |         86        0.06       98.28
           C00011571 |         86        0.06       98.34
           C00011572 |         86        0.06       98.40
           C00011581 |         86        0.06       98.46
           C00011582 |         86        0.06       98.52
           C00011584 |         86        0.06       98.58
           C00011593 |         86        0.06       98.64
           C00011594 |         86        0.06       98.70
           C00011595 |         86        0.06       98.76
           C00011596 |         86        0.06       98.82
           C00011605 |         86        0.06       98.88
           C00011606 |         86        0.06       98.94
           C00011607 |         86        0.06       99.00
           C00011608 |         86        0.06       99.06
           C00011617 |         86        0.06       99.12
           C00011618 |         86        0.06       99.18
           C00011619 |         86        0.06       99.24
           C00011620 |         86        0.06       99.30
           C00011629 |         86        0.06       99.36
           C00011630 |         86        0.06       99.42
           C00011631 |         86        0.06       99.48
           C00011632 |         86        0.06       99.54
           C00011641 |         86        0.06       99.60
           C00011642 |         86        0.06       99.66
           C00011643 |         86        0.06       99.72
           C00011644 |         86        0.06       99.78
           C00011653 |         86        0.06       99.84
           C00011654 |         86        0.06       99.90
           C00011655 |         74        0.05       99.95
           C00011656 |         76        0.05      100.00
---------------------+-----------------------------------
               Total |    144,113      100.00

. tab sample method if set=="Oxford501"

                     |              method
           Sample_id | genefin..  typewri..        zam |     Total
---------------------+---------------------------------+----------
           C00000784 |        98         97         86 |       281 
           C00000785 |        98         97         86 |       281 
           C00000786 |        98         97         86 |       281 
           C00000787 |        98         97         86 |       281 
           C00000788 |        98         97         86 |       281 
           C00000789 |        98         97         86 |       281 
           C00000790 |        98         97         86 |       281 
           C00000795 |        98         97         86 |       281 
           C00000796 |        98         97         86 |       281 
           C00000799 |        98         97         86 |       281 
           C00000800 |        98         97         86 |       281 
           C00000805 |        98         97         86 |       281 
           C00000806 |        98         97         86 |       281 
           C00000808 |        98         97         86 |       281 
           C00000809 |        98         97         86 |       281 
           C00000814 |        98         97         86 |       281 
           C00000815 |        98         97         86 |       281 
           C00000816 |        98         97         86 |       281 
           C00000817 |        98         97         86 |       281 
           C00000818 |        98         97         86 |       281 
           C00000819 |        98         97         86 |       281 
           C00000820 |        98         97         86 |       281 
           C00000825 |        98         97         86 |       281 
           C00000826 |        98         97         86 |       281 
           C00000827 |        98         97         86 |       281 
           C00000828 |        98         97         86 |       281 
           C00000829 |        98         97         86 |       281 
           C00000830 |        98         97         86 |       281 
           C00000831 |        98         97         86 |       281 
           C00000834 |        98         97         86 |       281 
           C00000835 |        98         97         86 |       281 
           C00000836 |        98         97         86 |       281 
           C00000837 |        98         97         86 |       281 
           C00000838 |        98         97         86 |       281 
           C00000839 |        98         97         86 |       281 
           C00000840 |        98         97         86 |       281 
           C00000845 |        98         97         86 |       281 
           C00000846 |        98         97         86 |       281 
           C00000847 |        98         97         86 |       281 
           C00000848 |        98         97         86 |       281 
           C00000849 |        98         97         86 |       281 
           C00000850 |        98         97         86 |       281 
           C00000851 |        98         97         86 |       281 
           C00000852 |        98         97         86 |       281 
           C00000857 |        98         97         86 |       281 
           C00000858 |        98         97         86 |       281 
           C00000859 |        98         97         86 |       281 
           C00000860 |        98         97         86 |       281 
           C00000861 |        98         97         86 |       281 
           C00000862 |        98         97         86 |       281 
           C00000863 |        98         97         86 |       281 
           C00000864 |        98         97         86 |       281 
           C00001384 |        98         97         86 |       281 
           C00001385 |        98         97         86 |       281 
           C00001386 |        98         97         86 |       281 
           C00001387 |        98         97         86 |       281 
           C00001388 |        98         97         86 |       281 
           C00001389 |        98         97         86 |       281 
           C00001390 |        98         97         86 |       281 
           C00001397 |        98         97         86 |       281 
           C00001399 |        98         97         86 |       281 
           C00001400 |        98         97         86 |       281 
           C00001401 |        98         97         86 |       281 
           C00001402 |        98         97         86 |       281 
           C00001404 |        98         97         86 |       281 
           C00001405 |        98         97         86 |       281 
           C00001406 |        98         97         86 |       281 
           C00001440 |        98         97         86 |       281 
           C00001441 |        98         97         86 |       281 
           C00001442 |        98         97         86 |       281 
           C00001443 |        98         97         86 |       281 
           C00001445 |        98         97         86 |       281 
           C00001446 |        98         97         86 |       281 
           C00001447 |        98         97         86 |       281 
           C00001448 |        98         97         86 |       281 
           C00001449 |        98         97         86 |       281 
           C00001451 |        98         97         86 |       281 
           C00001452 |        98         97         86 |       281 
           C00001453 |        98         97         86 |       281 
           C00002649 |        98         97         86 |       281 
           C00002652 |        98         97         86 |       281 
           C00002653 |        98         97         86 |       281 
           C00002655 |        98         97         86 |       281 
           C00002656 |        98         97         86 |       281 
           C00002657 |        98         97         86 |       281 
           C00002658 |        98         97         86 |       281 
           C00002661 |        98         97         86 |       281 
           C00002662 |        98         97         86 |       281 
           C00003083 |        98         97         86 |       281 
           C00003084 |        98         97         86 |       281 
           C00003085 |        98         97         86 |       281 
           C00003086 |        98         97         86 |       281 
           C00003087 |        98         97         86 |       281 
           C00003088 |        98         97         86 |       281 
           C00003089 |        98         97         86 |       281 
           C00003090 |        98         97         86 |       281 
           C00003091 |        98         97         86 |       281 
           C00003092 |        98         97         86 |       281 
           C00003093 |        98         97         86 |       281 
           C00003094 |         0          0         86 |        86 
           C00003095 |        98         97         86 |       281 
           C00003096 |        98         97         86 |       281 
           C00003098 |        98         97         86 |       281 
           C00003099 |        98         97         86 |       281 
           C00003100 |        98         97         86 |       281 
           C00003101 |        98         97         86 |       281 
           C00003102 |        98         97         86 |       281 
           C00003103 |        98         97         86 |       281 
           C00003104 |        98         97         86 |       281 
           C00003106 |        98         97         86 |       281 
           C00003107 |        98         97         86 |       281 
           C00003108 |        98         97         86 |       281 
           C00003109 |        98         97         86 |       281 
           C00003110 |        98         97         86 |       281 
           C00003111 |        98         97         86 |       281 
           C00003112 |        98         97         86 |       281 
           C00003113 |        98         97         86 |       281 
           C00003114 |        98         97         86 |       281 
           C00003115 |        98         97         86 |       281 
           C00003116 |        98         97         86 |       281 
           C00003117 |         0          0         86 |        86 
           C00003118 |        98         97         86 |       281 
           C00003119 |        98         97         86 |       281 
           C00003120 |        98         97         86 |       281 
           C00003121 |        98         97         86 |       281 
           C00003122 |        98         97         86 |       281 
           C00003123 |         0          0         86 |        86 
           C00003124 |        98         97         86 |       281 
           C00003125 |        98         97         86 |       281 
           C00003126 |        98         97         86 |       281 
           C00003127 |        98         97         86 |       281 
           C00003128 |        98         97         86 |       281 
           C00003129 |        98         97         86 |       281 
           C00003130 |        98         97         86 |       281 
           C00003131 |        98         97         86 |       281 
           C00003132 |        98         97         86 |       281 
           C00003133 |        98         97         86 |       281 
           C00003134 |        98         97         86 |       281 
           C00003135 |        98         97         86 |       281 
           C00003136 |        98         97         86 |       281 
           C00003137 |        98         97         86 |       281 
           C00003138 |        98         97         86 |       281 
           C00003139 |        98         97         86 |       281 
           C00003140 |        98         97         86 |       281 
           C00003141 |        98         97         86 |       281 
           C00003142 |        98         97         86 |       281 
           C00003143 |        98         97         86 |       281 
           C00003144 |        98         97         86 |       281 
           C00003145 |        98         97         86 |       281 
           C00003147 |        98         97         86 |       281 
           C00003148 |        98         97         86 |       281 
           C00003149 |        98         97         86 |       281 
           C00003150 |        98         97         86 |       281 
           C00003151 |        98         97         86 |       281 
           C00003152 |        98         97         86 |       281 
           C00003153 |        98         97         86 |       281 
           C00003154 |        98         97         86 |       281 
           C00003155 |        98         97         86 |       281 
           C00003156 |        98         97         86 |       281 
           C00003158 |        98         97         86 |       281 
           C00003159 |        98         97         86 |       281 
           C00003160 |        98         97         86 |       281 
           C00003161 |        98         97         86 |       281 
           C00003162 |        98         97         86 |       281 
           C00003163 |        98         97         86 |       281 
           C00003164 |        98         97         86 |       281 
           C00003165 |        98         97         86 |       281 
           C00003166 |        98         97         86 |       281 
           C00003167 |        98         97         86 |       281 
           C00003168 |        98         97         86 |       281 
           C00003169 |        98         97         86 |       281 
           C00003170 |        98         97         86 |       281 
           C00003171 |        98         97         86 |       281 
           C00003172 |        98         97         86 |       281 
           C00003173 |        98         97         86 |       281 
           C00003174 |        98         97         86 |       281 
           C00003175 |        98         97         86 |       281 
           C00003176 |        98         97         86 |       281 
           C00003177 |        98         97         86 |       281 
           C00003178 |        98         97         86 |       281 
           C00003179 |        98         97         86 |       281 
           C00003180 |        98         97         86 |       281 
           C00003181 |        98         97         86 |       281 
           C00003182 |        98         97         86 |       281 
           C00003183 |        98         97         86 |       281 
           C00003184 |        98         97         86 |       281 
           C00003185 |        98         97         86 |       281 
           C00003186 |        98         97         86 |       281 
           C00003187 |        98         97         86 |       281 
           C00003188 |        98         97         86 |       281 
           C00003189 |        98         97         86 |       281 
           C00003190 |        98         97         86 |       281 
           C00003191 |        98         97         86 |       281 
           C00003192 |        98         97         86 |       281 
           C00003193 |        98         97         86 |       281 
           C00003194 |        98         97         86 |       281 
           C00003195 |        98         97         86 |       281 
           C00003196 |        98         97         86 |       281 
           C00003197 |        98         97         86 |       281 
           C00003198 |        98         97         86 |       281 
           C00003199 |        98         97         86 |       281 
           C00003200 |        98         97         86 |       281 
           C00003201 |        98         97         86 |       281 
           C00003202 |        98         97         86 |       281 
           C00003203 |        98         97         86 |       281 
           C00003204 |        98         97         86 |       281 
           C00003205 |        98         97         86 |       281 
           C00003206 |        98         97         86 |       281 
           C00003207 |        98         97         86 |       281 
           C00003208 |        98         97         86 |       281 
           C00003209 |        98         97         86 |       281 
           C00003210 |        98         97         86 |       281 
           C00003211 |        98         97         86 |       281 
           C00003212 |        98         97         86 |       281 
           C00003213 |        98         97         86 |       281 
           C00003214 |         0          0         86 |        86 
           C00003215 |        98         97         86 |       281 
           C00003216 |        98         97         86 |       281 
           C00003217 |        98         97         86 |       281 
           C00003218 |        98         97         86 |       281 
           C00003219 |        98         97         86 |       281 
           C00003220 |        98         97         86 |       281 
           C00003221 |        98         97         86 |       281 
           C00003222 |        98         97         86 |       281 
           C00003223 |        98         97         86 |       281 
           C00003224 |        98         97         86 |       281 
           C00003225 |        98         97         86 |       281 
           C00003226 |        98         97         86 |       281 
           C00003227 |        98         97         86 |       281 
           C00003228 |        98         97         86 |       281 
           C00003229 |        98         97         86 |       281 
           C00003231 |        98         97         86 |       281 
           C00003232 |        98         97         86 |       281 
           C00003233 |        98         97         86 |       281 
           C00003235 |        98         97         86 |       281 
           C00003236 |        98         97         86 |       281 
           C00003237 |        98         97         86 |       281 
           C00003238 |        98         97         86 |       281 
           C00003239 |        98         97         86 |       281 
           C00003240 |        98         97         86 |       281 
           C00003241 |        98         97         86 |       281 
           C00003242 |        98         97         86 |       281 
           C00003243 |        98         97         86 |       281 
           C00003244 |        98         97         86 |       281 
           C00003245 |        98         97         86 |       281 
           C00003246 |        98         97         86 |       281 
           C00003247 |        98         97         86 |       281 
           C00003248 |        98         97         86 |       281 
           C00003249 |        98         97         86 |       281 
           C00003250 |        98         97         86 |       281 
           C00003251 |        98         97         86 |       281 
           C00003252 |        98         97         86 |       281 
           C00003253 |        98         97         86 |       281 
           C00003254 |        98         97         86 |       281 
           C00003255 |        98         97         86 |       281 
           C00003256 |        98         97         86 |       281 
           C00003257 |        98         97         86 |       281 
           C00003258 |        98         97         86 |       281 
           C00003259 |        98         97         86 |       281 
           C00003260 |        98         97         86 |       281 
           C00003261 |        98         97         86 |       281 
           C00003262 |        98         97         86 |       281 
           C00003263 |        98         97         86 |       281 
           C00003264 |        98         97         86 |       281 
           C00003265 |        98         97         86 |       281 
           C00003266 |        98         97         86 |       281 
           C00003267 |        98         97         86 |       281 
           C00003268 |        98         97         86 |       281 
           C00003269 |        98         97         86 |       281 
           C00003270 |        98         97         86 |       281 
           C00003271 |        98         97         86 |       281 
           C00003272 |        98         97         86 |       281 
           C00003273 |         0          0         86 |        86 
           C00003274 |        98         97         86 |       281 
           C00003275 |        98         97         86 |       281 
           C00003276 |        98         97         86 |       281 
           C00003277 |        98         97         86 |       281 
           C00003278 |        98         97         86 |       281 
           C00003279 |        98         97         86 |       281 
           C00003280 |        98         97         86 |       281 
           C00003281 |        98         97         86 |       281 
           C00003282 |        98         97         86 |       281 
           C00003283 |        98         97         86 |       281 
           C00003284 |        98         97         86 |       281 
           C00003285 |        98         97         86 |       281 
           C00003286 |        98         97         86 |       281 
           C00003287 |        98         97         86 |       281 
           C00003288 |        98         97         86 |       281 
           C00003289 |        98         97         86 |       281 
           C00003290 |        98         97         86 |       281 
           C00003291 |        98         97         86 |       281 
           C00003292 |        98         97         86 |       281 
           C00003293 |         0          0         86 |        86 
           C00003294 |        98         97         86 |       281 
           C00003295 |        98         97         86 |       281 
           C00003296 |        98         97         86 |       281 
           C00003298 |        98         97         86 |       281 
           C00003299 |        98         97         86 |       281 
           C00003301 |        98         97         86 |       281 
           C00003302 |        98         97         86 |       281 
           C00003303 |        98         97         86 |       281 
           C00003304 |        98         97         86 |       281 
           C00003305 |        98         97         86 |       281 
           C00003306 |        98         97         86 |       281 
           C00003307 |        98         97         86 |       281 
           C00003308 |        98         97         86 |       281 
           C00003309 |        98         97         86 |       281 
           C00003310 |        98         97         86 |       281 
           C00003311 |        98         97         86 |       281 
           C00003312 |        98         97         86 |       281 
           C00003313 |        98         97         86 |       281 
           C00003314 |        98         97         86 |       281 
           C00003315 |        98         97         86 |       281 
           C00003316 |        98         97         86 |       281 
           C00003317 |        98         97         86 |       281 
           C00003318 |        98         97         86 |       281 
           C00003319 |        98         97         86 |       281 
           C00003320 |        98         97         86 |       281 
           C00003321 |        98         97         86 |       281 
           C00003322 |        98         97         86 |       281 
           C00003323 |        98         97         86 |       281 
           C00003324 |        98         97         86 |       281 
           C00003325 |        98         97         86 |       281 
           C00003328 |        98         97         86 |       281 
           C00003329 |        98         97         86 |       281 
           C00003330 |        98         97         86 |       281 
           C00003332 |        98         97         86 |       281 
           C00003333 |        98         97         86 |       281 
           C00003334 |        98         97         86 |       281 
           C00003335 |        98         97         86 |       281 
           C00003336 |        98         97         86 |       281 
           C00003337 |        98         97         86 |       281 
           C00003338 |        98         97         86 |       281 
           C00003339 |        98         97         86 |       281 
           C00003340 |        98         97         86 |       281 
           C00003341 |        98         97         86 |       281 
           C00003342 |         0          0         86 |        86 
           C00003343 |        98         97         86 |       281 
           C00003344 |        98         97         86 |       281 
           C00003345 |        98         97         86 |       281 
           C00003346 |        98         97         86 |       281 
           C00003347 |        98         97         86 |       281 
           C00003348 |        98         97         86 |       281 
           C00003349 |        98         97         86 |       281 
           C00003350 |        98         97         86 |       281 
           C00003351 |        98         97         86 |       281 
           C00003352 |        98         97         86 |       281 
           C00003353 |        98         97         86 |       281 
           C00003354 |        98         97         86 |       281 
           C00003355 |        98         97         86 |       281 
           C00003356 |        98         97         86 |       281 
           C00003357 |        98         97         86 |       281 
           C00003358 |        98         97         86 |       281 
           C00003359 |        98         97         86 |       281 
           C00003360 |        98         97         86 |       281 
           C00003361 |        98         97         86 |       281 
           C00003362 |        98         97         86 |       281 
           C00003363 |        98         97         86 |       281 
           C00003364 |        98         97         86 |       281 
           C00003365 |        98         97         86 |       281 
           C00003366 |        98         97         86 |       281 
           C00003367 |        98         97         86 |       281 
           C00003368 |        98         97         86 |       281 
           C00003369 |        98         97         86 |       281 
           C00003370 |        98         97         86 |       281 
           C00003371 |        98         97         86 |       281 
           C00003372 |        98         97         86 |       281 
           C00003373 |        98         97         86 |       281 
           C00003374 |        98         97         86 |       281 
           C00003375 |        98         97         86 |       281 
           C00003376 |        98         97         86 |       281 
           C00003377 |        98         97         86 |       281 
           C00003378 |        98         97         86 |       281 
           C00003379 |        98         97         86 |       281 
           C00003380 |        98         97         86 |       281 
           C00003381 |        98         97         86 |       281 
           C00003382 |        98         97         86 |       281 
           C00003383 |        98         97         86 |       281 
           C00003384 |        98         97         86 |       281 
           C00003385 |        98         97         86 |       281 
           C00003386 |        98         97         86 |       281 
           C00003387 |        98         97         86 |       281 
           C00003388 |        98         97         86 |       281 
           C00003389 |        98         97         86 |       281 
           C00003390 |        98         97         86 |       281 
           C00003391 |        98         97         86 |       281 
           C00003392 |        98         97         86 |       281 
           C00003393 |        98         97         86 |       281 
           C00003394 |        98         97         86 |       281 
           C00003395 |        98         97         86 |       281 
           C00003396 |        98         97         86 |       281 
           C00003397 |        98         97         86 |       281 
           C00003398 |        98         97         86 |       281 
           C00003399 |        98         97         86 |       281 
           C00003400 |        98         97         86 |       281 
           C00003402 |        98         97         86 |       281 
           C00003403 |        98         97         86 |       281 
           C00003404 |        98         97         86 |       281 
           C00003405 |        98         97         86 |       281 
           C00003406 |        98         97         86 |       281 
           C00003407 |        98         97         86 |       281 
           C00003408 |        98         97         86 |       281 
           C00003409 |        98         97         86 |       281 
           C00003410 |        98         97         86 |       281 
           C00003411 |        98         97         86 |       281 
           C00003412 |        98         97         86 |       281 
           C00003413 |        98         97         86 |       281 
           C00003414 |        98         97         86 |       281 
           C00003415 |        98         97         86 |       281 
           C00003417 |        98         97         86 |       281 
           C00003418 |        98         97         86 |       281 
           C00003419 |        98         97         86 |       281 
           C00003420 |        98         97         86 |       281 
           C00003421 |        98         97         86 |       281 
           C00003422 |        98         97         86 |       281 
           C00003423 |        98         97         86 |       281 
           C00003424 |        98         97         86 |       281 
           C00003425 |        98         97         86 |       281 
           C00007061 |        98         97         86 |       281 
           C00007062 |        98         97         86 |       281 
           C00007063 |        98         97         86 |       281 
           C00007064 |        98         97         86 |       281 
           C00007065 |        98         97         86 |       281 
           C00007066 |        98         97         86 |       281 
           C00007067 |        98         97         86 |       281 
           C00007068 |        98         97         86 |       281 
           C00007069 |        98         97         86 |       281 
           C00007070 |        98         97         86 |       281 
           C00007071 |        98         97         86 |       281 
           C00007072 |        98         97         86 |       281 
           C00007073 |        98         97         86 |       281 
           C00007074 |        98         97         86 |       281 
           C00007075 |        98         97         86 |       281 
           C00007076 |        98         97         86 |       281 
           C00007077 |        98         97         86 |       281 
           C00007078 |        98         97         86 |       281 
           C00007079 |        98         97         86 |       281 
           C00007080 |        98         97         86 |       281 
           C00007081 |        98         97         86 |       281 
           C00007082 |        98         97         86 |       281 
           C00007083 |        98         97         86 |       281 
           C00007085 |        98         97         86 |       281 
           C00007086 |        98         97         86 |       281 
           C00007087 |        98         97         86 |       281 
           C00007089 |        98         97         86 |       281 
           C00007091 |        98         97         86 |       281 
           C00007092 |        98         97         86 |       281 
           C00007093 |        98         97         86 |       281 
           C00007094 |        98         97         86 |       281 
           C00007095 |        98         97         86 |       281 
           C00007096 |        98         97         86 |       281 
           C00007097 |        98         97         86 |       281 
           C00007098 |        98         97         86 |       281 
           C00007099 |        98         97         86 |       281 
           C00007100 |        98         97         86 |       281 
           C00007101 |        98         97         86 |       281 
           C00007102 |        98         97         86 |       281 
           C00007103 |        98         97         86 |       281 
           C00007104 |        98         97         86 |       281 
           C00007105 |        98         97         86 |       281 
           C00007106 |        98         97         86 |       281 
           C00007107 |        98         97         86 |       281 
           C00007108 |        98         97         86 |       281 
           C00007109 |        98         97         86 |       281 
           C00007110 |        98         97         86 |       281 
           C00007111 |        98         97         86 |       281 
           C00007112 |        98         97         86 |       281 
           C00007113 |        98         97         86 |       281 
           C00007114 |        98         97         86 |       281 
           C00007116 |        98         97         86 |       281 
           C00008625 |        98         97         86 |       281 
           C00008626 |        98         97         86 |       281 
           C00008627 |        98         97         86 |       281 
           C00008628 |        98         97         86 |       281 
           C00008629 |        98         97         86 |       281 
           C00008630 |        98         97         86 |       281 
           C00008632 |        98         97         86 |       281 
           C00008633 |        98         97         86 |       281 
           C00008635 |        98         97         86 |       281 
           C00008636 |        98         97         86 |       281 
           C00008637 |        98         97         86 |       281 
           C00008638 |        98         97         86 |       281 
           C00008946 |        98         97         86 |       281 
           C00008947 |        98         97         86 |       281 
           C00008948 |        98         97         86 |       281 
           C00008949 |        98         97         86 |       281 
           C00008958 |        98         97         86 |       281 
           C00008959 |        98         97         86 |       281 
           C00008960 |        98         97         86 |       281 
           C00008970 |        98         97         86 |       281 
           C00008971 |        98         97         86 |       281 
           C00008972 |        98         97         86 |       281 
           C00008973 |        98         97         86 |       281 
           C00008982 |        98         97         86 |       281 
           C00008984 |        98         97         86 |       281 
           C00008985 |        98         97         86 |       281 
           C00008994 |        98         97         86 |       281 
           C00008996 |        98         97         86 |       281 
           C00008997 |        98         97         86 |       281 
           C00009006 |        98         97         86 |       281 
           C00009008 |        98         97         86 |       281 
           C00009009 |         0          0         86 |        86 
           C00009017 |        98         97         86 |       281 
           C00009018 |        98         97         86 |       281 
           C00009020 |        98         97         86 |       281 
           C00009021 |        98         97         86 |       281 
           C00009029 |        98         97         86 |       281 
           C00009030 |        98         97         86 |       281 
           C00009033 |        98         97         86 |       281 
           C00011569 |         0          0         86 |        86 
           C00011570 |         0          0         86 |        86 
           C00011571 |         0          0         86 |        86 
           C00011572 |         0          0         86 |        86 
           C00011581 |         0          0         86 |        86 
           C00011582 |         0          0         86 |        86 
           C00011584 |         0          0         86 |        86 
           C00011593 |         0          0         86 |        86 
           C00011594 |         0          0         86 |        86 
           C00011595 |         0          0         86 |        86 
           C00011596 |         0          0         86 |        86 
           C00011605 |         0          0         86 |        86 
           C00011606 |         0          0         86 |        86 
           C00011607 |         0          0         86 |        86 
           C00011608 |         0          0         86 |        86 
           C00011617 |         0          0         86 |        86 
           C00011618 |         0          0         86 |        86 
           C00011619 |         0          0         86 |        86 
           C00011620 |         0          0         86 |        86 
           C00011629 |         0          0         86 |        86 
           C00011630 |         0          0         86 |        86 
           C00011631 |         0          0         86 |        86 
           C00011632 |         0          0         86 |        86 
           C00011641 |         0          0         86 |        86 
           C00011642 |         0          0         86 |        86 
           C00011643 |         0          0         86 |        86 
           C00011644 |         0          0         86 |        86 
           C00011653 |         0          0         86 |        86 
           C00011654 |         0          0         86 |        86 
           C00011655 |         0          0         74 |        74 
           C00011656 |         0          0         76 |        76 
---------------------+---------------------------------+----------
               Total |    49,098     48,597     46,418 |   144,113 


. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. tab spatype

                    spa type |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                contaminated |          1        0.02        0.02
                        t002 |        115        2.61        2.63
                   t002/t105 |          1        0.02        2.65
              t002/t105/t053 |          2        0.05        2.70
                  t002/t3262 |          1        0.02        2.72
                  t002/t5635 |          1        0.02        2.75
                        t004 |          1        0.02        2.77
                        t005 |        113        2.56        5.33
                   t005/t008 |          1        0.02        5.35
                   t005/t449 |          1        0.02        5.38
                        t006 |         12        0.27        5.65
                        t008 |         26        0.59        6.24
              t008/t012/t571 |          1        0.02        6.26
              t008/t127/t196 |          3        0.07        6.33
                   t008/t196 |          2        0.05        6.37
                   t008/t659 |          1        0.02        6.40
                  t008/t7031 |          2        0.05        6.44
                        t010 |          9        0.20        6.65
                        t012 |        334        7.58       14.22
                   t012/t021 |          1        0.02       14.25
                   t012/t065 |          2        0.05       14.29
                   t012/t084 |          1        0.02       14.31
                   t012/t127 |          1        0.02       14.34
             t012/t1827/t021 |          1        0.02       14.36
                   t012/t230 |          1        0.02       14.38
                   t012/t630 |          1        0.02       14.41
                  t012/t7154 |          1        0.02       14.43
                   t012/t871 |          2        0.05       14.47
                        t015 |         45        1.02       15.49
                  t015/t3369 |          1        0.02       15.52
                   t015/t908 |          1        0.02       15.54
                        t017 |         25        0.57       16.11
                        t018 |         40        0.91       17.01
                        t019 |          2        0.05       17.06
                        t021 |         97        2.20       19.26
                   t021/t012 |          3        0.07       19.33
                  t021/t1414 |          2        0.05       19.37
                  t021/t3072 |          1        0.02       19.40
                   t021/t364 |          1        0.02       19.42
                        t022 |          3        0.07       19.49
                        t024 |         21        0.48       19.96
                  t024/t2455 |          1        0.02       19.99
                   t024/t571 |          1        0.02       20.01
                        t026 |         13        0.29       20.30
                        t031 |          9        0.20       20.51
                        t032 |         52        1.18       21.69
                  t032/t1036 |          1        0.02       21.71
                        t037 |         58        1.32       23.03
                  t037/t2029 |          1        0.02       23.05
                        t040 |          5        0.11       23.16
                  t040/t5211 |          1        0.02       23.19
                        t045 |         36        0.82       24.00
                        t050 |          8        0.18       24.18
                   t050/t078 |          1        0.02       24.21
                        t053 |          1        0.02       24.23
                        t056 |         43        0.98       25.20
                  t056/t1541 |          1        0.02       25.23
                  t056/t1712 |          1        0.02       25.25
                        t061 |         15        0.34       25.59
                        t065 |         20        0.45       26.04
                   t065/t012 |          2        0.05       26.09
                   t065/t171 |          3        0.07       26.16
                        t071 |         11        0.25       26.41
                        t078 |         38        0.86       27.27
                   t078/t258 |          1        0.02       27.29
                   t078/t349 |          1        0.02       27.31
                        t084 |        127        2.88       30.20
                   t084/t089 |          3        0.07       30.26
                  t084/t1510 |          1        0.02       30.29
                   t084/t160 |          1        0.02       30.31
                   t084/t209 |          2        0.05       30.35
                  t084/t2119 |          1        0.02       30.38
                   t084/t280 |          1        0.02       30.40
                   t084/t298 |          1        0.02       30.42
                  t084/t4549 |          1        0.02       30.44
                   t084/t491 |          1        0.02       30.47
                   t084/t530 |          1        0.02       30.49
                   t084/t605 |          1        0.02       30.51
                        t085 |         33        0.75       31.26
                        t088 |          1        0.02       31.28
                        t089 |         67        1.52       32.80
                   t089/t084 |          2        0.05       32.85
                  t089/t5753 |          1        0.02       32.87
                        t091 |         56        1.27       34.14
                   t091/t084 |          2        0.05       34.19
                   t091/t748 |          1        0.02       34.21
                        t096 |          7        0.16       34.37
                   t096/t298 |          2        0.05       34.41
                   t096/t528 |          1        0.02       34.44
                      t10184 |          3        0.07       34.51
                       t1023 |          1        0.02       34.53
                       t1036 |         22        0.50       35.03
                 t1036/t1963 |          1        0.02       35.05
                       t1040 |         14        0.32       35.37
                       t1046 |          1        0.02       35.39
                      t10514 |          6        0.14       35.53
                       t1070 |         12        0.27       35.80
                       t1078 |          1        0.02       35.82
                      t11040 |          6        0.14       35.96
                      t11041 |          2        0.05       36.00
                      t11042 |          1        0.02       36.03
                      t11048 |          1        0.02       36.05
                      t11252 |          3        0.07       36.12
                       t1149 |          3        0.07       36.18
                       t1166 |          6        0.14       36.32
                  t1166/t571 |          1        0.02       36.34
                        t120 |         14        0.32       36.66
                 t120/t15780 |          1        0.02       36.68
                  t120/t1716 |          1        0.02       36.71
                  t120/t2074 |          1        0.02       36.73
                  t120/t4309 |          1        0.02       36.75
                        t121 |          2        0.05       36.80
                      t12151 |          5        0.11       36.91
                        t122 |          7        0.16       37.07
                       t1236 |          1        0.02       37.09
                       t1239 |          7        0.16       37.25
t1239/t171/t6814/t6825/t6826 |          1        0.02       37.27
                       t1245 |          2        0.05       37.32
                       t1255 |          4        0.09       37.41
                       t1265 |         16        0.36       37.77
                        t127 |        123        2.79       40.56
                   t127/t008 |          1        0.02       40.59
              t127/t008/t196 |          1        0.02       40.61
                   t127/t386 |          1        0.02       40.63
                      t12838 |          1        0.02       40.65
                       t1306 |          8        0.18       40.83
                       t1347 |          3        0.07       40.90
                        t136 |         52        1.18       42.08
                   t136/t346 |          1        0.02       42.11
                 t1362/t1451 |          1        0.02       42.13
                        t140 |         12        0.27       42.40
                       t1414 |          9        0.20       42.60
                  t1414/t620 |          1        0.02       42.63
                        t144 |          1        0.02       42.65
                       t1445 |         14        0.32       42.97
                       t1451 |         11        0.25       43.22
                      t14529 |          1        0.02       43.24
                      t14530 |          5        0.11       43.35
                  t1476/t375 |          1        0.02       43.38
                        t148 |          5        0.11       43.49
                       t1492 |          5        0.11       43.60
                      t14942 |          1        0.02       43.63
                       t1509 |          7        0.16       43.78
                       t1521 |          3        0.07       43.85
                       t1541 |         13        0.29       44.15
                       t1544 |         11        0.25       44.40
                      t15751 |          1        0.02       44.42
                      t15752 |          1        0.02       44.44
                       t1577 |          1        0.02       44.46
               t15775/t15777 |          1        0.02       44.49
                      t15776 |          1        0.02       44.51
                      t15777 |          1        0.02       44.53
                        t160 |         56        1.27       45.80
                   t160/t321 |          1        0.02       45.83
                       t1626 |         11        0.25       46.08
                  t1626/t571 |          1        0.02       46.10
                        t164 |         70        1.59       47.69
                   t164/t731 |          2        0.05       47.73
                        t166 |         34        0.77       48.50
                       t1685 |         10        0.23       48.73
                        t171 |         28        0.64       49.36
                   t171/t065 |          1        0.02       49.39
                       t1716 |         17        0.39       49.77
                       t1720 |         13        0.29       50.07
                       t1736 |          1        0.02       50.09
                        t177 |         11        0.25       50.34
                       t1854 |          1        0.02       50.36
                        t186 |          8        0.18       50.54
             t186/t550/t6810 |          1        0.02       50.57
                       t1877 |          2        0.05       50.61
                       t1885 |          3        0.07       50.68
                  t1885/t228 |          1        0.02       50.70
            t1885/t228/t3097 |          1        0.02       50.73
                        t189 |         57        1.29       52.02
                        t190 |          7        0.16       52.18
                   t190/t008 |          1        0.02       52.20
                       t1908 |          4        0.09       52.29
                        t192 |         22        0.50       52.79
                  t192/t2933 |          1        0.02       52.81
                   t192/t377 |          1        0.02       52.84
                  t192/t6799 |          1        0.02       52.86
                        t195 |          1        0.02       52.88
                       t1987 |         14        0.32       53.20
                  t1987/t493 |          1        0.02       53.22
                       t2029 |          1        0.02       53.24
                  t2074/t120 |          1        0.02       53.27
                  t2074/t499 |          1        0.02       53.29
                 t2074/t9162 |          1        0.02       53.31
                 t2074/t9584 |          1        0.02       53.33
                        t209 |         47        1.07       54.40
                       t2098 |          3        0.07       54.47
                       t2115 |          3        0.07       54.54
                       t2119 |          1        0.02       54.56
                 t2119/t1509 |          1        0.02       54.58
                        t213 |         43        0.98       55.56
                       t2133 |          2        0.05       55.60
                       t2143 |          3        0.07       55.67
                        t216 |         67        1.52       57.19
                   t216/t160 |          1        0.02       57.21
             t216/t1877/t190 |          2        0.05       57.26
                        t219 |         12        0.27       57.53
                  t219/t9108 |          1        0.02       57.55
                        t223 |         13        0.29       57.85
                        t227 |         13        0.29       58.14
                       t2271 |         43        0.98       59.12
                  t2271/t032 |          1        0.02       59.14
                  t2271/t377 |          1        0.02       59.17
                        t228 |         11        0.25       59.41
                  t228/t1885 |          1        0.02       59.44
            t228/t3097/t1885 |          1        0.02       59.46
                       t2292 |          4        0.09       59.55
                        t230 |         49        1.11       60.66
                   t230/t012 |          1        0.02       60.69
                   t230/t528 |          1        0.02       60.71
                  t230/t6855 |          2        0.05       60.75
                       t2365 |         23        0.52       61.27
                       t2455 |         11        0.25       61.52
                 t2455/t9572 |          1        0.02       61.55
                       t2556 |          2        0.05       61.59
                        t258 |          4        0.09       61.68
                   t258/t021 |          2        0.05       61.73
                       t2643 |          9        0.20       61.93
                  t2643/t382 |          1        0.02       61.96
                        t267 |         23        0.52       62.48
                   t267/t012 |          1        0.02       62.50
                 t267/t14529 |          1        0.02       62.52
                  t2726/t364 |          1        0.02       62.55
                        t273 |          8        0.18       62.73
                        t275 |          8        0.18       62.91
                        t279 |          1        0.02       62.93
                   t279/t360 |          1        0.02       62.95
                        t280 |         21        0.48       63.43
                       t2842 |          1        0.02       63.45
                       t2849 |          6        0.14       63.59
                       t2868 |          5        0.11       63.70
                       t2883 |         13        0.29       64.00
                       t2930 |         13        0.29       64.29
                   t298/t096 |          1        0.02       64.31
                       t3085 |          5        0.11       64.43
                       t3092 |         13        0.29       64.72
                  t310/t4776 |          2        0.05       64.77
                        t316 |         11        0.25       65.02
                        t318 |         29        0.66       65.68
                   t321/t160 |          1        0.02       65.70
                  t321/t1685 |          1        0.02       65.72
                       t3240 |          1        0.02       65.74
                       t3262 |          7        0.16       65.90
                       t3284 |          2        0.05       65.95
                        t330 |          3        0.07       66.02
                       t3304 |         26        0.59       66.61
                 t3304/t6942 |          1        0.02       66.63
                 t3304/t7049 |          3        0.07       66.70
                 t3304/t7514 |          2        0.05       66.74
                        t334 |          1        0.02       66.76
                       t3345 |         13        0.29       67.06
                        t335 |          6        0.14       67.20
                       t3369 |          3        0.07       67.26
                        t337 |         25        0.57       67.83
                        t338 |         35        0.79       68.63
                  t338/t7205 |          1        0.02       68.65
                        t342 |         24        0.54       69.19
                        t346 |         52        1.18       70.37
                   t346/t571 |          1        0.02       70.39
                        t349 |          1        0.02       70.42
                   t349/t401 |          1        0.02       70.44
              t349/t401/t571 |          1        0.02       70.46
                        t350 |         13        0.29       70.76
                        t360 |         39        0.88       71.64
                   t360/t089 |          1        0.02       71.67
                       t3610 |          8        0.18       71.85
                        t363 |          3        0.07       71.91
                        t364 |         38        0.86       72.78
                   t364/t196 |          2        0.05       72.82
                        t370 |          2        0.05       72.87
                       t3732 |         13        0.29       73.16
                        t375 |          6        0.14       73.30
                        t377 |          5        0.11       73.41
                        t379 |         43        0.98       74.39
                   t379/t608 |          1        0.02       74.41
                        t382 |         36        0.82       75.23
              t382/t096/t399 |          1        0.02       75.25
                  t382/t2643 |          2        0.05       75.29
                   t382/t399 |          1        0.02       75.32
                        t386 |          1        0.02       75.34
                       t3879 |          2        0.05       75.39
                        t398 |          2        0.05       75.43
                        t399 |         10        0.23       75.66
                       t3992 |          1        0.02       75.68
                        t400 |          2        0.05       75.73
                        t401 |         21        0.48       76.20
                        t408 |         39        0.88       77.09
                   t408/t171 |          1        0.02       77.11
             t408/t230/t3304 |          1        0.02       77.13
                        t410 |          1        0.02       77.16
                       t4322 |          6        0.14       77.29
                        t442 |          5        0.11       77.40
                       t4451 |          5        0.11       77.52
                        t449 |          7        0.16       77.68
                  t449/t6899 |          1        0.02       77.70
                       t4549 |          1        0.02       77.72
                       t4553 |          2        0.05       77.77
                        t471 |          4        0.09       77.86
                       t4714 |          6        0.14       77.99
                       t4776 |          3        0.07       78.06
                        t491 |          2        0.05       78.11
                        t493 |          7        0.16       78.27
                   t493/t012 |          1        0.02       78.29
    t493/t089/t084/t267/t730 |          1        0.02       78.31
                        t499 |          4        0.09       78.40
                   t499/t120 |          1        0.02       78.43
                        t505 |         26        0.59       79.02
                       t5133 |         16        0.36       79.38
                        t521 |          1        0.02       79.40
                       t5211 |          2        0.05       79.45
            t5211/t040/t2726 |          1        0.02       79.47
                        t525 |          3        0.07       79.54
                        t528 |          7        0.16       79.70
                   t528/t786 |          1        0.02       79.72
                        t530 |         13        0.29       80.01
                        t537 |          1        0.02       80.04
                   t537/t026 |          1        0.02       80.06
                        t543 |          1        0.02       80.08
                        t548 |          4        0.09       80.17
                        t550 |          9        0.20       80.38
                        t559 |          1        0.02       80.40
                        t570 |          2        0.05       80.44
                        t571 |         60        1.36       81.81
                   t571/t537 |          1        0.02       81.83
                        t575 |         27        0.61       82.44
                        t579 |         11        0.25       82.69
                       t5855 |          6        0.14       82.83
                        t589 |          2        0.05       82.87
                       t5973 |          1        0.02       82.89
                        t605 |         43        0.98       83.87
                   t605/t693 |          2        0.05       83.92
                       t6134 |         12        0.27       84.19
                       t6154 |          3        0.07       84.26
                        t620 |         26        0.59       84.85
                       t6292 |          2        0.05       84.89
                        t630 |         24        0.54       85.44
                   t630/t530 |          1        0.02       85.46
                       t6390 |         14        0.32       85.78
                  t6390/t346 |          1        0.02       85.80
                 t6390/t6817 |          5        0.11       85.91
           t6390/t6817/t7409 |          1        0.02       85.93
                       t6415 |         14        0.32       86.25
                       t6416 |          8        0.18       86.43
                       t6417 |         11        0.25       86.68
                  t6417/t659 |          1        0.02       86.71
                   t643/t085 |          1        0.02       86.73
                        t645 |         26        0.59       87.32
                  t645/t1596 |          1        0.02       87.34
                       t6584 |         10        0.23       87.57
                        t659 |          9        0.20       87.77
                       t6703 |         23        0.52       88.29
                 t6703/t8585 |          2        0.05       88.34
                       t6791 |         13        0.29       88.63
                       t6792 |         20        0.45       89.09
                t6792/t10237 |          1        0.02       89.11
         t6792/t10237/t11779 |          1        0.02       89.13
                       t6793 |          2        0.05       89.18
                       t6794 |          9        0.20       89.38
                       t6795 |         12        0.27       89.66
                       t6796 |         15        0.34       90.00
                       t6797 |         25        0.57       90.56
                       t6798 |          1        0.02       90.59
                       t6799 |         24        0.54       91.13
                       t6800 |          3        0.07       91.20
                       t6801 |          1        0.02       91.22
                       t6803 |         26        0.59       91.81
                       t6804 |         12        0.27       92.08
                       t6805 |          2        0.05       92.13
                       t6806 |          6        0.14       92.26
                       t6807 |          7        0.16       92.42
                       t6808 |          4        0.09       92.51
                       t6809 |          7        0.16       92.67
                       t6810 |          2        0.05       92.72
                       t6811 |         23        0.52       93.24
                       t6814 |          4        0.09       93.33
                  t6814/t171 |          2        0.05       93.38
                       t6815 |          4        0.09       93.47
                       t6816 |          1        0.02       93.49
                       t6817 |          1        0.02       93.51
                       t6820 |          2        0.05       93.56
                       t6821 |         30        0.68       94.24
                       t6823 |          3        0.07       94.31
                       t6828 |          3        0.07       94.37
                       t6829 |          4        0.09       94.46
                 t6829/t6854 |          1        0.02       94.49
                       t6831 |          1        0.02       94.51
                       t6833 |          1        0.02       94.53
                       t6835 |          3        0.07       94.60
                       t6854 |          1        0.02       94.62
                       t6855 |          4        0.09       94.71
                  t6855/t019 |          1        0.02       94.74
                  t6855/t230 |          1        0.02       94.76
                       t6856 |          9        0.20       94.96
                       t6940 |          1        0.02       94.99
                       t6941 |          8        0.18       95.17
                        t701 |          1        0.02       95.19
                       t7031 |          4        0.09       95.28
                       t7032 |          1        0.02       95.30
                       t7050 |          2        0.05       95.35
                  t7050/t870 |          1        0.02       95.37
                       t7060 |          9        0.20       95.58
                        t710 |         13        0.29       95.87
                        t737 |         11        0.25       96.12
                   t737/t084 |          1        0.02       96.14
                       t7421 |          4        0.09       96.23
                        t748 |          1        0.02       96.26
                        t773 |          1        0.02       96.28
                        t774 |          4        0.09       96.37
                        t779 |          2        0.05       96.42
                       t7855 |          3        0.07       96.48
                       t7871 |          1        0.02       96.51
                  t7871/t880 |          1        0.02       96.53
                        t789 |          8        0.18       96.71
                   t789/t008 |          1        0.02       96.73
                  t7960/t571 |          1        0.02       96.76
                        t803 |          5        0.11       96.87
                       t8062 |          3        0.07       96.94
                       t8084 |          3        0.07       97.01
                        t817 |          3        0.07       97.07
                       t8518 |          1        0.02       97.10
                        t853 |          1        0.02       97.12
                        t870 |          8        0.18       97.30
                  t870/t7050 |          2        0.05       97.35
                       t8811 |          2        0.05       97.39
                  t8868/t084 |          1        0.02       97.41
                        t888 |         26        0.59       98.00
                        t908 |          3        0.07       98.07
                        t910 |          6        0.14       98.21
                        t922 |         10        0.23       98.43
                        t938 |          2        0.05       98.48
                       t9383 |          2        0.05       98.53
                        t939 |          1        0.02       98.55
                        t948 |          1        0.02       98.57
                        t954 |         13        0.29       98.87
                       t9726 |          2        0.05       98.91
                        t975 |         13        0.29       99.21
                       t9794 |          7        0.16       99.36
                       t9873 |          2        0.05       99.41
                        t996 |         17        0.39       99.80
                       t9973 |          9        0.20      100.00
-----------------------------+-----------------------------------
                       Total |      4,408      100.00

. keep spatype

. split spatype, s(/)
option s() not allowed
r(198);

. help split

. split spatype, parse(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. reshape long spatype
option i() required

         long                                wide
        +---------------+                   +------------------+
        | i   j   a   b |                   | i   a1 a2  b1 b2 |
        |---------------| <--- reshape ---> |------------------|
        | 1   1   1   2 |                   | 1   1   3   2  4 |
        | 1   2   3   4 |                   | 2   5   7   6  8 |
        | 2   1   5   6 |                   +------------------+
        | 2   2   7   8 |
        +---------------+

        long to wide: reshape wide a b, i(i) j(j)    (j existing variable)
        wide to long: reshape long a b, i(i) j(j)    (j    new   variable)
r(198);

. gen count=_n

. reshape long spatype, i(count)
(note: j = 1 2 3 4 5)
variable spatype already defined
r(110);

. reshape long spatype, i(count) j(number)
(note: j = 1 2 3 4 5)
variable spatype already defined
r(110);

. drop spatype

. reshape long spatype, i(count) j(number)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9039   ->   45195
Number of variables                   6   ->       3
j variable (5 values)                     ->   number
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. tab spatype

    spa type |      Freq.     Percent        Cum.
-------------+-----------------------------------
contaminated |          1        0.02        0.02
        t002 |        120        2.60        2.62
        t004 |          1        0.02        2.64
        t005 |        115        2.49        5.13
        t006 |         12        0.26        5.39
        t008 |         40        0.87        6.25
        t010 |          9        0.19        6.45
        t012 |        354        7.66       14.10
        t015 |         47        1.02       15.12
        t017 |         25        0.54       15.66
        t018 |         40        0.87       16.53
        t019 |          3        0.06       16.59
        t021 |        108        2.34       18.93
        t022 |          3        0.06       18.99
        t024 |         23        0.50       19.49
        t026 |         14        0.30       19.79
        t031 |          9        0.19       19.99
        t032 |         54        1.17       21.16
        t037 |         59        1.28       22.43
        t040 |          7        0.15       22.58
        t045 |         36        0.78       23.36
        t050 |          9        0.19       23.56
        t053 |          3        0.06       23.62
        t056 |         45        0.97       24.59
        t061 |         15        0.32       24.92
        t065 |         28        0.61       25.52
        t071 |         11        0.24       25.76
        t078 |         41        0.89       26.65
        t084 |        149        3.22       29.87
        t085 |         34        0.74       30.61
        t088 |          1        0.02       30.63
        t089 |         75        1.62       32.25
        t091 |         59        1.28       33.53
        t096 |         12        0.26       33.79
      t10184 |          3        0.06       33.85
       t1023 |          1        0.02       33.87
      t10237 |          2        0.04       33.92
       t1036 |         24        0.52       34.44
       t1040 |         14        0.30       34.74
       t1046 |          1        0.02       34.76
        t105 |          3        0.06       34.83
      t10514 |          6        0.13       34.96
       t1070 |         12        0.26       35.22
       t1078 |          1        0.02       35.24
      t11040 |          6        0.13       35.37
      t11041 |          2        0.04       35.41
      t11042 |          1        0.02       35.43
      t11048 |          1        0.02       35.45
      t11252 |          3        0.06       35.52
       t1149 |          3        0.06       35.58
       t1166 |          7        0.15       35.73
      t11779 |          1        0.02       35.76
        t120 |         20        0.43       36.19
        t121 |          2        0.04       36.23
      t12151 |          5        0.11       36.34
        t122 |          7        0.15       36.49
       t1236 |          1        0.02       36.51
       t1239 |          8        0.17       36.69
       t1245 |          2        0.04       36.73
       t1255 |          4        0.09       36.82
       t1265 |         16        0.35       37.16
        t127 |        130        2.81       39.97
      t12838 |          1        0.02       40.00
       t1306 |          8        0.17       40.17
       t1347 |          3        0.06       40.23
        t136 |         53        1.15       41.38
       t1362 |          1        0.02       41.40
        t140 |         12        0.26       41.66
       t1414 |         12        0.26       41.92
        t144 |          1        0.02       41.94
       t1445 |         14        0.30       42.25
       t1451 |         12        0.26       42.50
      t14529 |          2        0.04       42.55
      t14530 |          5        0.11       42.66
       t1476 |          1        0.02       42.68
        t148 |          5        0.11       42.79
       t1492 |          5        0.11       42.89
      t14942 |          1        0.02       42.92
       t1509 |          8        0.17       43.09
       t1510 |          1        0.02       43.11
       t1521 |          3        0.06       43.18
       t1541 |         14        0.30       43.48
       t1544 |         11        0.24       43.72
      t15751 |          1        0.02       43.74
      t15752 |          1        0.02       43.76
       t1577 |          1        0.02       43.78
      t15775 |          1        0.02       43.80
      t15776 |          1        0.02       43.82
      t15777 |          2        0.04       43.87
      t15780 |          1        0.02       43.89
       t1596 |          1        0.02       43.91
        t160 |         60        1.30       45.21
       t1626 |         12        0.26       45.47
        t164 |         72        1.56       47.03
        t166 |         34        0.74       47.76
       t1685 |         11        0.24       48.00
        t171 |         36        0.78       48.78
       t1712 |          1        0.02       48.80
       t1716 |         18        0.39       49.19
       t1720 |         13        0.28       49.47
       t1736 |          1        0.02       49.49
        t177 |         11        0.24       49.73
       t1827 |          1        0.02       49.75
       t1854 |          1        0.02       49.77
        t186 |          9        0.19       49.97
       t1877 |          4        0.09       50.05
       t1885 |          7        0.15       50.21
        t189 |         57        1.23       51.44
        t190 |         10        0.22       51.65
       t1908 |          4        0.09       51.74
        t192 |         25        0.54       52.28
        t195 |          1        0.02       52.30
        t196 |          8        0.17       52.48
       t1963 |          1        0.02       52.50
       t1987 |         15        0.32       52.82
       t2029 |          2        0.04       52.87
       t2074 |          5        0.11       52.97
        t209 |         49        1.06       54.03
       t2098 |          3        0.06       54.10
       t2115 |          3        0.06       54.16
       t2119 |          3        0.06       54.23
        t213 |         43        0.93       55.16
       t2133 |          2        0.04       55.20
       t2143 |          3        0.06       55.27
        t216 |         70        1.51       56.78
        t219 |         13        0.28       57.06
        t223 |         13        0.28       57.34
        t227 |         13        0.28       57.62
       t2271 |         45        0.97       58.60
        t228 |         15        0.32       58.92
       t2292 |          4        0.09       59.01
        t230 |         56        1.21       60.22
       t2365 |         23        0.50       60.72
       t2455 |         13        0.28       61.00
       t2556 |          2        0.04       61.04
        t258 |          7        0.15       61.19
       t2643 |         12        0.26       61.45
        t267 |         26        0.56       62.02
       t2726 |          2        0.04       62.06
        t273 |          8        0.17       62.23
        t275 |          8        0.17       62.41
        t279 |          2        0.04       62.45
        t280 |         22        0.48       62.92
       t2842 |          1        0.02       62.95
       t2849 |          6        0.13       63.08
       t2868 |          5        0.11       63.18
       t2883 |         13        0.28       63.47
       t2930 |         13        0.28       63.75
       t2933 |          1        0.02       63.77
        t298 |          4        0.09       63.85
       t3072 |          1        0.02       63.88
       t3085 |          5        0.11       63.98
       t3092 |         13        0.28       64.27
       t3097 |          2        0.04       64.31
        t310 |          2        0.04       64.35
        t316 |         11        0.24       64.59
        t318 |         29        0.63       65.22
        t321 |          3        0.06       65.28
       t3240 |          1        0.02       65.30
       t3262 |          8        0.17       65.48
       t3284 |          2        0.04       65.52
        t330 |          3        0.06       65.59
       t3304 |         33        0.71       66.30
        t334 |          1        0.02       66.32
       t3345 |         13        0.28       66.60
        t335 |          6        0.13       66.73
       t3369 |          4        0.09       66.82
        t337 |         25        0.54       67.36
        t338 |         36        0.78       68.14
        t342 |         24        0.52       68.66
        t346 |         55        1.19       69.85
        t349 |          4        0.09       69.93
        t350 |         13        0.28       70.21
        t360 |         41        0.89       71.10
       t3610 |          8        0.17       71.27
        t363 |          3        0.06       71.34
        t364 |         42        0.91       72.25
        t370 |          2        0.04       72.29
       t3732 |         13        0.28       72.57
        t375 |          7        0.15       72.72
        t377 |          7        0.15       72.87
        t379 |         44        0.95       73.83
        t382 |         41        0.89       74.71
        t386 |          2        0.04       74.76
       t3879 |          2        0.04       74.80
        t398 |          2        0.04       74.84
        t399 |         12        0.26       75.10
       t3992 |          1        0.02       75.12
        t400 |          2        0.04       75.17
        t401 |         23        0.50       75.67
        t408 |         41        0.89       76.55
        t410 |          1        0.02       76.57
       t4309 |          1        0.02       76.60
       t4322 |          6        0.13       76.73
        t442 |          5        0.11       76.83
       t4451 |          5        0.11       76.94
        t449 |          9        0.19       77.14
       t4549 |          2        0.04       77.18
       t4553 |          2        0.04       77.22
        t471 |          4        0.09       77.31
       t4714 |          6        0.13       77.44
       t4776 |          5        0.11       77.55
        t491 |          3        0.06       77.61
        t493 |         10        0.22       77.83
        t499 |          6        0.13       77.96
        t505 |         26        0.56       78.52
       t5133 |         16        0.35       78.87
        t521 |          1        0.02       78.89
       t5211 |          4        0.09       78.97
        t525 |          3        0.06       79.04
        t528 |         10        0.22       79.26
        t530 |         15        0.32       79.58
        t537 |          3        0.06       79.65
        t543 |          1        0.02       79.67
        t548 |          4        0.09       79.75
        t550 |         10        0.22       79.97
        t559 |          1        0.02       79.99
       t5635 |          1        0.02       80.01
        t570 |          2        0.04       80.06
        t571 |         68        1.47       81.53
        t575 |         27        0.58       82.11
       t5753 |          1        0.02       82.13
        t579 |         11        0.24       82.37
       t5855 |          6        0.13       82.50
        t589 |          2        0.04       82.54
       t5973 |          1        0.02       82.57
        t605 |         46        1.00       83.56
        t608 |          1        0.02       83.58
       t6134 |         12        0.26       83.84
       t6154 |          3        0.06       83.91
        t620 |         27        0.58       84.49
       t6292 |          2        0.04       84.53
        t630 |         26        0.56       85.10
       t6390 |         21        0.45       85.55
       t6415 |         14        0.30       85.85
       t6416 |          8        0.17       86.03
       t6417 |         12        0.26       86.29
        t643 |          1        0.02       86.31
        t645 |         27        0.58       86.89
       t6584 |         10        0.22       87.11
        t659 |         11        0.24       87.35
       t6703 |         25        0.54       87.89
       t6791 |         13        0.28       88.17
       t6792 |         22        0.48       88.64
       t6793 |          2        0.04       88.69
       t6794 |          9        0.19       88.88
       t6795 |         12        0.26       89.14
       t6796 |         15        0.32       89.47
       t6797 |         25        0.54       90.01
       t6798 |          1        0.02       90.03
       t6799 |         25        0.54       90.57
       t6800 |          3        0.06       90.63
       t6801 |          1        0.02       90.66
       t6803 |         26        0.56       91.22
       t6804 |         12        0.26       91.48
       t6805 |          2        0.04       91.52
       t6806 |          6        0.13       91.65
       t6807 |          7        0.15       91.80
       t6808 |          4        0.09       91.89
       t6809 |          7        0.15       92.04
       t6810 |          3        0.06       92.10
       t6811 |         23        0.50       92.60
       t6814 |          7        0.15       92.75
       t6815 |          4        0.09       92.84
       t6816 |          1        0.02       92.86
       t6817 |          7        0.15       93.01
       t6820 |          2        0.04       93.06
       t6821 |         30        0.65       93.71
       t6823 |          3        0.06       93.77
       t6825 |          1        0.02       93.79
       t6826 |          1        0.02       93.81
       t6828 |          3        0.06       93.88
       t6829 |          5        0.11       93.99
       t6831 |          1        0.02       94.01
       t6833 |          1        0.02       94.03
       t6835 |          3        0.06       94.09
       t6854 |          2        0.04       94.14
       t6855 |          8        0.17       94.31
       t6856 |          9        0.19       94.51
       t6899 |          1        0.02       94.53
        t693 |          2        0.04       94.57
       t6940 |          1        0.02       94.59
       t6941 |          8        0.17       94.77
       t6942 |          1        0.02       94.79
        t701 |          1        0.02       94.81
       t7031 |          6        0.13       94.94
       t7032 |          1        0.02       94.96
       t7049 |          3        0.06       95.02
       t7050 |          5        0.11       95.13
       t7060 |          9        0.19       95.33
        t710 |         13        0.28       95.61
       t7154 |          1        0.02       95.63
       t7205 |          1        0.02       95.65
        t730 |          1        0.02       95.67
        t731 |          2        0.04       95.72
        t737 |         12        0.26       95.98
       t7409 |          1        0.02       96.00
       t7421 |          4        0.09       96.08
        t748 |          2        0.04       96.13
       t7514 |          2        0.04       96.17
        t773 |          1        0.02       96.19
        t774 |          4        0.09       96.28
        t779 |          2        0.04       96.32
       t7855 |          3        0.06       96.39
        t786 |          1        0.02       96.41
       t7871 |          2        0.04       96.45
        t789 |          9        0.19       96.65
       t7960 |          1        0.02       96.67
        t803 |          5        0.11       96.78
       t8062 |          3        0.06       96.84
       t8084 |          3        0.06       96.91
        t817 |          3        0.06       96.97
       t8518 |          1        0.02       96.99
        t853 |          1        0.02       97.01
       t8585 |          2        0.04       97.06
        t870 |         11        0.24       97.30
        t871 |          2        0.04       97.34
        t880 |          1        0.02       97.36
       t8811 |          2        0.04       97.40
       t8868 |          1        0.02       97.43
        t888 |         26        0.56       97.99
        t908 |          4        0.09       98.07
        t910 |          6        0.13       98.20
       t9108 |          1        0.02       98.23
       t9162 |          1        0.02       98.25
        t922 |         10        0.22       98.46
        t938 |          2        0.04       98.51
       t9383 |          2        0.04       98.55
        t939 |          1        0.02       98.57
        t948 |          1        0.02       98.59
        t954 |         13        0.28       98.88
       t9572 |          1        0.02       98.90
       t9584 |          1        0.02       98.92
       t9726 |          2        0.04       98.96
        t975 |         13        0.28       99.24
       t9794 |          7        0.15       99.39
       t9873 |          2        0.04       99.44
        t996 |         17        0.37       99.81
       t9973 |          9        0.19      100.00
-------------+-----------------------------------
       Total |      4,623      100.00

. drop count

. drop number

. duplicates drop

Duplicates in terms of all variables

(44,855 observations deleted)

. sort sp

. export excel using "E:\users\amy.mason\Pipeline_27_07_2016\Datasets\list of spatypes.xls", firstrow(variables)
file E:\users\amy.mason\Pipeline_27_07_2016\Datasets\list of spatypes.xls saved

. noi di _n(5) _dup(80) "=" _n "Clonal colonies" _n _dup(80) "=" 





================================================================================
Clonal colonies
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\Spa-typing_burp_03.03.2016.csv, delimiter(";:", collapse) varna
> mes(1) clear
(5 vars, 8,750 obs)

. noi di _n(5) _dup(80) "=" _n "Burp distances" _n _dup(80) "=" 





================================================================================
Burp distances
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\costlist.txt, delimiter(",", collapse) varnames(1) stripquote(y
> es) clear 
file E:\users\amy.mason\staph_carriage\Inputs\costlist.txt not found
r(601);

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\BURP2", replace
(note: file E:\users\amy.mason\staph_carriage\Datasets\BURP2.dta not found)
file E:\users\amy.mason\staph_carriage\Datasets\BURP2.dta saved

. import delimited E:\users\amy.mason\staph_carriage\Inputs\costlist.txt, delimiter(",", collapse) varnames(1) stripquote(y
> es) clear
(4 vars, 48,828 obs)

. 
. * extract sample names

. 
. gen sample1= strpos( species1, "t")

. 
. assert sample1!=0 & sample1!=.

. 
. gen sub1= substr( species1, sample1,.)

. 
. drop sample1

. 
. gen sample1= strpos(sub1, " ")

. 
. gen subsub1 = sub1 if sample1==0
(48,828 missing values generated)

. 
. replace subsub1= substr(sub1,1, sample1-1) if sample1!=0
variable subsub1 was str1 now str6
(48,828 real changes made)

. 
. drop sample1

. 
. gen sample1= strpos(subsub1, " ")

. 
. assert sample1==0

. 
. drop sample1 sub1 species1

. 
. rename subsub1 spatype1

. 
. 
. 
. gen sample2= strpos( species2, "t")

. 
. assert sample2!=0 & sample2!=.

. 
. gen sub2= substr( species2, sample2,.)

. 
. drop sample2

. 
. gen sample2= strpos(sub2, " ")

. 
. gen subsub2 = sub2 if sample2==0
(48,828 missing values generated)

. 
. replace subsub2= substr(sub2,1, sample2-1) if sample2!=0
variable subsub2 was str1 now str6
(48,828 real changes made)

. 
. drop sample2

. 
. gen sample2= strpos(subsub2, " ")

. 
. assert sample2==0

. 
. drop sample2 sub2 species2

. 
. rename subsub2 spatype2

. drop v4

. 
. save "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", replace
file E:\users\amy.mason\staph_carriage\Datasets\spa_BURP.dta saved

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. 
. 
. 
. keep patid timepoint spatype

. 
. order patid timepoint spatype

. 
. replace spatype= subinstr(spatype, "contaminated", "",.)
(1 real change made)

. 
. bysort patid timepoint: assert _n==1

. 
. by patid: gen initialspa = spatype[1]
(3,405 missing values generated)

. 
. by patid: gen secondspa = spatype[2]
(4,085 missing values generated)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. use temp, clear

. 
. split spatype, p(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. 
. drop spatype

. 
. reshape long spatype, i(patid timepoint) j(current)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9039   ->   45195
Number of variables                   9   ->       6
j variable (5 values)                     ->   current
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. 
. 
. 
. split initialspa, p(/)
variables created as string: 
initialspa1  initialspa2  initialspa3  initialspa4  initialspa5

. 
. split secondspa, p(/)
variables created as string: 
secondspa1  secondspa2  secondspa3  secondspa4  secondspa5

. 
. drop initialspa secondspa

. 
. rename secondspa1 initialspa6

. 
. rename secondspa2 initialspa7

. 
. rename secondspa3 initialspa8

. 
. rename secondspa4 initialspa9

. 
. rename secondspa5 initialspa10

. 
. reshape long initialspa, i(patid timepoint current) j(start)
(note: j = 1 2 3 4 5 6 7 8 9 10)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    45195   ->  451950
Number of variables                  14   ->       6
j variable (10 values)                    ->   start
xij variables:
initialspa1 initialspa2 ... initialspa10  ->   initialspa
-----------------------------------------------------------------------------

. 
. 
. 
. rename spatype spatype1

. 
. rename initial spatype2

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update
(note: variable spatype2 was str5, now str6 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       499,581
        from master                   450,928  (_merge==1)
        from using                     48,653  (_merge==2)

    matched                             1,022
        not updated                     1,022  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. drop if _merge==2
(48,653 observations deleted)

. 
. assert inlist(_merge,1,3)

. 
. 
. 
. rename _merge _merge1

. 
. rename dist dist1

. 
. rename spatype1 spatype_temp

. 
. rename spatype2 spatype1

. 
. rename spatype_temp spatype2

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update

    Result                           # of obs.
    -----------------------------------------
    not matched                       499,463
        from master                   450,826  (_merge==1)
        from using                     48,637  (_merge==2)

    matched                             1,124
        not updated                     1,124  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. drop if _merge==2
(48,637 observations deleted)

. 
. assert inlist(_merge,1,3)

. 
. 
. 
. assert dist==. if dist1!=.

. 
. assert dist1==. if dist!=.

. 
. 
. 
. gen masterdist = min(dist1, dist)
(449,804 missing values generated)

. 
. replace masterdist=0 if spatype1==spatype2
(365,150 real changes made)

. 
. replace masterdist=1000 if spatype1=="" & spatype2!=""
(37,236 real changes made)

. 
. replace masterdist=1000 if spatype2=="" & spatype1!=""
(47,256 real changes made)

. codebook masterdist

---------------------------------------------------------------------------------------------------------------------------
masterdist                                                                                                      (unlabeled)
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1000]                     units:  1
         unique values:  27                       missing .:  162/451,950

                  mean:    187.08
              std. dev:   389.897

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         0         0      1000

. list if masterdist==.

        +-------------------------------------------------------------------------------------------------------------+
397044. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2079 |       24 |       1 |     6 |     t008 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397045. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2079 |       18 |       1 |     6 |     t008 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397046. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2005 |       24 |       1 |     6 |     t012 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397047. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2005 |       24 |       1 |     1 |     t012 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397048. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       14 |       1 |     6 |     t053 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397049. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       18 |       3 |     1 |     t053 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397050. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       14 |       1 |     1 |     t053 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397051. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       18 |       3 |     6 |     t053 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397052. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       16 |       3 |     1 |     t053 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397053. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       16 |       3 |     6 |     t053 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397054. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       16 |       2 |     6 |     t105 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397055. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       12 |       2 |     1 |     t105 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397056. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       18 |       2 |     6 |     t105 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397057. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       12 |       2 |     6 |     t105 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397058. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       16 |       2 |     1 |     t105 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397059. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |       18 |       2 |     1 |     t105 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397060. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2081 |       18 |       1 |     6 |    t1414 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397061. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2081 |       16 |       1 |     6 |     t216 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397062. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |        6 |       2 |     6 |    t3262 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397063. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   688 |        6 |       2 |     1 |    t3262 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397064. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2081 |       14 |       1 |     6 |     t400 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397065. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   128 |       36 |       1 |     1 |     t559 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397066. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   128 |       36 |       1 |     6 |     t559 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397067. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2079 |       18 |       2 |     6 |     t659 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397068. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1373 |       22 |       1 |     1 |    t7871 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397069. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1373 |       24 |       1 |     1 |    t7871 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
397070. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1373 |       24 |       2 |     1 |     t880 |     t002 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403749. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   971 |        6 |       2 |     7 |     t528 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403750. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   971 |        6 |       2 |     1 |     t528 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403755. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   993 |        8 |       1 |     6 |     t748 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403756. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   993 |        8 |       1 |     1 |     t748 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403767. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |    53 |       28 |       1 |     6 |    t8811 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403768. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |    53 |       28 |       1 |     1 |    t8811 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403769. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |    53 |       30 |       1 |     1 |    t8811 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
403770. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |    53 |       30 |       1 |     6 |    t8811 |     t012 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404379. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   448 |       42 |       1 |     1 |     t026 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404388. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        6 |       1 |     1 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404389. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        4 |       1 |     1 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404390. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        8 |       1 |     1 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404391. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        4 |       1 |     6 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404392. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        8 |       1 |     6 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404393. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        2 |       2 |     6 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404394. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        2 |       2 |     1 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
404395. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        6 |       1 |     6 |    t3369 |     t015 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
409331. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2063 |       14 |       3 |     1 |    t2726 |     t040 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
409332. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2063 |       14 |       3 |     6 |    t2726 |     t040 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412878. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       22 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412879. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       16 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412880. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       22 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412881. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       18 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412882. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       10 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412883. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       14 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412884. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2092 |       20 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412885. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       24 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412886. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       20 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412887. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       10 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412888. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       24 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412889. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       14 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412890. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       12 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412891. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       16 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412892. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       18 |       1 |     1 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412893. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       12 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
412894. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2048 |       20 |       1 |     6 |     t002 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
413204. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   133 |       48 |       2 |     6 |     t605 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
413205. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   133 |       48 |       2 |     1 |     t605 |     t084 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
413652. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   678 |        6 |       1 |     1 |     t643 |     t085 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
413653. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   678 |        6 |       1 |     6 |     t643 |     t085 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
415665. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1378 |        8 |       2 |     6 |     t528 |     t096 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
415666. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1378 |        4 |       1 |     1 |     t528 |     t096 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
415667. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1378 |        8 |       2 |     1 |     t528 |     t096 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
415668. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1378 |        4 |       1 |     6 |     t528 |     t096 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
415669. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1378 |        6 |       1 |     6 |     t528 |     t096 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
415670. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1378 |        6 |       1 |     1 |     t528 |     t096 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
418026. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   418 |       78 |       1 |     1 |     t002 |     t127 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
418275. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1038 |       24 |       2 |     1 |     t386 |     t127 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
418276. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1038 |       26 |       1 |     1 |     t386 |     t127 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
418277. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1038 |       24 |       2 |     6 |     t386 |     t127 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
418278. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  1038 |       26 |       1 |     6 |     t386 |     t127 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
419517. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   774 |       22 |       1 |     1 |    t2119 |    t1509 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
419518. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   774 |       22 |       1 |     6 |    t2119 |    t1509 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
419519. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   774 |       24 |       1 |     1 |    t2119 |    t1509 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
419520. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   774 |       24 |       1 |     6 |    t2119 |    t1509 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
425578. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   334 |       16 |       1 |     1 |     t002 |     t195 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
429103. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   407 |       40 |       1 |     1 |     t026 |     t227 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
429104. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   407 |       48 |       1 |     1 |     t026 |     t227 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
429105. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   407 |       42 |       1 |     1 |     t026 |     t227 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430011. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   971 |        6 |       2 |     6 |     t528 |     t230 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430012. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   971 |        6 |       2 |     2 |     t528 |     t230 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430890. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       36 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430891. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |        4 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430892. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |        6 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430893. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |        8 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430894. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       40 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430895. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       30 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430896. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       28 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430897. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       34 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430898. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       10 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430899. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       20 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430900. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       18 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430901. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |        2 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430902. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |        0 |       2 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430903. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       26 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430904. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       14 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430905. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       22 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430906. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       12 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430907. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       16 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430908. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       32 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430909. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       38 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
430910. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |       24 |       1 |     1 |     t364 |    t2726 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
433552. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        2 |       1 |     7 |     t015 |    t3369 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
433553. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |        0 |       1 |     7 |     t015 |    t3369 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
433558. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |       22 |       1 |     7 |     t817 |    t3369 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
433559. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |       20 |       1 |     7 |     t817 |    t3369 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
433560. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2078 |       24 |       1 |     7 |     t817 |    t3369 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
436097. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |        0 |       1 |     6 |    t2726 |     t364 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
436098. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   459 |        0 |       1 |     2 |    t2726 |     t364 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438138. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |        8 |       1 |     1 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438139. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       12 |       1 |     1 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438140. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       10 |       1 |     1 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438141. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       14 |       1 |     1 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438142. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       12 |       1 |     6 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438143. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |        8 |       1 |     6 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438144. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       10 |       1 |     6 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438145. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |        6 |       1 |     6 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438146. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       16 |       1 |     1 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438147. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |        4 |       1 |     6 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438148. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |        6 |       1 |     1 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438149. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       16 |       1 |     6 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438150. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |       14 |       1 |     6 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
438151. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   319 |        4 |       1 |     1 |     t127 |     t398 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
439804. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2080 |       16 |       1 |     1 |     t310 |    t4776 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
439805. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2080 |       20 |       1 |     1 |     t310 |    t4776 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
440619. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   768 |        2 |       2 |     6 |     t786 |     t528 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
440620. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   768 |        2 |       2 |     1 |     t786 |     t528 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
440826. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |       18 |       1 |     7 |     t002 |     t537 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
440827. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |        6 |       1 |     7 |     t026 |     t537 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
440828. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |       10 |       2 |     7 |     t026 |     t537 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
440829. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |       12 |       1 |     7 |     t026 |     t537 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
441490. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |       18 |       1 |     6 |     t002 |     t571 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
441498. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |       10 |       2 |     6 |     t026 |     t571 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
441499. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |        6 |       1 |     6 |     t026 |     t571 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
441500. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |  2106 |       12 |       1 |     6 |     t026 |     t571 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
442552. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   332 |       30 |       2 |     1 |     t693 |     t605 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
442553. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   332 |       28 |       2 |     6 |     t693 |     t605 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
442554. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   332 |       30 |       2 |     6 |     t693 |     t605 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
442555. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   332 |       28 |       2 |     1 |     t693 |     t605 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
447941. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   107 |       42 |       1 |     6 |     t543 |    t6808 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
447942. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   107 |       42 |       1 |     1 |     t543 |    t6808 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450452. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   768 |        2 |       1 |     7 |     t528 |     t786 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450453. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   768 |        4 |       1 |     7 |     t528 |     t786 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450454. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   768 |        0 |       1 |     7 |     t528 |     t786 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450969. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       20 |       1 |     1 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450970. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       18 |       2 |     6 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450971. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       12 |       2 |     6 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450972. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       18 |       2 |     1 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450973. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       12 |       2 |     1 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450974. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       20 |       1 |     6 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450975. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       24 |       1 |     6 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450976. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       22 |       1 |     6 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450977. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       24 |       1 |     1 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
450978. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   637 |       22 |       1 |     1 |    t7050 |     t870 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

        +-------------------------------------------------------------------------------------------------------------+
451668. | patid | timepo~t | current | start | spatype2 | spatype1 | dist1 |         _merge1 | dist |          _merge |
        |   418 |       78 |       1 |     6 |     t002 |     t948 |     . | master only (1) |    . | master only (1) |
        |-------------------------------------------------------------------------------------------------------------|
        |                                                  master~t                                                   |
        |                                                         .                                                   |
        +-------------------------------------------------------------------------------------------------------------+

. tab spatype* if masterdist==.

           |                                              spatype1
  spa type |      t002       t012       t015       t040       t084       t085       t096       t127      t1509 |     Total
-----------+---------------------------------------------------------------------------------------------------+----------
      t002 |         0          0          0          0         17          0          0          1          0 |        22 
      t008 |         2          0          0          0          0          0          0          0          0 |         2 
      t012 |         2          0          0          0          0          0          0          0          0 |         2 
      t015 |         0          0          0          0          0          0          0          0          0 |         2 
      t026 |         0          0          1          0          0          0          0          0          0 |        10 
      t053 |         6          0          0          0          0          0          0          0          0 |         6 
      t105 |         6          0          0          0          0          0          0          0          0 |         6 
      t127 |         0          0          0          0          0          0          0          0          0 |        14 
     t1414 |         1          0          0          0          0          0          0          0          0 |         1 
     t2119 |         0          0          0          0          0          0          0          0          4 |         4 
      t216 |         1          0          0          0          0          0          0          0          0 |         1 
     t2726 |         0          0          0          2          0          0          0          0          0 |         4 
      t310 |         0          0          0          0          0          0          0          0          0 |         2 
     t3262 |         2          0          0          0          0          0          0          0          0 |         2 
     t3369 |         0          0          8          0          0          0          0          0          0 |         8 
      t364 |         0          0          0          0          0          0          0          0          0 |        21 
      t386 |         0          0          0          0          0          0          0          4          0 |         4 
      t400 |         1          0          0          0          0          0          0          0          0 |         1 
      t528 |         0          2          0          0          0          0          6          0          0 |        13 
      t543 |         0          0          0          0          0          0          0          0          0 |         2 
      t559 |         2          0          0          0          0          0          0          0          0 |         2 
      t605 |         0          0          0          0          2          0          0          0          0 |         2 
      t643 |         0          0          0          0          0          2          0          0          0 |         2 
      t659 |         1          0          0          0          0          0          0          0          0 |         1 
      t693 |         0          0          0          0          0          0          0          0          0 |         4 
     t7050 |         0          0          0          0          0          0          0          0          0 |        10 
      t748 |         0          2          0          0          0          0          0          0          0 |         2 
      t786 |         0          0          0          0          0          0          0          0          0 |         2 
     t7871 |         2          0          0          0          0          0          0          0          0 |         2 
      t817 |         0          0          0          0          0          0          0          0          0 |         3 
      t880 |         1          0          0          0          0          0          0          0          0 |         1 
     t8811 |         0          4          0          0          0          0          0          0          0 |         4 
-----------+---------------------------------------------------------------------------------------------------+----------
     Total |        27          8          9          2         19          2          6          5          4 |       162 


           |                                              spatype1
  spa type |      t195       t227       t230      t2726      t3369       t364       t398      t4776       t528 |     Total
-----------+---------------------------------------------------------------------------------------------------+----------
      t002 |         1          0          0          0          0          0          0          0          0 |        22 
      t008 |         0          0          0          0          0          0          0          0          0 |         2 
      t012 |         0          0          0          0          0          0          0          0          0 |         2 
      t015 |         0          0          0          0          2          0          0          0          0 |         2 
      t026 |         0          3          0          0          0          0          0          0          0 |        10 
      t053 |         0          0          0          0          0          0          0          0          0 |         6 
      t105 |         0          0          0          0          0          0          0          0          0 |         6 
      t127 |         0          0          0          0          0          0         14          0          0 |        14 
     t1414 |         0          0          0          0          0          0          0          0          0 |         1 
     t2119 |         0          0          0          0          0          0          0          0          0 |         4 
      t216 |         0          0          0          0          0          0          0          0          0 |         1 
     t2726 |         0          0          0          0          0          2          0          0          0 |         4 
      t310 |         0          0          0          0          0          0          0          2          0 |         2 
     t3262 |         0          0          0          0          0          0          0          0          0 |         2 
     t3369 |         0          0          0          0          0          0          0          0          0 |         8 
      t364 |         0          0          0         21          0          0          0          0          0 |        21 
      t386 |         0          0          0          0          0          0          0          0          0 |         4 
      t400 |         0          0          0          0          0          0          0          0          0 |         1 
      t528 |         0          0          2          0          0          0          0          0          0 |        13 
      t543 |         0          0          0          0          0          0          0          0          0 |         2 
      t559 |         0          0          0          0          0          0          0          0          0 |         2 
      t605 |         0          0          0          0          0          0          0          0          0 |         2 
      t643 |         0          0          0          0          0          0          0          0          0 |         2 
      t659 |         0          0          0          0          0          0          0          0          0 |         1 
      t693 |         0          0          0          0          0          0          0          0          0 |         4 
     t7050 |         0          0          0          0          0          0          0          0          0 |        10 
      t748 |         0          0          0          0          0          0          0          0          0 |         2 
      t786 |         0          0          0          0          0          0          0          0          2 |         2 
     t7871 |         0          0          0          0          0          0          0          0          0 |         2 
      t817 |         0          0          0          0          3          0          0          0          0 |         3 
      t880 |         0          0          0          0          0          0          0          0          0 |         1 
     t8811 |         0          0          0          0          0          0          0          0          0 |         4 
-----------+---------------------------------------------------------------------------------------------------+----------
     Total |         1          3          2         21          5          2         14          2          2 |       162 


           |                                   spatype1
  spa type |      t537       t571       t605      t6808       t786       t870       t948 |     Total
-----------+-----------------------------------------------------------------------------+----------
      t002 |         1          1          0          0          0          0          1 |        22 
      t008 |         0          0          0          0          0          0          0 |         2 
      t012 |         0          0          0          0          0          0          0 |         2 
      t015 |         0          0          0          0          0          0          0 |         2 
      t026 |         3          3          0          0          0          0          0 |        10 
      t053 |         0          0          0          0          0          0          0 |         6 
      t105 |         0          0          0          0          0          0          0 |         6 
      t127 |         0          0          0          0          0          0          0 |        14 
     t1414 |         0          0          0          0          0          0          0 |         1 
     t2119 |         0          0          0          0          0          0          0 |         4 
      t216 |         0          0          0          0          0          0          0 |         1 
     t2726 |         0          0          0          0          0          0          0 |         4 
      t310 |         0          0          0          0          0          0          0 |         2 
     t3262 |         0          0          0          0          0          0          0 |         2 
     t3369 |         0          0          0          0          0          0          0 |         8 
      t364 |         0          0          0          0          0          0          0 |        21 
      t386 |         0          0          0          0          0          0          0 |         4 
      t400 |         0          0          0          0          0          0          0 |         1 
      t528 |         0          0          0          0          3          0          0 |        13 
      t543 |         0          0          0          2          0          0          0 |         2 
      t559 |         0          0          0          0          0          0          0 |         2 
      t605 |         0          0          0          0          0          0          0 |         2 
      t643 |         0          0          0          0          0          0          0 |         2 
      t659 |         0          0          0          0          0          0          0 |         1 
      t693 |         0          0          4          0          0          0          0 |         4 
     t7050 |         0          0          0          0          0         10          0 |        10 
      t748 |         0          0          0          0          0          0          0 |         2 
      t786 |         0          0          0          0          0          0          0 |         2 
     t7871 |         0          0          0          0          0          0          0 |         2 
      t817 |         0          0          0          0          0          0          0 |         3 
      t880 |         0          0          0          0          0          0          0 |         1 
     t8811 |         0          0          0          0          0          0          0 |         4 
-----------+-----------------------------------------------------------------------------+----------
     Total |         4          4          4          2          3         10          1 |       162 


. tab masterdist if spatype1=="t002"

 masterdist |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        159       11.93       11.93
       1000 |      1,174       88.07      100.00
------------+-----------------------------------
      Total |      1,333      100.00

. tab masterdist if spatype1=="t002", m

 masterdist |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        159       11.69       11.69
       1000 |      1,174       86.32       98.01
          . |         27        1.99      100.00
------------+-----------------------------------
      Total |      1,360      100.00

. tab masterdist if spatype1=="t539", m
no observations

. tab masterdist if spatype2=="t539", m
no observations

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\BURP2", clear

. import delimited E:\users\amy.mason\staph_carriage\Inputs\costlist.txt, delimiter(",", collapse) varnames(1) stripquote(y
> es) clear 
(4 vars, 48,828 obs)

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\BURP2", replace
file E:\users\amy.mason\staph_carriage\Datasets\BURP2.dta saved

. keep if  strpos(species1, "t537")>0 | strpos(species2, "t537")>0
(48,516 observations deleted)

. gen hello=1 if strpos(species1, "t002")>0 | strpos(species2, "t002")
(312 missing values generated)

. tab hello
no observations

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. 
. 
. 
. keep patid timepoint spatype

. 
. order patid timepoint spatype

. 
. replace spatype= subinstr(spatype, "contaminated", "",.)
(1 real change made)

. 
. bysort patid timepoint: assert _n==1

. 
. by patid: gen initialspa = spatype[1]
(3,405 missing values generated)

. 
. by patid: gen secondspa = spatype[2]
(4,085 missing values generated)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. use temp, clear

. 
. split spatype, p(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. 
. drop spatype

. 
. reshape long spatype, i(patid timepoint) j(current)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9039   ->   45195
Number of variables                   9   ->       6
j variable (5 values)                     ->   current
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. 
. 
. 
. split initialspa, p(/)
variables created as string: 
initialspa1  initialspa2  initialspa3  initialspa4  initialspa5

. 
. split secondspa, p(/)
variables created as string: 
secondspa1  secondspa2  secondspa3  secondspa4  secondspa5

. 
. drop initialspa secondspa

. 
. rename secondspa1 initialspa6

. 
. rename secondspa2 initialspa7

. 
. rename secondspa3 initialspa8

. 
. rename secondspa4 initialspa9

. 
. rename secondspa5 initialspa10

. 
. reshape long initialspa, i(patid timepoint current) j(start)
(note: j = 1 2 3 4 5 6 7 8 9 10)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    45195   ->  451950
Number of variables                  14   ->       6
j variable (10 values)                    ->   start
xij variables:
initialspa1 initialspa2 ... initialspa10  ->   initialspa
-----------------------------------------------------------------------------

. 
. 
. 
. rename spatype spatype1

. 
. rename initial spatype2

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update
(note: variable spatype2 was str5, now str6 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       499,581
        from master                   450,928  (_merge==1)
        from using                     48,653  (_merge==2)

    matched                             1,022
        not updated                     1,022  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(48,653 observations deleted)

. 
. assert inlist(_merge,1,3)

. 
. 
. 
. rename _merge _merge1

. 
. rename dist dist1

. 
. rename spatype1 spatype_temp

. 
. rename spatype2 spatype1

. 
. rename spatype_temp spatype2

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update

    Result                           # of obs.
    -----------------------------------------
    not matched                       499,463
        from master                   450,826  (_merge==1)
        from using                     48,637  (_merge==2)

    matched                             1,124
        not updated                     1,124  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(48,637 observations deleted)

. 
. assert inlist(_merge,1,3)

. 
. 
. 
. assert dist==. if dist1!=.

. 
. assert dist1==. if dist!=.

. 
. 
. 
. gen masterdist = min(dist1, dist)
(449,804 missing values generated)

. 
. replace masterdist=0 if spatype1==spatype2
(365,150 real changes made)

. 
. replace masterdist=1000 if spatype1=="" & spatype2!=""
(37,236 real changes made)

. 
. replace masterdist=1000 if spatype2=="" & spatype1!=""
(47,256 real changes made)

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", replace

. 
. keep patid timepoint spatype

. 
. split spatype, p(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. 
. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. 
. drop spatype

. 
. reshape long spatype, i(patid timepoint) j(count)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9039   ->   45195
Number of variables                   7   ->       4
j variable (5 values)                     ->   count
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. 
. keep spatype

. 
. duplicates drop

Duplicates in terms of all variables

(44,855 observations deleted)

. 
. 
. 
. save "E:\users\amy.mason\staph_carriage\Datasets\allspas", replace
file E:\users\amy.mason\staph_carriage\Datasets\allspas.dta saved

. 
. 
. 
. rename spatype spatype1

. 
. merge 1:m spatype1 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update

    Result                           # of obs.
    -----------------------------------------
    not matched                            28
        from master                        28  (_merge==1)
        from using                          0  (_merge==2)

    matched                            48,828
        not updated                    48,828  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
.  keep if _merge==1
(48,828 observations deleted)

. 
.  keep spatype1

. 
. rename spatype1 spatype2

. 
. merge 1:m spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update

    Result                           # of obs.
    -----------------------------------------
    not matched                        48,543
        from master                        27  (_merge==1)
        from using                     48,516  (_merge==2)

    matched                               312
        not updated                       312  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
.  keep if _merge==1
(48,828 observations deleted)

. 
.  keep spatype2

. 
.   rename spatype2 spatype

. 
.   drop if inlist(spatype, "", "contaminated")
(2 observations deleted)

. 
.  save "E:\users\amy.mason\staph_carriage\Datasets\missingfromBURPspas", replace
file E:\users\amy.mason\staph_carriage\Datasets\missingfromBURPspas.dta saved

. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", replace

. keep patid timepoint

. use "E:\users\amy.mason\Staph\raw_ruth_noresult.dta", clear
(Counts of each different spa type for each participant)

. keep patid

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. use "E:\users\sarahw\small\miller\riskfactors_baseline.dta", clear
(Counts of each different spa type for each participant)

. keep patif
variable patif not found
r(111);

. keep patid

. duplicates dop
illegal duplicates subcommand
r(198);

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. merge 1:m patid using  "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", update

    Result                           # of obs.
    -----------------------------------------
    not matched                            26
        from master                        26  (_merge==1)
        from using                          0  (_merge==2)

    matched                             9,039
        not updated                     9,039  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. list patid if _merge==1

      +-------+
      | patid |
      |-------|
 178. |   789 |
 179. |   798 |
 186. |   915 |
 188. |   920 |
 209. |   982 |
      |-------|
 210. |   983 |
 212. |   985 |
 234. |  1053 |
 241. |  1073 |
 243. |  1076 |
      |-------|
 308. |  1258 |
 310. |  1260 |
 383. |  1333 |
 444. |  1394 |
 456. |  2006 |
      |-------|
 474. |  2024 |
 477. |  2027 |
 478. |  2028 |
 500. |  2050 |
 511. |  2061 |
      |-------|
 523. |  2073 |
 526. |  2076 |
 546. |  2096 |
 558. |  2108 |
 566. |  2116 |
      |-------|
 569. |  2119 |
      +-------+

. 
. noi di _n(5) _dup(80) "=" _n "Burp distances" _n _dup(80) "=" 





================================================================================
Burp distances
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\cost_16_08.txt, delimiter(",", collapse) varnames(1) stripquote
> (yes) clear 
(4 vars, 49,141 obs)

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. 
. 
. * extract sample names

. 
. gen sample1= strpos( species1, "t")

. 
. assert sample1!=0 & sample1!=.

. 
. gen sub1= substr( species1, sample1,.)

. 
. drop sample1

. 
. gen sample1= strpos(sub1, " ")

. 
. gen subsub1 = sub1 if sample1==0
(49,141 missing values generated)

. 
. replace subsub1= substr(sub1,1, sample1-1) if sample1!=0
variable subsub1 was str1 now str6
(49,141 real changes made)

. 
. drop sample1

. 
. gen sample1= strpos(subsub1, " ")

. 
. assert sample1==0

. 
. drop sample1 sub1 species1

. 
. rename subsub1 spatype1

. 
. 
. 
. gen sample2= strpos( species2, "t")

. 
. assert sample2!=0 & sample2!=.

. 
. gen sub2= substr( species2, sample2,.)

. 
. drop sample2

. 
. gen sample2= strpos(sub2, " ")

. 
. gen subsub2 = sub2 if sample2==0
(49,141 missing values generated)

. 
. replace subsub2= substr(sub2,1, sample2-1) if sample2!=0
variable subsub2 was str1 now str6
(49,141 real changes made)

. 
. drop sample2

. 
. gen sample2= strpos(subsub2, " ")

. 
. assert sample2==0

. 
. drop sample2 sub2 species2

. 
. rename subsub2 spatype2

. 
. drop v4

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\BURP3", replace
(note: file E:\users\amy.mason\staph_carriage\Datasets\BURP3.dta not found)
file E:\users\amy.mason\staph_carriage\Datasets\BURP3.dta saved

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n "Burp distances" _n _dup(80) "=" 





================================================================================
Burp distances
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\cost_noexclusions_16_08.txt, delimiter(",", collapse) varnames(
> 1) stripquote(yes) clear 
file E:\users\amy.mason\staph_carriage\Inputs\cost_noexclusions_16_08.txt not found
r(601);

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. 
. 
. 
. 
. * extract sample names

. 
. gen sample1= strpos( species1, "t")
species1 not found
r(111);

. 
. assert sample1!=0 & sample1!=.
sample1 not found
r(111);

. 
. gen sub1= substr( species1, sample1,.)
sample1 not found
r(111);

. 
. drop sample1
variable sample1 not found
r(111);

. 
. gen sample1= strpos(sub1, " ")
sub1 not found
r(111);

. 
. gen subsub1 = sub1 if sample1==0
sub1 not found
r(111);

. 
. replace subsub1= substr(sub1,1, sample1-1) if sample1!=0
variable subsub1 not found
r(111);

. 
. drop sample1
variable sample1 not found
r(111);

. 
. gen sample1= strpos(subsub1, " ")
subsub1 not found
r(111);

. 
. assert sample1==0
sample1 not found
r(111);

. 
. drop sample1 sub1 species1
variable sample1 not found
r(111);

. 
. rename subsub1 spatype1
variable subsub1 not found
r(111);

. 
. 
. 
. gen sample2= strpos( species2, "t")
species2 not found
r(111);

. 
. assert sample2!=0 & sample2!=.
sample2 not found
r(111);

. 
. gen sub2= substr( species2, sample2,.)
sample2 not found
r(111);

. 
. drop sample2
variable sample2 not found
r(111);

. 
. gen sample2= strpos(sub2, " ")
sub2 not found
r(111);

. 
. gen subsub2 = sub2 if sample2==0
sub2 not found
r(111);

. 
. replace subsub2= substr(sub2,1, sample2-1) if sample2!=0
variable subsub2 not found
r(111);

. 
. drop sample2
variable sample2 not found
r(111);

. 
. gen sample2= strpos(subsub2, " ")
subsub2 not found
r(111);

. 
. assert sample2==0
sample2 not found
r(111);

. 
. drop sample2 sub2 species2
variable sample2 not found
r(111);

. 
. rename subsub2 spatype2
variable subsub2 not found
r(111);

. 
. drop v4
variable v4 not found
r(111);

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\BURP3", replace
file E:\users\amy.mason\staph_carriage\Datasets\BURP3.dta saved

. 
. noi di _n(5) _dup(80) "=" _n "Burp distances" _n _dup(80) "=" 





================================================================================
Burp distances
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\cost_16_08.txt, delimiter(",", collapse) varnames(1) stripquote
> (yes) clear 
(4 vars, 49,141 obs)

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. 
. 
. * extract sample names

. 
. gen sample1= strpos( species1, "t")

. 
. assert sample1!=0 & sample1!=.

. 
. gen sub1= substr( species1, sample1,.)

. 
. drop sample1

. 
. gen sample1= strpos(sub1, " ")

. 
. gen subsub1 = sub1 if sample1==0
(49,141 missing values generated)

. 
. replace subsub1= substr(sub1,1, sample1-1) if sample1!=0
variable subsub1 was str1 now str6
(49,141 real changes made)

. 
. drop sample1

. 
. gen sample1= strpos(subsub1, " ")

. 
. assert sample1==0

. 
. drop sample1 sub1 species1

. 
. rename subsub1 spatype1

. 
. 
. 
. gen sample2= strpos( species2, "t")

. 
. assert sample2!=0 & sample2!=.

. 
. gen sub2= substr( species2, sample2,.)

. 
. drop sample2

. 
. gen sample2= strpos(sub2, " ")

. 
. gen subsub2 = sub2 if sample2==0
(49,141 missing values generated)

. 
. replace subsub2= substr(sub2,1, sample2-1) if sample2!=0
variable subsub2 was str1 now str6
(49,141 real changes made)

. 
. drop sample2

. 
. gen sample2= strpos(subsub2, " ")

. 
. assert sample2==0

. 
. drop sample2 sub2 species2

. 
. rename subsub2 spatype2

. 
. drop v4

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\BURP3", replace
file E:\users\amy.mason\staph_carriage\Datasets\BURP3.dta saved

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n "Burp distances" _n _dup(80) "=" 





================================================================================
Burp distances
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\cost_noexclusions_16_08.txt, delimiter(",", collapse) varnames(
> 1) stripquote(yes) clear 
(4 vars, 56,953 obs)

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. 
. 
. 
. 
. * extract sample names

. 
. gen sample1= strpos( species1, "t")

. 
. assert sample1!=0 & sample1!=.

. 
. gen sub1= substr( species1, sample1,.)

. 
. drop sample1

. 
. gen sample1= strpos(sub1, " ")

. 
. gen subsub1 = sub1 if sample1==0
(56,953 missing values generated)

. 
. replace subsub1= substr(sub1,1, sample1-1) if sample1!=0
variable subsub1 was str1 now str6
(56,953 real changes made)

. 
. drop sample1

. 
. gen sample1= strpos(subsub1, " ")

. 
. assert sample1==0

. 
. drop sample1 sub1 species1

. 
. rename subsub1 spatype1

. 
. 
. 
. gen sample2= strpos( species2, "t")

. 
. assert sample2!=0 & sample2!=.

. 
. gen sub2= substr( species2, sample2,.)

. 
. drop sample2

. 
. gen sample2= strpos(sub2, " ")

. 
. gen subsub2 = sub2 if sample2==0
(56,953 missing values generated)

. 
. replace subsub2= substr(sub2,1, sample2-1) if sample2!=0
variable subsub2 was str1 now str6
(56,953 real changes made)

. 
. drop sample2

. 
. gen sample2= strpos(subsub2, " ")

. 
. assert sample2==0

. 
. drop sample2 sub2 species2

. 
. rename subsub2 spatype2

. 
. drop v4

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\BURP4", replace
(note: file E:\users\amy.mason\staph_carriage\Datasets\BURP4.dta not found)
file E:\users\amy.mason\staph_carriage\Datasets\BURP4.dta saved

. merge 1:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\BURP3", update

    Result                           # of obs.
    -----------------------------------------
    not matched                        53,792
        from master                    30,802  (_merge==1)
        from using                     22,990  (_merge==2)

    matched                            26,151
        not updated                    26,151  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. rename _merge m1

. rename spatype1 spatype

. rename spatype2 spatype1

. rename spatype spatype2

. merge 1:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\BURP3", update

    Result                           # of obs.
    -----------------------------------------
    not matched                        83,104
        from master                    56,953  (_merge==1)
        from using                     26,151  (_merge==2)

    matched                            22,990
        not updated                    22,990  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. rename _merge m2

. tab m1 m2, m

                      |                m2
                   m1 | master on  using onl  matched ( |     Total
----------------------+---------------------------------+----------
      master only (1) |     7,812          0     22,990 |    30,802 
       using only (2) |    22,990          0          0 |    22,990 
          matched (3) |    26,151          0          0 |    26,151 
                    . |         0     26,151          0 |    26,151 
----------------------+---------------------------------+----------
                Total |    56,953     26,151     22,990 |   106,094 


. use  "E:\users\amy.mason\staph_carriage\Datasets\BURP4", clear

. display _N
56953

. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\BURP3", update

    Result                           # of obs.
    -----------------------------------------
    not matched                        53,792
        from master                    30,802  (_merge==1)
        from using                     22,990  (_merge==2)

    matched                            26,151
        not updated                    26,151  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(22,990 observations deleted)

. 
. assert inlist(_merge,1,3)

. 
. 
. 
. rename _merge _merge1

. 
. rename dist dist1

. 
. rename spatype1 spatype_temp

. 
. rename spatype2 spatype1

. 
. rename spatype_temp spatype2

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\BURP3", update

    Result                           # of obs.
    -----------------------------------------
    not matched                        60,114
        from master                    33,963  (_merge==1)
        from using                     26,151  (_merge==2)

    matched                            22,990
        not updated                    22,990  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(26,151 observations deleted)

. 
. assert inlist(_merge,1,3)

. tab _mer*, m

                      |        _merge
              _merge1 | master on  matched ( |     Total
----------------------+----------------------+----------
      master only (1) |     7,812     22,990 |    30,802 
          matched (3) |    26,151          0 |    26,151 
----------------------+----------------------+----------
                Total |    33,963     22,990 |    56,953 


. use  "E:\users\amy.mason\staph_carriage\Datasets\BURP4", clear

. 
. 
. 
. * compare to non-excluded distance

. 
. rename dist distEX

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\BURP3", update

    Result                           # of obs.
    -----------------------------------------
    not matched                        53,792
        from master                    30,802  (_merge==1)
        from using                     22,990  (_merge==2)

    matched                            26,151
        not updated                    26,151  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(22,990 observations deleted)

. 
. assert inlist(_merge,1,3)

. assert dist==distEX if dist!=.

. 
. rename _merge _merge1

. 
. rename dist dist1

. 
. rename spatype1 spatype_temp

. 
. rename spatype2 spatype1

. 
. rename spatype_temp spatype2

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\BURP3", update

    Result                           # of obs.
    -----------------------------------------
    not matched                        60,114
        from master                    33,963  (_merge==1)
        from using                     26,151  (_merge==2)

    matched                            22,990
        not updated                    22,990  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. drop if _merge==2
(26,151 observations deleted)

. 
. assert inlist(_merge,1,3)

. tab _m*, m

                      |        _merge
              _merge1 | master on  matched ( |     Total
----------------------+----------------------+----------
      master only (1) |     7,812     22,990 |    30,802 
          matched (3) |    26,151          0 |    26,151 
----------------------+----------------------+----------
                Total |    33,963     22,990 |    56,953 


.  assert dist==distEX if dist!=.

. sort _m*

. noi di _n(5) _dup(80) "=" _n "Clonal colonies" _n _dup(80) "=" 





================================================================================
Clonal colonies
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\Spa-typing_burp_16.08.2016.csv, delimiter(";:", collapse) varna
> mes(1) clear 
(5 vars, 338 obs)

. 
. drop v5

. 
. rename v4 CCname

. 
. rename spacc CC

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\CC", replace
file E:\users\amy.mason\staph_carriage\Datasets\CC.dta saved

. drop taxa

. 
. noi di _n(5) _dup(80) "=" _n "Burp distances" _n _dup(80) "=" 





================================================================================
Burp distances
================================================================================

. 
. import delimited E:\users\amy.mason\staph_carriage\Inputs\cost_noexclusions_16_08.txt, delimiter(",", collapse) varnames(
> 1) stripquote(yes) clear 
(4 vars, 56,953 obs)

. 
.  noi di "DROP STRAIGHT DUPLICATES" 
DROP STRAIGHT DUPLICATES

. 
. noi bysort *: drop if _n>1
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. save  "E:\users\amy.mason\staph_carriage\Datasets\BURP", replace
file E:\users\amy.mason\staph_carriage\Datasets\BURP.dta saved

. 
. 
. 
. 
. 
. cd "E:\users\amy.mason\staph_carriage\Programs"
E:\users\amy.mason\staph_carriage\Programs

. 
. cd "E:\users\amy.mason\staph_carriage\Programs"
E:\users\amy.mason\staph_carriage\Programs

. 
. 
. 
. set more off

. 
. * data input

. 
. run getdata.do
