----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\users\amy.mason\Pipeline_27_07_2016\Datasets\clean.log
  log type:  text
 opened on:  14 Sep 2016, 16:13:42

. 
. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on 14 Sep 2016 16:13:42

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Combine all predictive sets" _n _dup(80) "="





================================================================================
 1 Combine all predictive sets
================================================================================

. 
. 
. 
. 
. 
. ****** combine the 3 sets

. 
. noi di "combine"
combine

. 
. use pipeline_data_gf, clear

. 
. append using pipeline_data_tw.dta, force
(note: variable comments was str7, now str68 to accommodate using data's values)
(note: variable value was str27, now str34 to accommodate using data's values)

. 
. append using pipeline_data_z2.dta, force
(note: variable comments was str68, now str187 to accommodate using data's values)

. 
. replace site = lower(site)
(288,639 real changes made)

. 
. noi di _N " results"
393727 results

. 
. bysort site: gen tab=1 if _n==1
(393,595 missing values generated)

. 
. summ tab 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |        132           1           0          1          1

. 
. noi di "on " r(sum) " sites"
on 132 sites

. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      2,778        0.71        0.71
      aacaaphd |      1,429        0.36        1.07
    aaddaph4ia |      4,207        1.07        2.14
    aadeant6ia |      4,207        1.07        3.21
          acrb |      2,778        0.71        3.91
          acrc |      2,778        0.71        4.62
          acrd |      2,778        0.71        5.32
allelicprofile |      1,389        0.35        5.67
    ant9_iaspc |      2,778        0.71        6.38
    ant9_ibspc |      2,778        0.71        7.09
        ant9ia |      1,429        0.36        7.45
        ant9ib |      1,429        0.36        7.81
        aph2ic |      4,207        1.07        8.88
  apha3aph3iii |      4,207        1.07        9.95
          arca |      4,206        1.07       11.02
          arcb |      1,428        0.36       11.38
          arcc |      1,429        0.36       11.74
          arcd |      1,428        0.36       12.11
          blaz |      4,207        1.07       13.17
           cat |      4,207        1.07       14.24
          ccra |      1,429        0.36       14.61
        ccra_1 |      2,778        0.71       15.31
        ccra_2 |      2,778        0.71       16.02
        ccra_3 |      2,778        0.71       16.72
        ccra_4 |      2,778        0.71       17.43
          ccrb |      1,427        0.36       17.79
        ccrb_1 |      2,778        0.71       18.50
        ccrb_2 |      2,778        0.71       19.20
        ccrb_3 |      2,778        0.71       19.91
        ccrb_4 |      2,778        0.71       20.61
        ccrb_6 |      2,778        0.71       21.32
        ccrc_a |      2,778        0.71       22.02
        ccrc_b |      2,778        0.71       22.73
        ccrc_c |      2,778        0.71       23.43
         ccrca |      1,429        0.36       23.80
         ccrcb |      1,427        0.36       24.16
         ccrcc |      1,428        0.36       24.52
           cfr |      4,207        1.07       25.59
           chp |      4,207        1.07       26.66
         dfr_a |      2,778        0.71       27.37
         dfr_c |      2,778        0.71       28.07
         dfr_d |      2,778        0.71       28.78
         dfr_g |      2,778        0.71       29.48
         dfr_k |      2,778        0.71       30.19
          dfra |      1,429        0.36       30.55
          dfrb |      4,206        1.07       31.62
          dfrc |      1,429        0.36       31.98
          dfrd |      1,429        0.36       32.34
          dfrg |      1,429        0.36       32.71
          dfrk |      1,429        0.36       33.07
          erma |      1,429        0.36       33.43
        erma_1 |      2,778        0.71       34.14
        erma_2 |      2,778        0.71       34.84
          ermb |      4,207        1.07       35.91
          ermc |      4,207        1.07       36.98
          ermt |      4,207        1.07       38.05
          ermy |      4,207        1.07       39.12
           eta |      4,207        1.07       40.19
           etb |      4,205        1.07       41.26
           etd |      4,206        1.07       42.32
         fus_b |      2,778        0.71       43.03
         fus_c |      2,778        0.71       43.73
          fusa |      4,206        1.07       44.80
          fusb |      1,429        0.36       45.17
          fusc |      1,429        0.36       45.53
          grla |      4,206        1.07       46.60
          gyra |      4,205        1.07       47.67
         ile_s |        491        0.12       47.79
          iles |      2,287        0.58       48.37
          isab |      4,207        1.07       49.44
         lnu_a |      2,778        0.71       50.14
         lnu_b |      2,778        0.71       50.85
          lnua |      1,429        0.36       51.21
          lnub |      1,429        0.36       51.58
           luk |      1,429        0.36       51.94
          lukm |      4,207        1.07       53.01
         lukmf |      4,206        1.07       54.08
        lukpvf |      4,207        1.07       55.14
        lukpvs |      4,207        1.07       56.21
          meca |      4,207        1.07       57.28
          mecc |      4,207        1.07       58.35
          mlst |      1,389        0.35       58.70
          mphc |      4,207        1.07       59.77
          msra |      4,207        1.07       60.84
          mupa |      4,207        1.07       61.91
          mupb |      4,207        1.07       62.98
         qac_a |      2,778        0.71       63.68
         qac_b |      2,778        0.71       64.39
      qac_csmr |      2,778        0.71       65.09
          qaca |      1,429        0.36       65.46
          qacb |      1,429        0.36       65.82
       qaccsmr |      1,429        0.36       66.18
          rpob |      4,206        1.07       67.25
           sak |      4,207        1.07       68.32
          sasx |      4,207        1.07       69.39
          sat4 |      4,207        1.07       70.46
           scn |      4,207        1.07       71.52
           sea |      1,428        0.36       71.89
         sea_1 |      2,778        0.71       72.59
         sea_2 |      2,778        0.71       73.30
           seb |      4,206        1.07       74.37
           sec |      4,206        1.07       75.43
           sed |      4,206        1.07       76.50
           see |      4,207        1.07       77.57
           seg |      4,207        1.07       78.64
           seh |      1,429        0.36       79.00
         seh_1 |      2,778        0.71       79.71
         seh_2 |      2,778        0.71       80.41
           sei |      4,207        1.07       81.48
           sej |      4,207        1.07       82.55
          selr |      4,207        1.07       83.62
           sep |      4,207        1.07       84.69
           seu |      1,429        0.36       85.05
         seu_1 |      2,778        0.71       85.76
         seu_2 |      2,778        0.71       86.46
            st |      1,389        0.35       86.81
           str |      4,207        1.07       87.88
          tetk |      4,207        1.07       88.95
          tetl |      4,207        1.07       90.02
          tetm |      4,207        1.07       91.09
          teto |      4,207        1.07       92.16
         tsst1 |      4,207        1.07       93.23
         van_a |      2,778        0.71       93.93
         van_b |      2,778        0.71       94.64
         van_c |      2,778        0.71       95.34
          vana |      1,429        0.36       95.71
          vanb |      1,429        0.36       96.07
          vanc |      1,429        0.36       96.43
          vgaa |      4,207        1.07       97.50
        vgaalc |      1,429        0.36       97.86
          vgab |      4,207        1.07       98.93
          vgba |      4,207        1.07      100.00
---------------+-----------------------------------
         Total |    393,727      100.00

. 
. drop tab

. 
. bysort sample: gen tab=1 if _n==1
(392,298 missing values generated)

. 
. summ tab

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |      1,429           1           0          1          1

. 
. noi di "from " r(sum) " samples"
from 1429 samples

. 
. tab set if tab==1

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
 Collindale |        397       27.78       27.78
  Oxford491 |        492       34.43       62.21
  Oxford501 |        540       37.79      100.00
------------+-----------------------------------
      Total |      1,429      100.00

. 
. drop tab

. 
. 
. 
. save pipeline_predict_raw, replace
file pipeline_predict_raw.dta saved

. 
. 
. 
. ***********************************************************

. 
. * 1) Remove samples that are contaminated for all methods

. 
. *********************************************************

. 
. use pipeline_predict_raw, clear

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Remove samples that were contaminated for all methods" _n _dup(80) "="





================================================================================
 1 Remove samples that were contaminated for all methods
================================================================================

. 
. 
. 
. use pipeline_predict_raw, clear

. 
. preserve

. 
. reshape wide value  comment, i(set sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   393727   ->  185868
Number of variables                   6   ->       9
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
                               comments   ->   commentsgenefinder commentstypewriter commentszam
-----------------------------------------------------------------------------

. 
. noi display _N " sample sites"
185868 sample sites

. 
. restore

. 
. gen contam=.
(393,727 missing values generated)

. 
. replace contam=1 if inlist(sample,"C00012813", "C00001215", "C00001249", "C00012746", "C00012791")
(1,405 real changes made)

. 
. replace contam=1 if inlist(sample,"H113120068-138-1","H121000461-388-2","H131100031-408-2","H111840168-459-2","H111200061-196-2"
> )
(1,405 real changes made)

. 
. preserve

. 
. keep if contam==1
(390,917 observations deleted)

. 
. reshape wide value  comment, i(set sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     2810   ->    1315
Number of variables                   7   ->      10
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
                               comments   ->   commentsgenefinder commentstypewriter commentszam
-----------------------------------------------------------------------------

. 
. * count

. 
. bysort sample: gen count=1 if _n==1
(1,305 missing values generated)

. 
. summ contam if count==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      contam |         10           1           0          1          1

. 
. noi di r(sum) " samples contaminated"
10 samples contaminated

. 
. 
. 
. keep sample set site value* comment* 

. 
. compress
  variable sample was str20 now str16
  variable commentsgenefinder was str187 now str7
  variable valuegenefinder was str34 now str18
  variable commentstypewriter was str187 now str31
  variable valuetypewriter was str34 now str10
  variable commentszam was str187 now str174
  variable valuezam was str34 now str6
  (553,615 bytes saved)

. 
. sort sample site

. 
. order sample site value* comment*

. 
. 
. 
. noi save problem_samples, replace
file problem_samples.dta saved

. 
. 
. 
. 
. 
. restore

. 
. summ contam

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      contam |      2,810           1           0          1          1

. 
. noi di r(sum) " values for contaminated samples dropped from study"
2810 values for contaminated samples dropped from study

. 
. noi drop if contam==1
(2,810 observations deleted)

. 
. drop contam

. 
. compress
  (0 bytes saved)

. 
. save pipeline_noncontam, replace
file pipeline_noncontam.dta saved

. 
. *****************************************************

. 
. * clean site names

. 
. ******************************************************

. 
. use pipeline_noncontam, clear

. 
. noi di _n(5) _dup(80) "=" _n "consolidate names/ spelling errors for various sites" _n _dup(80) "=" 





================================================================================
consolidate names/ spelling errors for various sites
================================================================================

. 
. 
. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(2,758 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(2,758 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(1,419 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(8,274 real changes made)

. 
. replace site = "mlst" if site=="st"
(1,379 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(2,758 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(2,758 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(2,758 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "dfr")
(13,790 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "fus")
(5,516 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "ile")
(486 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "lnu")
(5,516 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "qac")
(8,274 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "van")
(8,274 real changes made)

. 
. 
. 
. 
. 
. compress
  (0 bytes saved)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. 
. 
. 
. 
. * some sites split into numbers variants; remerge

. 
. 
. 
. noi di "combining numbered variants into single sites"
combining numbered variants into single sites

. 
. 
. 
. use temp, clear

. 
. 
. 
. drop comments 

. 
. keep if strpos(site, "erma") | strpos(site,"ccr") | strpos(site, "se")
(285,402 observations deleted)

. 
. drop if inlist(site, "ccrcb", "ccrca", "ccrcc", "seb", "sec", "sed")
(25,056 observations deleted)

. 
. reshape wide value, i(set sample method) j(site) string
(note: j = ccra ccra_1 ccra_2 ccra_3 ccra_4 ccrb ccrb_1 ccrb_2 ccrb_3 ccrb_4 ccrb_6 erma erma_1 erma_2 sea sea_1 sea_2 see seg seh
>  seh_1 seh_2 sei sej selr sep seu seu_1 seu_2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    80459   ->    4177
Number of variables                   5   ->      32
j variable (29 values)             site   ->   (dropped)
xij variables:
                                  value   ->   valueccra valueccra_1 ... valueseu_2
-----------------------------------------------------------------------------

. 
. 
. 
. *erma

. 
. replace valueerma="A" if valueerma_1=="A" & valueerma_2=="A" &valueerma==""
(2,465 real changes made)

. 
. replace valueerma="P" if (valueerma_1=="P" | valueerma_2=="P" ) & valueerma==""
(293 real changes made)

. 
. assert valueerma!=""

. 
. drop valueerma_1 valueerma_2

. 
. 
. 
. *ccra

. 
. replace valueccra="A" if valueccra=="" & valueccra_1=="A" & valueccra_2=="A" & valueccra_3=="A" & valueccra_4=="A"
(2,025 real changes made)

. 
. replace valueccra="P" if valueccra=="" & (valueccra_1=="P"|  valueccra_2=="P"| valueccra_3=="P"| valueccra_4=="P")
(733 real changes made)

. 
. assert valueccra!=""

. 
. drop valueccra_*

. 
. 
. 
. * ccrb

. 
. replace valueccrb="A" if valueccrb=="" & valueccrb_1=="A" & valueccrb_2=="A" & valueccrb_3=="A" & valueccrb_4=="A" & valueccrb_6
> =="A" 
(2,054 real changes made)

. 
. replace valueccrb="P" if valueccrb=="" & (valueccrb_1=="P" | valueccrb_2=="P"|valueccrb_3=="P"|valueccrb_4=="P"|valueccrb_6=="P"
>  )
(704 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueccrb!="" if !strpos(sample, "C0001165")

. 
. drop valueccrb_*

. 
. 
. 
. * sea

. 
. replace valuesea="A" if valuesea_1=="A" & valuesea_2=="A"  & valuesea=="" 
(2,165 real changes made)

. 
. replace valuesea="P" if valuesea_1=="P" | valuesea_2=="P"  & valuesea=="" 
(593 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valuesea!=""  if !strpos(sample, "C0001165")

. 
. drop valuesea_*

. 
. 
. 
. *seh

. 
. replace valueseh="A" if valueseh_1=="A" & valueseh_2=="A"  & valueseh=="" 
(2,488 real changes made)

. 
. replace valueseh="P" if valueseh_1=="P" | valueseh_2=="P"  & valueseh=="" 
(270 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseh!=""  if !strpos(sample, "C0001165")

. 
. drop valueseh_*

. 
. 
. 
. *seu

. 
. replace valueseu="A" if valueseu_1=="A" & valueseu_2=="A" &  valueseu=="" 
(1,251 real changes made)

. 
. replace valueseu="P" if valueseu_1=="P" | valueseu_2=="P"  & valueseu=="" 
(1,507 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseu!=""  if !strpos(sample, "C0001165")

. 
. drop valueseu_*

. 
. 
. 
. reshape long
(note: j = ccra ccrb erma sea see seg seh sei sej selr sep seu)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     4177   ->   50124
Number of variables                  15   ->       5
j variable (12 values)                    ->   site
xij variables:
       valueccra valueccrb ... valueseu   ->   value
-----------------------------------------------------------------------------

. 
. rename value cleanvalue

. 
. 
. 
. merge 1:1 set sample method site using temp, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       373,895
        from master                    16,551  (_merge==1)
        from using                    357,344  (_merge==2)

    matched                            33,573
        not updated                    33,573  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. assert _merge!=4

. 
. assert _merge!=5

. 
. noi assert value == cleanvalue if _merge==3

. 
. noi tab site if _merge ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          ccra |      2,758       16.66       16.66
          ccrb |      2,760       16.68       33.34
          erma |      2,758       16.66       50.00
           sea |      2,759       16.67       66.67
           seh |      2,758       16.66       83.34
           seu |      2,758       16.66      100.00
---------------+-----------------------------------
         Total |     16,551      100.00

. 
. replace value = cleanvalue if value==""
(16,548 real changes made)

. 
. noi tab site if strpos(site, "_")

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
        ccra_1 |      2,758        5.88        5.88
        ccra_2 |      2,758        5.88       11.76
        ccra_3 |      2,758        5.88       17.65
        ccra_4 |      2,758        5.88       23.53
        ccrb_1 |      2,758        5.88       29.41
        ccrb_2 |      2,758        5.88       35.29
        ccrb_3 |      2,758        5.88       41.18
        ccrb_4 |      2,758        5.88       47.06
        ccrb_6 |      2,758        5.88       52.94
        erma_1 |      2,758        5.88       58.82
        erma_2 |      2,758        5.88       64.71
         sea_1 |      2,758        5.88       70.59
         sea_2 |      2,758        5.88       76.47
         seh_1 |      2,758        5.88       82.35
         seh_2 |      2,758        5.88       88.24
         seu_1 |      2,758        5.88       94.12
         seu_2 |      2,758        5.88      100.00
---------------+-----------------------------------
         Total |     46,886      100.00

. 
. drop if strpos(site, "_")
(46,886 observations deleted)

. 
. noi tab site if _merge==2 

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,177        1.35        1.35
    aaddaph4ia |      4,177        1.35        2.69
    aadeant6ia |      4,177        1.35        4.04
allelicprofile |      1,379        0.44        4.48
        ant9ia |      4,177        1.35        5.83
        ant9ib |      4,177        1.35        7.17
        aph2ic |      4,177        1.35        8.52
  apha3aph3iii |      4,177        1.35        9.86
          arca |      4,176        1.35       11.21
          arcb |      4,176        1.35       12.55
          arcc |      4,177        1.35       13.90
          arcd |      4,176        1.35       15.24
          blaz |      4,177        1.35       16.59
           cat |      4,177        1.35       17.93
         ccrca |      4,177        1.35       19.28
         ccrcb |      4,175        1.34       20.62
         ccrcc |      4,176        1.35       21.97
           cfr |      4,177        1.35       23.31
           chp |      4,177        1.35       24.66
          dfra |      4,177        1.35       26.01
          dfrb |      4,176        1.35       27.35
          dfrc |      4,177        1.35       28.70
          dfrd |      4,177        1.35       30.04
          dfrg |      4,177        1.35       31.39
          dfrk |      4,177        1.35       32.73
          ermb |      4,177        1.35       34.08
          ermc |      4,177        1.35       35.42
          ermt |      4,177        1.35       36.77
          ermy |      4,177        1.35       38.11
           eta |      4,177        1.35       39.46
           etb |      4,175        1.34       40.80
           etd |      4,176        1.35       42.15
          fusa |      4,176        1.35       43.49
          fusb |      4,177        1.35       44.84
          fusc |      4,177        1.35       46.19
          grla |      4,176        1.35       47.53
          gyra |      4,175        1.34       48.88
          iles |      2,758        0.89       49.76
          isab |      4,177        1.35       51.11
          lnua |      4,177        1.35       52.45
          lnub |      4,177        1.35       53.80
           luk |      1,419        0.46       54.26
          lukm |      4,177        1.35       55.60
         lukmf |      4,176        1.35       56.95
        lukpvf |      4,177        1.35       58.29
        lukpvs |      4,177        1.35       59.64
          meca |      4,177        1.35       60.98
          mecc |      4,177        1.35       62.33
          mlst |      2,758        0.89       63.22
          mphc |      4,177        1.35       64.56
          msra |      4,177        1.35       65.91
          mupa |      4,177        1.35       67.25
          mupb |      4,177        1.35       68.60
          qaca |      4,177        1.35       69.94
          qacb |      4,177        1.35       71.29
       qaccsmr |      4,177        1.35       72.64
          rpob |      4,176        1.35       73.98
           sak |      4,177        1.35       75.33
          sasx |      4,177        1.35       76.67
          sat4 |      4,177        1.35       78.02
           scn |      4,177        1.35       79.36
           seb |      4,176        1.35       80.71
           sec |      4,176        1.35       82.05
           sed |      4,176        1.35       83.40
           str |      4,177        1.35       84.74
          tetk |      4,177        1.35       86.09
          tetl |      4,177        1.35       87.43
          tetm |      4,177        1.35       88.78
          teto |      4,177        1.35       90.12
         tsst1 |      4,177        1.35       91.47
          vana |      4,177        1.35       92.82
          vanb |      4,177        1.35       94.16
          vanc |      4,177        1.35       95.51
          vgaa |      4,177        1.35       96.85
        vgaalc |      1,419        0.46       97.31
          vgab |      4,177        1.35       98.65
          vgba |      4,177        1.35      100.00
---------------+-----------------------------------
         Total |    310,458      100.00

. 
. drop _merge cleanvalue comment

. 
.  
. 
. 
. 
. reshape wide value , i(sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   360582   ->  126152
Number of variables                   5   ->       6
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
-----------------------------------------------------------------------------

. 
. noi display _N " sample sites"
126152 sample sites

. 
. bysort sample: gen count1=1 if _n==1
(124,733 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,419           1           0          1          1

. 
. noi di r(sum) " samples"
1419 samples

. 
. bysort site: gen count2=1 if _n==1
(126,063 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         89           1           0          1          1

. 
. noi di r(sum) " sites"
89 sites

. 
. drop count*

. 
. 
. 
. save temp2, replace
file temp2.dta saved

. 
. 
. 
. 
. 
. **************************************************

. 
. * SITE TYPES

. 
. ***************************************************

. 
. use temp2, clear

. 
. 
. 
. gen type = "mlst"  if inlist(site, "mlst")
(124,773 missing values generated)

. 
. 
. 
. replace type = "virulence" if inlist(site, "arca","arcb", "arcc", "arcd", "sasx")
variable type was str4 now str9
(7,092 real changes made)

. 
. replace type = "virulence" if inlist(site, "sea", "sea1", "sea2", "seb", "sec", "sed" )
(5,673 real changes made)

. 
. replace type = "virulence" if inlist(site, "seh2", "sei", "sej", "selr", "sep","seu", "seu1", "seu2")
(7,095 real changes made)

. 
. replace type = "virulence" if inlist(site, "eta", "etb", "etd", "chp", "sak", "scn", "lukpvf" )
(9,930 real changes made)

. 
. replace type = "virulence" if inlist(site, "luk", "lukm", "lukmf", "lukpvs", "tsst1")
(7,094 real changes made)

. 
. replace type = "virulence" if inlist(site, "see", "seg", "seh", "seh1" )
(4,257 real changes made)

. 
. 
. 
. 
. 
. replace type = "ccr" if strpos(site, "ccr")==1
(7,092 real changes made)

. 
. 
. 
. replace type = "Chromosomal Resistance" if inlist(site, "iles", "gyra", "grla", "dfrb", "fusa", "rpob")
variable type was str9 now str22
(8,468 real changes made)

. 
. 
. 
. 
. 
. replace type = "Aquired Resistance"  if inlist(site, "blaz", "meca", "mecc", "aac6aph2" )
(5,676 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"aaddaph4ia","aadeant6ia", "ant9ia", "ant9ib","aph2ic", "apha3aph3iii" )
(8,514 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "str", "fusb", "fusc", "vana", "vanb", "vanc")
(8,514 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"lnua", "lnub", "isab", "vgaa", "vgab", "vgba","erma1", "erma2", "erma")
(9,933 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "ermb", "ermc", "ermy", "ermt", "msra", "mphc", "mupa", "mupb")
(11,352 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "sat4", "tetk", "tetl", "tetm", "teto", "dfra", "dfrc", "dfrd")
(11,352 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "dfrg", "dfrk", "cfr", "cat", "qaca", "qacb", "qaccsmr")
(9,933 real changes made)

. 
. 
. 
. 
. 
. 
. 
. * Summary 

. 
. noi display _N " sample sites"
126152 sample sites

. 
. noi tab type

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |     65,274       52.92       52.92
Chromosomal Resistance |      8,468        6.86       59.78
                   ccr |      7,092        5.75       65.53
                  mlst |      1,379        1.12       66.65
             virulence |     41,141       33.35      100.00
-----------------------+-----------------------------------
                 Total |    123,354      100.00

. 
. bysort sample: gen count1=1 if _n==1
(124,733 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,419           1           0          1          1

. 
. noi di r(sum) " samples"
1419 samples

. 
. bysort site: gen count2=1 if _n==1
(126,063 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         89           1           0          1          1

. 
. noi di r(sum) " sites"
89 sites

. 
. noi tab type if count2==1, m

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                       |          2        2.25        2.25
    Aquired Resistance |         46       51.69       53.93
Chromosomal Resistance |          6        6.74       60.67
                   ccr |          5        5.62       66.29
                  mlst |          1        1.12       67.42
             virulence |         29       32.58      100.00
-----------------------+-----------------------------------
                 Total |         89      100.00

. 
. noi tab site if type==""

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379       49.29       49.29
        vgaalc |      1,419       50.71      100.00
---------------+-----------------------------------
         Total |      2,798      100.00

. 
. drop count*

. 
. 
. 
. save temp3, replace
file temp3.dta saved

. 
. 
. 
. 
. 
. **********************

. 
. *2) LOOK AT MISSING DATA BETWEEN METHODS

. 
. ****************************************************

. 
. noi di _n(5) _dup(80) "=" _n " 2 Missing data between methods" _n _dup(80) "="





================================================================================
 2 Missing data between methods
================================================================================

. 
. 
. 
. * how many values are missing

. 
. use temp3, clear

. 
. 
. 
. * create absence markers

. 
. gen  zbyte=( valuezam!="")

. 
. gen  tbyte=( valuetypewriter !="")

. 
. gen  gbyte=( valuegenefinder   !="")

. 
. gen new= string( tbyte ) + string(zbyte) + string(gbyte)

. 
. replace new ="Phenotype" if type=="Phenotype"
(0 real changes made)

. 
. noi di "sample-sites missing values - key (typewriter mykrobe genefinder)"
sample-sites missing values - key (typewriter mykrobe genefinder)

. 
. table new

----------------------
      new |      Freq.
----------+-----------
      000 |        171
      001 |      1,379
      010 |      6,008
      101 |      8,928
      111 |    109,666
----------------------

. 
. 
. 
. 
. 
. *000

. 
. summ zbyte if new=="000"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |        171           0           0          0          0

. 
. noi di r(N) " not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below"
171 not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below

. 
. 
. 
. 
. 
. *010

. 
. summ zbyte if new== "010"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      6,008           1           0          1          1

. 
. noi di r(N) " Called only by mykrobe"
6008 Called only by mykrobe

. 
. * vgaalc

. 
. noi tab site new if inlist(site, "vgaalc"), m

               |    new
          site |       010 |     Total
---------------+-----------+----------
        vgaalc |     1,419 |     1,419 
---------------+-----------+----------
         Total |     1,419 |     1,419 


. 
. summ zbyte if inlist(site, "vgaalc")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. 
. noi di r(N) " vgaalc only supplied by mykrobe, drop from database"
1419 vgaalc only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "vgaalc")
(1,419 observations deleted)

. 
. noi di _N " sample sites remaining" 
124733 sample sites remaining

. 
. * luk

. 
. noi tab site new if strpos(site, "luk"), m

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
           luk |     1,419          0 |     1,419 
          lukm |        40      1,379 |     1,419 
         lukmf |        39      1,379 |     1,418 
        lukpvf |        40      1,379 |     1,419 
        lukpvs |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,578      5,516 |     7,094 


. 
. summ zbyte if inlist(site, "luk")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. 
. noi di r(N) " luk only supplied by mykrobe, drop from database"
1419 luk only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "luk")
(1,419 observations deleted)

. 
. noi di _N " sample sites remaining" 
123314 sample sites remaining

. 
. 
. 
. * samples not in other sets

. 
. list sample if new=="010", local(list)
option local() not allowed
r(198);

. 
. noi tab sample new if strpos("`list'", sample)
no observations

. 
. bysort sample: gen count =1 if _n==1
(121,895 missing values generated)

. 
. summ zbyte if strpos("`list'", sample) & count==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |          0

. 
. noi di r(N) " samples are only processed by mykrobe - drop from comparision set"
0 samples are only processed by mykrobe - drop from comparision set

. 
. summ zbyte if strpos("`list'", sample) 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |          0

. 
. noi di r(N) " sample sites affected"
0 sample sites affected

. 
. drop if strpos("`list'", sample)
(0 observations deleted)

. 
. drop count 

. 
. 
. 
. *001

. 
. summ zbyte if new =="001"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,379           0           0          0          0

. 
. noi di r(N) "Called only by typewriter"
1379Called only by typewriter

. 
. noi di "sites in sample-sites only supplied by typewriter"
sites in sample-sites only supplied by typewriter

. 
. noi tab site if new =="001"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379      100.00      100.00
---------------+-----------------------------------
         Total |      1,379      100.00

. 
. * allelicprofile - drop

. 
. noi tab site new if inlist(site, "allelicprofile"), m

               |    new
          site |       001 |     Total
---------------+-----------+----------
allelicprofile |     1,379 |     1,379 
---------------+-----------+----------
         Total |     1,379 |     1,379 


. 
. summ zbyte if inlist(site, "allelicprofile")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,379           0           0          0          0

. 
. noi di r(N) " allelicprofile only supplied by typewriter, drop from database"
1379 allelicprofile only supplied by typewriter, drop from database

. 
. noi drop if inlist(site, "allelicprofile")
(1,379 observations deleted)

. 
. noi di _N " sample sites remaining" 
121935 sample sites remaining

. 
. assert new!="001"

. 
. 
. 
. 
. 
. 
. 
. * 101

. 
. summ zbyte if new =="101"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      8,928           0           0          0          0

. 
. noi di r(N) " no value in mykrobe, eg fusa"
8928 no value in mykrobe, eg fusa

. 
. noi tab site if new=="101"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          dfrb |      1,294       14.49       14.49
          fusa |      1,297       14.53       29.02
          grla |      1,074       12.03       41.05
          gyra |      1,157       12.96       54.01
          iles |      1,379       15.45       69.46
          mlst |      1,379       15.45       84.90
          rpob |      1,348       15.10      100.00
---------------+-----------------------------------
         Total |      8,928      100.00

. 
. noi tab valuezam if site=="fusa"

                         zam value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                           114:P-H |          2        2.22        2.22
                           326:T-I |          1        1.11        3.33
                   326:T-I 468:E-V |          1        1.11        4.44
                           404:P-L |          1        1.11        5.56
                           404:P-Q |          4        4.44       10.00
                           406:P-L |          4        4.44       14.44
                           452:G-C |          2        2.22       16.67
                   452:G-C 453:M-I |          1        1.11       17.78
                           452:G-S |          2        2.22       20.00
                           453:M-I |          5        5.56       25.56
                   453:M-I 464:R-S |          1        1.11       26.67
                           457:H-Q |          1        1.11       27.78
                           457:H-Y |          6        6.67       34.44
                           461:L-F |          1        1.11       35.56
                   461:L-F 404:P-L |          1        1.11       36.67
                           461:L-K |         23       25.56       62.22
                   461:L-K 326:T-I |          1        1.11       63.33
                           461:L-S |         17       18.89       82.22
                           464:R-H |          1        1.11       83.33
                           464:R-S |          5        5.56       88.89
                            90:V-I |          7        7.78       96.67
                    90:V-I 326:T-I |          3        3.33      100.00
-----------------------------------+-----------------------------------
                             Total |         90      100.00

. 
. noi tab valuegenefinder valuetypewriter if site=="fusa" & valuezam==""

                      |         typewriter value
     genefinder value | 404:P=>..   656:T=>S         wt |     Total
----------------------+---------------------------------+----------
161:P-X;461:L-X;473.. |         1          0          0 |         1 
              373:D-G |         0          0          1 |         1 
              656:T-S |         0          1          0 |         1 
       71:A-X;160:A-X |         0          0          1 |         1 
71:A-X;373:D-X;456:.. |         0          0          2 |         2 
       71:A-X;456:L-X |         0          0          3 |         3 
                   wt |         0          0      1,288 |     1,288 
----------------------+---------------------------------+----------
                Total |         1          1      1,295 |     1,297 


. 
. noi di " problem is that mykrobe is not reporting absence of mutation as other than blank"
 problem is that mykrobe is not reporting absence of mutation as other than blank

. 
. list site if new=="101" & site!="mlst", local(list)
option local() not allowed
r(198);

. 
. summ zbyte if strpos("`list'", site) & valuezam==""

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |          0

. 
. noi di "solution: replace " r(N) " blanks in these sites in mykroke with wt -  not mlst which is not a mutation site"
solution: replace 0 blanks in these sites in mykroke with wt -  not mlst which is not a mutation site

. 
. noi replace valuezam="wt" if  strpos("`list'", site) & valuezam==""
(0 real changes made)

. * clean data

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. run clean_pheno.do
