----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\users\amy.mason\Pipeline_27_07_2016\Datasets\clean.log
  log type:  text
 opened on:   9 Aug 2016, 18:01:18

. 
. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on  9 Aug 2016 18:01:18

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Combine all predictive sets" _n _dup(80) "="





================================================================================
 1 Combine all predictive sets
================================================================================

. 
. 
. 
. 
. 
. ****** combine the 3 sets

. 
. noi di "combine"
combine

. 
. use pipeline_data_gf, clear

. 
. append using pipeline_data_tw.dta, force
(note: variable comments was str7, now str68 to accommodate using data's values)
(note: variable value was str27, now str34 to accommodate using data's values)

. 
. append using pipeline_data_z2.dta, force
(note: variable comments was str68, now str187 to accommodate using data's values)

. 
. replace site = lower(site)
(288,639 real changes made)

. 
. noi di _N " results"
393727 results

. 
. bysort site: gen tab=1 if _n==1
(393,595 missing values generated)

. 
. summ tab 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |        132           1           0          1          1

. 
. noi di "on " r(sum) " sites"
on 132 sites

. 
. drop tab

. 
. bysort sample: gen tab=1 if _n==1
(392,298 missing values generated)

. 
. summ tab

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |      1,429           1           0          1          1

. 
. noi di "from " r(sum) " samples"
from 1429 samples

. 
. drop tab

. 
. 
. 
. save pipeline_predict_raw, replace
file pipeline_predict_raw.dta saved

. 
. 
. 
. ***********************************************************

. 
. * 1) Remove samples that are contaminated for all methods

. 
. *********************************************************

. 
. use pipeline_predict_raw, clear

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Remove samples that were contaminated for all methods" _n _dup(80) "="





================================================================================
 1 Remove samples that were contaminated for all methods
================================================================================

. 
. 
. 
. use pipeline_predict_raw, clear

. 
. preserve

. 
. reshape wide value  comment, i(set sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   393727   ->  185868
Number of variables                   6   ->       9
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
                               comments   ->   commentsgenefinder commentstypewriter commentszam
-----------------------------------------------------------------------------

. 
. noi display _N " sample sites"
185868 sample sites

. 
. restore

. 
. gen contam=.
(393,727 missing values generated)

. 
. replace contam=1 if inlist(sample,"C00012813", "C00001215", "C00001249", "C00012746", "C00012791")
(1,405 real changes made)

. 
. replace contam=1 if inlist(sample,"H113120068-138-1","H121000461-388-2","H131100031-408-2","H111840168-459-2","H111200061-196-2"
> )
(1,405 real changes made)

. 
. preserve

. 
. keep if contam==1
(390,917 observations deleted)

. 
. reshape wide value  comment, i(set sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     2810   ->    1315
Number of variables                   7   ->      10
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
                               comments   ->   commentsgenefinder commentstypewriter commentszam
-----------------------------------------------------------------------------

. 
. * count

. 
. bysort sample: gen count=1 if _n==1
(1,305 missing values generated)

. 
. summ contam if count==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      contam |         10           1           0          1          1

. 
. noi di r(sum) " samples contaminated"
10 samples contaminated

. 
. 
. 
. keep sample set site value* comment* 

. 
. compress
  variable sample was str20 now str16
  variable commentsgenefinder was str187 now str7
  variable valuegenefinder was str34 now str18
  variable commentstypewriter was str187 now str31
  variable valuetypewriter was str34 now str10
  variable commentszam was str187 now str174
  variable valuezam was str34 now str6
  (553,615 bytes saved)

. 
. sort sample site

. 
. order sample site value* comment*

. 
. 
. 
. noi save problem_samples, replace
file problem_samples.dta saved

. 
. 
. 
. 
. 
. restore

. 
. summ contam

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      contam |      2,810           1           0          1          1

. 
. noi di r(sum) " values for contaminated samples dropped from study"
2810 values for contaminated samples dropped from study

. 
. noi drop if contam==1
(2,810 observations deleted)

. 
. drop contam

. 
. compress
  (0 bytes saved)

. 
. save pipeline_noncontam, replace
file pipeline_noncontam.dta saved

. 
. *****************************************************

. 
. * clean site names

. 
. ******************************************************

. 
. use pipeline_noncontam, clear

. 
. noi di _n(5) _dup(80) "=" _n "consolidate names/ spelling errors for various sites" _n _dup(80) "=" 





================================================================================
consolidate names/ spelling errors for various sites
================================================================================

. 
. 
. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(2,758 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(2,758 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(1,419 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(8,274 real changes made)

. 
. replace site = "mlst" if site=="st"
(1,379 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(2,758 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(2,758 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(2,758 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "dfr")
(13,790 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "fus")
(5,516 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "ile")
(486 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "lnu")
(5,516 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "qac")
(8,274 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "van")
(8,274 real changes made)

. 
. 
. 
. 
. 
. compress
  (0 bytes saved)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. 
. 
. 
. 
. * some sites split into numbers variants; remerge

. 
. 
. 
. noi di "combining numbered variants into single sites"
combining numbered variants into single sites

. 
. 
. 
. use temp, clear

. 
. 
. 
. drop comments 

. 
. keep if strpos(site, "erma") | strpos(site,"ccr") | strpos(site, "se")
(285,402 observations deleted)

. 
. drop if inlist(site, "ccrcb", "ccrca", "ccrcc", "seb", "sec", "sed")
(25,056 observations deleted)

. 
. reshape wide value, i(set sample method) j(site) string
(note: j = ccra ccra_1 ccra_2 ccra_3 ccra_4 ccrb ccrb_1 ccrb_2 ccrb_3 ccrb_4 ccrb_6 erma erma_1 erma_2 sea sea_1 sea_2 see seg seh
>  seh_1 seh_2 sei sej selr sep seu seu_1 seu_2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    80459   ->    4177
Number of variables                   5   ->      32
j variable (29 values)             site   ->   (dropped)
xij variables:
                                  value   ->   valueccra valueccra_1 ... valueseu_2
-----------------------------------------------------------------------------

. 
. 
. 
. *erma

. 
. replace valueerma="A" if valueerma_1=="A" & valueerma_2=="A" &valueerma==""
(2,465 real changes made)

. 
. replace valueerma="P" if (valueerma_1=="P" | valueerma_2=="P" ) & valueerma==""
(293 real changes made)

. 
. assert valueerma!=""

. 
. drop valueerma_1 valueerma_2

. 
. 
. 
. *ccra

. 
. replace valueccra="A" if valueccra=="" & valueccra_1=="A" & valueccra_2=="A" & valueccra_3=="A" & valueccra_4=="A"
(2,025 real changes made)

. 
. replace valueccra="P" if valueccra=="" & (valueccra_1=="P"|  valueccra_2=="P"| valueccra_3=="P"| valueccra_4=="P")
(733 real changes made)

. 
. assert valueccra!=""

. 
. drop valueccra_*

. 
. 
. 
. * ccrb

. 
. replace valueccrb="A" if valueccrb=="" & valueccrb_1=="A" & valueccrb_2=="A" & valueccrb_3=="A" & valueccrb_4=="A" & valueccrb_6
> =="A" 
(2,054 real changes made)

. 
. replace valueccrb="P" if valueccrb=="" & (valueccrb_1=="P" | valueccrb_2=="P"|valueccrb_3=="P"|valueccrb_4=="P"|valueccrb_6=="P"
>  )
(704 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueccrb!="" if !strpos(sample, "C0001165")

. 
. drop valueccrb_*

. 
. 
. 
. * sea

. 
. replace valuesea="A" if valuesea_1=="A" & valuesea_2=="A"  & valuesea=="" 
(2,165 real changes made)

. 
. replace valuesea="P" if valuesea_1=="P" | valuesea_2=="P"  & valuesea=="" 
(593 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valuesea!=""  if !strpos(sample, "C0001165")

. 
. drop valuesea_*

. 
. 
. 
. *seh

. 
. replace valueseh="A" if valueseh_1=="A" & valueseh_2=="A"  & valueseh=="" 
(2,488 real changes made)

. 
. replace valueseh="P" if valueseh_1=="P" | valueseh_2=="P"  & valueseh=="" 
(270 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseh!=""  if !strpos(sample, "C0001165")

. 
. drop valueseh_*

. 
. 
. 
. *seu

. 
. replace valueseu="A" if valueseu_1=="A" & valueseu_2=="A" &  valueseu=="" 
(1,251 real changes made)

. 
. replace valueseu="P" if valueseu_1=="P" | valueseu_2=="P"  & valueseu=="" 
(1,507 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseu!=""  if !strpos(sample, "C0001165")

. 
. drop valueseu_*

. 
. 
. 
. reshape long
(note: j = ccra ccrb erma sea see seg seh sei sej selr sep seu)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     4177   ->   50124
Number of variables                  15   ->       5
j variable (12 values)                    ->   site
xij variables:
       valueccra valueccrb ... valueseu   ->   value
-----------------------------------------------------------------------------

. 
. rename value cleanvalue

. 
. 
. 
. merge 1:1 set sample method site using temp, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       373,895
        from master                    16,551  (_merge==1)
        from using                    357,344  (_merge==2)

    matched                            33,573
        not updated                    33,573  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. assert _merge!=4

. 
. assert _merge!=5

. 
. noi assert value == cleanvalue if _merge==3

. 
. noi tab site if _merge ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          ccra |      2,758       16.66       16.66
          ccrb |      2,760       16.68       33.34
          erma |      2,758       16.66       50.00
           sea |      2,759       16.67       66.67
           seh |      2,758       16.66       83.34
           seu |      2,758       16.66      100.00
---------------+-----------------------------------
         Total |     16,551      100.00

. 
. replace value = cleanvalue if value==""
(16,548 real changes made)

. 
. noi tab site if strpos(site, "_")

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
        ccra_1 |      2,758        5.88        5.88
        ccra_2 |      2,758        5.88       11.76
        ccra_3 |      2,758        5.88       17.65
        ccra_4 |      2,758        5.88       23.53
        ccrb_1 |      2,758        5.88       29.41
        ccrb_2 |      2,758        5.88       35.29
        ccrb_3 |      2,758        5.88       41.18
        ccrb_4 |      2,758        5.88       47.06
        ccrb_6 |      2,758        5.88       52.94
        erma_1 |      2,758        5.88       58.82
        erma_2 |      2,758        5.88       64.71
         sea_1 |      2,758        5.88       70.59
         sea_2 |      2,758        5.88       76.47
         seh_1 |      2,758        5.88       82.35
         seh_2 |      2,758        5.88       88.24
         seu_1 |      2,758        5.88       94.12
         seu_2 |      2,758        5.88      100.00
---------------+-----------------------------------
         Total |     46,886      100.00

. 
. drop if strpos(site, "_")
(46,886 observations deleted)

. 
. noi tab site if _merge==2 

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,177        1.35        1.35
    aaddaph4ia |      4,177        1.35        2.69
    aadeant6ia |      4,177        1.35        4.04
allelicprofile |      1,379        0.44        4.48
        ant9ia |      4,177        1.35        5.83
        ant9ib |      4,177        1.35        7.17
        aph2ic |      4,177        1.35        8.52
  apha3aph3iii |      4,177        1.35        9.86
          arca |      4,176        1.35       11.21
          arcb |      4,176        1.35       12.55
          arcc |      4,177        1.35       13.90
          arcd |      4,176        1.35       15.24
          blaz |      4,177        1.35       16.59
           cat |      4,177        1.35       17.93
         ccrca |      4,177        1.35       19.28
         ccrcb |      4,175        1.34       20.62
         ccrcc |      4,176        1.35       21.97
           cfr |      4,177        1.35       23.31
           chp |      4,177        1.35       24.66
          dfra |      4,177        1.35       26.01
          dfrb |      4,176        1.35       27.35
          dfrc |      4,177        1.35       28.70
          dfrd |      4,177        1.35       30.04
          dfrg |      4,177        1.35       31.39
          dfrk |      4,177        1.35       32.73
          ermb |      4,177        1.35       34.08
          ermc |      4,177        1.35       35.42
          ermt |      4,177        1.35       36.77
          ermy |      4,177        1.35       38.11
           eta |      4,177        1.35       39.46
           etb |      4,175        1.34       40.80
           etd |      4,176        1.35       42.15
          fusa |      4,176        1.35       43.49
          fusb |      4,177        1.35       44.84
          fusc |      4,177        1.35       46.19
          grla |      4,176        1.35       47.53
          gyra |      4,175        1.34       48.88
          iles |      2,758        0.89       49.76
          isab |      4,177        1.35       51.11
          lnua |      4,177        1.35       52.45
          lnub |      4,177        1.35       53.80
           luk |      1,419        0.46       54.26
          lukm |      4,177        1.35       55.60
         lukmf |      4,176        1.35       56.95
        lukpvf |      4,177        1.35       58.29
        lukpvs |      4,177        1.35       59.64
          meca |      4,177        1.35       60.98
          mecc |      4,177        1.35       62.33
          mlst |      2,758        0.89       63.22
          mphc |      4,177        1.35       64.56
          msra |      4,177        1.35       65.91
          mupa |      4,177        1.35       67.25
          mupb |      4,177        1.35       68.60
          qaca |      4,177        1.35       69.94
          qacb |      4,177        1.35       71.29
       qaccsmr |      4,177        1.35       72.64
          rpob |      4,176        1.35       73.98
           sak |      4,177        1.35       75.33
          sasx |      4,177        1.35       76.67
          sat4 |      4,177        1.35       78.02
           scn |      4,177        1.35       79.36
           seb |      4,176        1.35       80.71
           sec |      4,176        1.35       82.05
           sed |      4,176        1.35       83.40
           str |      4,177        1.35       84.74
          tetk |      4,177        1.35       86.09
          tetl |      4,177        1.35       87.43
          tetm |      4,177        1.35       88.78
          teto |      4,177        1.35       90.12
         tsst1 |      4,177        1.35       91.47
          vana |      4,177        1.35       92.82
          vanb |      4,177        1.35       94.16
          vanc |      4,177        1.35       95.51
          vgaa |      4,177        1.35       96.85
        vgaalc |      1,419        0.46       97.31
          vgab |      4,177        1.35       98.65
          vgba |      4,177        1.35      100.00
---------------+-----------------------------------
         Total |    310,458      100.00

. 
. drop _merge cleanvalue comment

. 
.  
. 
. 
. 
. reshape wide value , i(sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   360582   ->  126152
Number of variables                   5   ->       6
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
-----------------------------------------------------------------------------

. 
. noi display _N " sample sites"
126152 sample sites

. 
. bysort sample: gen count1=1 if _n==1
(124,733 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,419           1           0          1          1

. 
. noi di r(sum) " samples"
1419 samples

. 
. bysort site: gen count2=1 if _n==1
(126,063 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         89           1           0          1          1

. 
. noi di r(sum) " sites"
89 sites

. 
. drop count*

. 
. 
. 
. save temp2, replace
file temp2.dta saved

. 
. 
. 
. 
. 
. **************************************************

. 
. * SITE TYPES

. 
. ***************************************************

. 
. use temp2, clear

. 
. 
. 
. gen type = "mlst"  if inlist(site, "mlst")
(124,773 missing values generated)

. 
. 
. 
. replace type = "virulence" if inlist(site, "arca","arcb", "arcc", "arcd", "sasx")
variable type was str4 now str9
(7,092 real changes made)

. 
. replace type = "virulence" if inlist(site, "sea", "sea1", "sea2", "seb", "sec", "sed" )
(5,673 real changes made)

. 
. replace type = "virulence" if inlist(site, "seh2", "sei", "sej", "selr", "sep","seu", "seu1", "seu2")
(7,095 real changes made)

. 
. replace type = "virulence" if inlist(site, "eta", "etb", "etd", "chp", "sak", "scn", "lukpvf" )
(9,930 real changes made)

. 
. replace type = "virulence" if inlist(site, "luk", "lukm", "lukmf", "lukpvs", "tsst1")
(7,094 real changes made)

. 
. replace type = "virulence" if inlist(site, "see", "seg", "seh", "seh1" )
(4,257 real changes made)

. 
. 
. 
. 
. 
. replace type = "ccr" if strpos(site, "ccr")==1
(7,092 real changes made)

. 
. 
. 
. replace type = "Chromosomal Resistance" if inlist(site, "iles", "gyra", "grla", "dfrb", "fusa", "rpob")
variable type was str9 now str22
(8,468 real changes made)

. 
. 
. 
. 
. 
. replace type = "Aquired Resistance"  if inlist(site, "blaz", "meca", "mecc", "aac6aph2" )
(5,676 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"aaddaph4ia","aadeant6ia", "ant9ia", "ant9ib","aph2ic", "apha3aph3iii" )
(8,514 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "str", "fusb", "fusc", "vana", "vanb", "vanc")
(8,514 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"lnua", "lnub", "isab", "vgaa", "vgab", "vgba","erma1", "erma2", "erma")
(9,933 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "ermb", "ermc", "ermy", "ermt", "msra", "mphc", "mupa", "mupb")
(11,352 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "sat4", "tetk", "tetl", "tetm", "teto", "dfra", "dfrc", "dfrd")
(11,352 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "dfrg", "dfrk", "cfr", "cat", "qaca", "qacb", "qaccsmr")
(9,933 real changes made)

. 
. 
. 
. 
. 
. 
. 
. * Summary 

. 
. noi display _N " sample sites"
126152 sample sites

. 
. noi tab type

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |     65,274       52.92       52.92
Chromosomal Resistance |      8,468        6.86       59.78
                   ccr |      7,092        5.75       65.53
                  mlst |      1,379        1.12       66.65
             virulence |     41,141       33.35      100.00
-----------------------+-----------------------------------
                 Total |    123,354      100.00

. 
. bysort sample: gen count1=1 if _n==1
(124,733 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,419           1           0          1          1

. 
. noi di r(sum) " samples"
1419 samples

. 
. bysort site: gen count2=1 if _n==1
(126,063 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         89           1           0          1          1

. 
. noi di r(sum) " sites"
89 sites

. 
. noi tab type if count2==1, m

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                       |          2        2.25        2.25
    Aquired Resistance |         46       51.69       53.93
Chromosomal Resistance |          6        6.74       60.67
                   ccr |          5        5.62       66.29
                  mlst |          1        1.12       67.42
             virulence |         29       32.58      100.00
-----------------------+-----------------------------------
                 Total |         89      100.00

. 
. noi tab site if type==""

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379       49.29       49.29
        vgaalc |      1,419       50.71      100.00
---------------+-----------------------------------
         Total |      2,798      100.00

. 
. drop count*

. 
. 
. 
. save temp3, replace
file temp3.dta saved

. 
. 
. 
. 
. 
. **********************

. 
. *2) LOOK AT MISSING DATA BETWEEN METHODS

. 
. ****************************************************

. 
. noi di _n(5) _dup(80) "=" _n " 2 Missing data between methods" _n _dup(80) "="





================================================================================
 2 Missing data between methods
================================================================================

. 
. 
. 
. * how many values are missing

. 
. use temp3, clear

. 
. 
. 
. * create absence markers

. 
. gen  zbyte=( valuezam!="")

. 
. gen  tbyte=( valuetypewriter !="")

. 
. gen  gbyte=( valuegenefinder   !="")

. 
. gen new= string( tbyte ) + string(zbyte) + string(gbyte)

. 
. replace new ="Phenotype" if type=="Phenotype"
(0 real changes made)

. 
. noi di "sample-sites missing values - key (typewriter mykrobe genefinder)"
sample-sites missing values - key (typewriter mykrobe genefinder)

. 
. table new

----------------------
      new |      Freq.
----------+-----------
      000 |        171
      001 |      1,379
      010 |      6,008
      101 |      8,928
      111 |    109,666
----------------------

. 
. 
. 
. 
. 
. *000

. 
. summ zbyte if new=="000"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |        171           0           0          0          0

. 
. noi di r(N) " not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below"
171 not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below

. 
. 
. 
. 
. 
. *010

. 
. summ zbyte if new== "010"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      6,008           1           0          1          1

. 
. noi di r(N) " Called only by mykrobe"
6008 Called only by mykrobe

. 
. * vgaalc

. 
. noi tab site new if inlist(site, "vgaalc"), m

               |    new
          site |       010 |     Total
---------------+-----------+----------
        vgaalc |     1,419 |     1,419 
---------------+-----------+----------
         Total |     1,419 |     1,419 


. 
. summ zbyte if inlist(site, "vgaalc")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. 
. noi di r(N) " vgaalc only supplied by mykrobe, drop from database"
1419 vgaalc only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "vgaalc")
(1,419 observations deleted)

. 
. noi di _N " sample sites remaining" 
124733 sample sites remaining

. 
. * luk

. 
. noi tab site new if strpos(site, "luk"), m

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
           luk |     1,419          0 |     1,419 
          lukm |        40      1,379 |     1,419 
         lukmf |        39      1,379 |     1,418 
        lukpvf |        40      1,379 |     1,419 
        lukpvs |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,578      5,516 |     7,094 


. 
. summ zbyte if inlist(site, "luk")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. 
. noi di r(N) " luk only supplied by mykrobe, drop from database"
1419 luk only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "luk")
(1,419 observations deleted)

. 
. noi di _N " sample sites remaining" 
123314 sample sites remaining

. 
. 
. 
. * samples not in other sets

. 
. vallist sample if new=="010", local(list)
C00011632 C00011631 C00011642 C00011618 C00011653 C00003293 C00011572 C00003117 C00011596 C00001125 C00011606 C00011655 C00011607 
> C00011643 C00009009 C00011608 C00003214 C00011593 C00011629 C00011620 C00011617 C00011581 C00011654 C00011582 C00003273 C0001158
> 4 C00011595 C00011619 C00011594 C00003094 C00011570 C00003123 C00011630 C00011571 C00011569 C00003342 C00011644 C00011605 C00011
> 641 C00011656

. 
. noi tab sample new if strpos("`list'", sample)

                     |          new
           Sample_id |       000        010 |     Total
---------------------+----------------------+----------
           C00001125 |         5         79 |        84 
           C00003094 |         4         80 |        84 
           C00003117 |         5         79 |        84 
           C00003123 |         5         79 |        84 
           C00003214 |         4         80 |        84 
           C00003273 |         4         80 |        84 
           C00003293 |         5         79 |        84 
           C00003342 |         5         79 |        84 
           C00009009 |         5         79 |        84 
           C00011569 |         4         80 |        84 
           C00011570 |         3         81 |        84 
           C00011571 |         5         79 |        84 
           C00011572 |         3         81 |        84 
           C00011581 |         5         79 |        84 
           C00011582 |         5         79 |        84 
           C00011584 |         5         79 |        84 
           C00011593 |         5         79 |        84 
           C00011594 |         2         82 |        84 
           C00011595 |         3         81 |        84 
           C00011596 |         3         81 |        84 
           C00011605 |         3         81 |        84 
           C00011606 |         5         79 |        84 
           C00011607 |         3         81 |        84 
           C00011608 |         5         79 |        84 
           C00011617 |         4         80 |        84 
           C00011618 |         5         79 |        84 
           C00011619 |         5         79 |        84 
           C00011620 |         5         79 |        84 
           C00011629 |         5         79 |        84 
           C00011630 |         5         79 |        84 
           C00011631 |         5         79 |        84 
           C00011632 |         5         79 |        84 
           C00011641 |         4         80 |        84 
           C00011642 |         5         79 |        84 
           C00011643 |         3         81 |        84 
           C00011644 |         3         81 |        84 
           C00011653 |         5         79 |        84 
           C00011654 |         5         79 |        84 
           C00011655 |         4         70 |        74 
           C00011656 |         2         73 |        75 
---------------------+----------------------+----------
               Total |       171      3,170 |     3,341 


. 
. bysort sample: gen count =1 if _n==1
(121,895 missing values generated)

. 
. summ zbyte if strpos("`list'", sample) & count==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |         40        .975    .1581139          0          1

. 
. noi di r(N) " samples are only processed by mykrobe - drop from comparision set"
40 samples are only processed by mykrobe - drop from comparision set

. 
. summ zbyte if strpos("`list'", sample) 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      3,341    .9488177    .2204023          0          1

. 
. noi di r(N) " sample sites affected"
3341 sample sites affected

. 
. drop if strpos("`list'", sample)
(3,341 observations deleted)

. 
. drop count 

. 
. 
. 
. *001

. 
. summ zbyte if new =="001"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,379           0           0          0          0

. 
. noi di r(N) "Called only by typewriter"
1379Called only by typewriter

. 
. noi di "sites in sample-sites only supplied by typewriter"
sites in sample-sites only supplied by typewriter

. 
. noi tab site if new =="001"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379      100.00      100.00
---------------+-----------------------------------
         Total |      1,379      100.00

. 
. * allelicprofile - drop

. 
. noi tab site new if inlist(site, "allelicprofile"), m

               |    new
          site |       001 |     Total
---------------+-----------+----------
allelicprofile |     1,379 |     1,379 
---------------+-----------+----------
         Total |     1,379 |     1,379 


. 
. summ zbyte if inlist(site, "allelicprofile")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,379           0           0          0          0

. 
. noi di r(N) " allelicprofile only supplied by typewriter, drop from database"
1379 allelicprofile only supplied by typewriter, drop from database

. 
. noi drop if inlist(site, "allelicprofile")
(1,379 observations deleted)

. 
. noi di _N " sample sites remaining" 
118594 sample sites remaining

. 
. assert new!="001"

. 
. 
. 
. 
. 
. 
. 
. * 101

. 
. summ zbyte if new =="101"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      8,928           0           0          0          0

. 
. noi di r(N) " no value in mykrobe, eg fusa"
8928 no value in mykrobe, eg fusa

. 
. noi tab site if new=="101"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          dfrb |      1,294       14.49       14.49
          fusa |      1,297       14.53       29.02
          grla |      1,074       12.03       41.05
          gyra |      1,157       12.96       54.01
          iles |      1,379       15.45       69.46
          mlst |      1,379       15.45       84.90
          rpob |      1,348       15.10      100.00
---------------+-----------------------------------
         Total |      8,928      100.00

. 
. noi tab valuezam if site=="fusa"

                         zam value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                           114:P-H |          1        1.22        1.22
                           326:T-I |          1        1.22        2.44
                   326:T-I 468:E-V |          1        1.22        3.66
                           404:P-L |          1        1.22        4.88
                           404:P-Q |          4        4.88        9.76
                           406:P-L |          2        2.44       12.20
                           452:G-C |          2        2.44       14.63
                   452:G-C 453:M-I |          1        1.22       15.85
                           452:G-S |          1        1.22       17.07
                           453:M-I |          5        6.10       23.17
                           457:H-Q |          1        1.22       24.39
                           457:H-Y |          6        7.32       31.71
                           461:L-F |          1        1.22       32.93
                   461:L-F 404:P-L |          1        1.22       34.15
                           461:L-K |         23       28.05       62.20
                           461:L-S |         17       20.73       82.93
                           464:R-H |          1        1.22       84.15
                           464:R-S |          5        6.10       90.24
                            90:V-I |          7        8.54       98.78
                    90:V-I 326:T-I |          1        1.22      100.00
-----------------------------------+-----------------------------------
                             Total |         82      100.00

. 
. noi tab valuegenefinder valuetypewriter if site=="fusa" & valuezam==""

                      |         typewriter value
     genefinder value | 404:P=>..   656:T=>S         wt |     Total
----------------------+---------------------------------+----------
161:P-X;461:L-X;473.. |         1          0          0 |         1 
              373:D-G |         0          0          1 |         1 
              656:T-S |         0          1          0 |         1 
       71:A-X;160:A-X |         0          0          1 |         1 
71:A-X;373:D-X;456:.. |         0          0          2 |         2 
       71:A-X;456:L-X |         0          0          3 |         3 
                   wt |         0          0      1,288 |     1,288 
----------------------+---------------------------------+----------
                Total |         1          1      1,295 |     1,297 


. 
. noi di " problem is that mykrobe is not reporting absence of mutation as other than blank"
 problem is that mykrobe is not reporting absence of mutation as other than blank

. 
. vallist site if new=="101" & site!="mlst", local(list)
fusa iles rpob dfrb gyra grla

. 
. summ zbyte if strpos("`list'", site) & valuezam==""

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      7,549           0           0          0          0

. 
. noi di "solution: replace " r(N) " blanks in these sites in mykroke with wt -  not mlst which is not a mutation site"
solution: replace 7549 blanks in these sites in mykroke with wt -  not mlst which is not a mutation site

. 
. noi replace valuezam="wt" if  strpos("`list'", site) & valuezam==""
(7,549 real changes made)

. 
. 
. 
. * regen new

. 
. drop new

. 
. drop *byte

. 
. gen  zbyte=( valuezam!="")

. 
. gen  tbyte=( valuetypewriter !="")

. 
. gen  gbyte=( valuegenefinder   !="")

. 
. gen new= string( tbyte ) + string(zbyte) + string(gbyte)

. 
. noi tab new

        new |      Freq.     Percent        Cum.
------------+-----------------------------------
        101 |      1,379        1.16        1.16
        111 |    117,215       98.84      100.00
------------+-----------------------------------
      Total |    118,594      100.00

. 
. * mslt

. 
. noi assert site=="mlst" if new=="101" 

. 
. assert new =="111" if (type!="Phenotype" & site!="mlst")

. 
. noi di "all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)"
all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)

. 
. 
. 
. * save mlst results and drop

. 
. preserve

. 
. keep if site =="mlst"
(117,215 observations deleted)

. 
. gen ident =  strpos(valuetypewriter, valuegene) >0

. 
. replace ident = 1 if valueg=="Novel" & valuet=="NF"
(111 real changes made)

. 
. summ ident 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       ident |      1,379    .9934735    .0805517          0          1

. 
. noi di "mlst agreement between typewriter and genefinder in " r(sum) " cases out of " r(N)
mlst agreement between typewriter and genefinder in 1370 cases out of 1379

. 
. noi di "value missing for all mykrobe"
value missing for all mykrobe

. 
. noi di "rest"
rest

. 
. noi tab valueg valuet if ident==0

                      |   typewriter value
     genefinder value |        NF  Saur-ST.. |     Total
----------------------+----------------------+----------
                  182 |         1          0 |         1 
                   22 |         1          0 |         1 
                 2415 |         1          0 |         1 
                 2416 |         1          0 |         1 
                 2889 |         1          0 |         1 
                  425 |         1          0 |         1 
                    7 |         1          0 |         1 
                   80 |         1          0 |         1 
                Novel |         0          1 |         1 
----------------------+----------------------+----------
                Total |         8          1 |         9 


. 
. keep sample valueg valuet ident

. 
. save mlst, replace
file mlst.dta saved

. 
. restore

. 
. gen marker =1 if site=="mlst"
(117,215 missing values generated)

. 
. summ marker

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      marker |      1,379           1           0          1          1

. 
. noi di "dropping " r(sum) " mlst sites"
dropping 1379 mlst sites

. 
. noi drop if marker==1
(1,379 observations deleted)

. 
. drop marker

. 
. 
. 
. 
. 
. * count how many sample sites left

. 
. 
. 
. noi display _N " sample sites"
117215 sample sites

. 
. bysort sample: gen count1=1 if _n==1
(115,836 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. 
. noi di r(sum) " samples"
1379 samples

. 
. bysort site: gen count2=1 if _n==1
(117,130 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         85           1           0          1          1

. 
. noi di r(sum) " sites"
85 sites

. 
. bysort site: gen count3=1 if _n==1 & site!="mlst" & type!="Phenotype"
(117,130 missing values generated)

. 
. summ count3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count3 |         85           1           0          1          1

. 
. noi di r(sum) " sites not including Phenotype results and mlst"
85 sites not including Phenotype results and mlst

. 
. drop count* new *byte

. 
. 
. 
. 
. 
.  
. 
. save temp4, replace
file temp4.dta saved

. 
. *************************************

. 
. 
. 
. * then add which go with which antibiotic (based on new sheet by clare)

. 
. **********************************************************

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 4 Match to antibiotic prediction" _n _dup(80) "="





================================================================================
 4 Match to antibiotic prediction
================================================================================

. 
. 
. 
. 
. 
. *clean up non binary values

. 
. use temp4, clear

. 
. reshape long
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   117215   ->  351645
Number of variables                   7   ->       6
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. 
. 
. 
. replace value = upper(value)
(22,501 real changes made)

. 
. gen ambi = 1 if inlist(value, "ND", "NT", "LOW COV", "MIXED")
(351,643 missing values generated)

. 
. replace ambi=1 if inlist(value, "NOT DONE", "N/A", "NF", "NA", "-")
(0 real changes made)

. 
. summ ambi if ambi ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ambi |          2           1           0          1          1

. 
. noi di r(N) " values have N/A or equivalent values, set these all to NA"
2 values have N/A or equivalent values, set these all to NA

. 
. noi replace value = "NA" if ambi==1
(2 real changes made)

. 
. tab site if ambi ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          gyra |          1       50.00       50.00
          iles |          1       50.00      100.00
---------------+-----------------------------------
         Total |          2      100.00

. 
. drop ambi

. 
. 
. 
. ***************

. 
. gen count = 1 if strpos(value, "=>")
(350,853 missing values generated)

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |        792           1           0          1          1

. 
. noi di r(N)" replace => with - to create uniform recording of mutations"
invalid syntax
r(198);

. 
. noi replace value = subinstr(value, "=>", "-",.)
(792 real changes made)

. 
. drop count 

. 
. 
. 
. 
. 
. gen count = 1 if strpos(value," ")
(351,631 missing values generated)

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |         14           1           0          1          1

. 
. noi di r(N) " remove all spaces in value reports"
14 remove all spaces in value reports

. 
. noi replace value = subinstr(value, " ", "",.)
(14 real changes made)

. 
. drop count 

. 
. 
. 
. *swap to binary the point mutations

. 
. * clarify absenses

. 
. gen count = 1  if value=="WT" & strpos(type, "Chromo")
(329,146 missing values generated)

. 
. summ count if count==1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |     22,499           1           0          1          1

. 
. noi di r(N) "replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations"
22499replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations

. 
. noi replace value = "A" if count==1
(22,499 real changes made)

. 
. drop count

. 
. 
. 
. * clarify point mutations based on clare's paper

. 
. noi di "mutations: if count!=1 then no considered positive as not in panal on clare's paper"
mutations: if count!=1 then no considered positive as not in panal on clare's paper

. 
. *gyra

. 
. noi di "gyra mutations"
gyra mutations

. 
. gen count =1 if value =="84:S-L" & strpos(site, "gyra")
(350,841 missing values generated)

. 
. noi tab value count if site=="gyra" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               84:S-A |         0          3 |         3 
               84:S-L |       804          0 |       804 
               84:S-V |         0          1 |         1 
               84:S-X |         0          2 |         2 
        84:S-X;88:E-X |         0          1 |         1 
----------------------+----------------------+----------
                Total |       804          7 |       811 


. 
. replace value = "P" if count ==1
(804 real changes made)

. 
. noi tab value count if site=="gyra" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               84:S-A |         0          3 |         3 
               84:S-V |         0          1 |         1 
               84:S-X |         0          2 |         2 
        84:S-X;88:E-X |         0          1 |         1 
                    A |         0      3,325 |     3,325 
                   NA |         0          1 |         1 
                    P |       804          0 |       804 
----------------------+----------------------+----------
                Total |       804      3,333 |     4,137 


. 
. drop count 

. 
. *grla

. 
. noi di "grla mutations"
grla mutations

. 
. gen count =1 if strpos(value, "80:S-F") & strpos(site, "grla")
(350,740 missing values generated)

. 
. replace count=1 if strpos(value, "80:S-Y") & strpos(site, "grla")
(12 real changes made)

. 
. replace count=1  if strpos(value, "84:E-G") & strpos(site, "grla")
(1 real change made)

. 
. noi tab value count if site=="grla" & strpos(value, "-") , m

                      |   count
                value |         1 |     Total
----------------------+-----------+----------
               80:S-F |       900 |       900 
         80:S-F80:S-Y |         2 |         2 
        80:S-F;84:E-K |         3 |         3 
               80:S-Y |        12 |        12 
               84:E-G |         1 |         1 
----------------------+-----------+----------
                Total |       918 |       918 


. 
. replace value = "P" if count ==1
(918 real changes made)

. 
. noi tab value count if site=="grla" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
                    A |         0      3,219 |     3,219 
                    P |       918          0 |       918 
----------------------+----------------------+----------
                Total |       918      3,219 |     4,137 


. 
. drop count 

. 
. 
. 
. 
. 
. * fusa

. 
. noi di "fusa mutations"
fusa mutations

. 
. 
. 
. gen count =1 if strpos(value, "114:P-H") & strpos(site, "fusa")
(351,644 missing values generated)

. 
. replace count =1  if strpos(value, "461:L-K") & strpos(site, "fusa")
(67 real changes made)

. 
. replace count =1  if strpos(value, "461:L-S") & strpos(site, "fusa")
(51 real changes made)

. 
. replace count =1  if strpos(value, "404:P-L") & strpos(site, "fusa")
(4 real changes made)

. 
. replace count =1  if strpos(value, "90:V-I") & strpos(site, "fusa")
(22 real changes made)

. 
. replace count =1  if strpos(value, "457:H-Y") & strpos(site, "fusa")
(18 real changes made)

. 
. replace count =1 if strpos(value, "67:A-T") & strpos(site, "fusa")
(1 real change made)

. 
. replace count =1 if strpos(value, "406:P-L") & strpos(site, "fusa")
(5 real changes made)

. 
. replace count =1 if strpos(value, "464:R-S") & strpos(site, "fusa")
(5 real changes made)

. 
. replace count =1  if strpos(value, "464:R-H") & strpos(site, "fusa")
(1 real change made)

. 
. replace count =1  if strpos(value, "457:H-Q") & strpos(site, "fusa")
(3 real changes made)

. 
. replace count =1  if strpos(value, "453:M-I") & strpos(site, "fusa")
(6 real changes made)

. 
. replace count =1  if strpos(value, "452:G-C") & strpos(site, "fusa")
(2 real changes made)

. 
. replace count =1  if strpos(value, "452:G-S") & strpos(site, "fusa")
(3 real changes made)

. 
. replace count =1  if strpos(value, "404:P-Q") & strpos(site, "fusa")
(6 real changes made)

. 
. noi tab value count if site=="fusa" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
              114:P-H |         1          0 |         1 
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          3 |         3 
       326:T-I468:E-V |         0          1 |         1 
              373:D-G |         0          1 |         1 
376:A-T;404:P-L;461.. |         1          0 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
              404:P-L |         1          0 |         1 
      404:P-L,461:L-F |         1          0 |         1 
              404:P-Q |         6          0 |         6 
              406:P-L |         5          0 |         5 
              452:G-C |         2          0 |         2 
       452:G-C453:M-I |         1          0 |         1 
              452:G-S |         3          0 |         3 
              453:M-I |         5          0 |         5 
              457:H-Q |         3          0 |         3 
              457:H-Y |        16          0 |        16 
              461:L-F |         0          3 |         3 
       461:L-F404:P-L |         1          0 |         1 
              461:L-K |        67          0 |        67 
              461:L-S |        51          0 |        51 
              464:R-H |         1          0 |         1 
              464:R-S |         5          0 |         5 
              656:T-S |         0          2 |         2 
       67:A-T;406:P-L |         1          0 |         1 
       67:A-T;457:H-Y |         2          0 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
               90:V-I |        21          0 |        21 
        90:V-I326:T-I |         1          0 |         1 
----------------------+----------------------+----------
                Total |       195         18 |       213 


. 
. replace value = "P" if count ==1
(195 real changes made)

. 
. noi tab value count if site=="fusa" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          3 |         3 
       326:T-I468:E-V |         0          1 |         1 
              373:D-G |         0          1 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
              461:L-F |         0          3 |         3 
              656:T-S |         0          2 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
                    A |         0      3,924 |     3,924 
                    P |       195          0 |       195 
----------------------+----------------------+----------
                Total |       195      3,942 |     4,137 


. 
. drop count 

. 
. 
. 
. 
. 
. *rpob

. 
. noi di "rpob mutations"
rpob mutations

. 
. gen count =1 if strpos(value, "464:S-P") & strpos(site, "rpob")
(351,642 missing values generated)

. 
. replace count =1   if strpos(value, "468:Q-R") & strpos(site, "rpob")
(1 real change made)

. 
. replace count =1  if strpos(value, "471:D-Y") & strpos(site, "rpob")
(5 real changes made)

. 
. replace count =1  if strpos(value, "477:A-D") & strpos(site, "rpob")
(3 real changes made)

. 
. replace count =1   if strpos(value, "481:H-N") & strpos(site, "rpob")
(50 real changes made)

. 
. replace count =1  if strpos(value, "481:H-Y") & strpos(site, "rpob")
(17 real changes made)

. 
. noi tab value count if site=="rpob" & strpos(value, "-") , m

                      |   count
                value |         1 |     Total
----------------------+-----------+----------
              464:S-P |         3 |         3 
              468:Q-R |         1 |         1 
              471:D-Y |         5 |         5 
              477:A-D |         3 |         3 
              481:H-N |        49 |        49 
       481:H-N481:H-Y |         1 |         1 
              481:H-Y |        17 |        17 
----------------------+-----------+----------
                Total |        79 |        79 


. 
. noi replace value = "P" if count ==1
(79 real changes made)

. 
. noi tab value count if site=="rpob" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
                    A |         0      4,058 |     4,058 
                    P |        79          0 |        79 
----------------------+----------------------+----------
                Total |        79      4,058 |     4,137 


. 
. drop count 

. 
. 
. 
. 
. 
. *dfrb

. 
. noi di "dfrb mutations"
dfrb mutations

. 
. gen count =1 if  strpos(value, "150:H-R") & strpos(site, "dfrb")
(351,627 missing values generated)

. 
. replace count =1   if  strpos(value, "21:L-V") & strpos(site, "dfrb")
(2 real changes made)

. 
. replace count =1   if strpos(value, "31:H-N") & strpos(site, "dfrb")
(4 real changes made)

. 
. replace count =1   if strpos(value, "41:L-F") & strpos(site, "dfrb")
(3 real changes made)

. 
. replace count =1   if strpos(value, "99:F-S") & strpos(site, "dfrb")
(3 real changes made)

. 
. replace count =1   if  strpos(value, "99:F-Y") & strpos(site, "dfrb")
(219 real changes made)

. 
. noi tab value count if site=="dfrb" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
              150:H-R |        18          0 |        18 
        21:L-V;99:F-Y |         1          0 |         1 
               31:H-N |         4          0 |         4 
               41:L-F |         3          0 |         3 
               99:F-S |         1          0 |         1 
         99:F-S99:F-Y |         2          0 |         2 
               99:F-X |         0          1 |         1 
               99:F-Y |       219          0 |       219 
         99:F-Y21:L-V |         1          0 |         1 
----------------------+----------------------+----------
                Total |       249          1 |       250 


. 
. noi replace value = "P" if count ==1
(249 real changes made)

. 
. noi tab value count if site=="dfrb" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               99:F-X |         0          1 |         1 
                    A |         0      3,887 |     3,887 
                    P |       249          0 |       249 
----------------------+----------------------+----------
                Total |       249      3,888 |     4,137 


. 
. drop count 

. 
. 
. 
. * replace all other point mutations as A

. 
. noi di "replace mutations not in table with A"
replace mutations not in table with A

. 
. gen count=1 if !inlist(value, "P", "A")& strpos(type, "Chromo")& inlist(method, "genefinder", "typewriter", "zam") & value!=""
(351,567 missing values generated)

. 
. tab value site if count==1, m

                      |                    site
                value |      dfrb       fusa       gyra       iles |     Total
----------------------+--------------------------------------------+----------
161:P-X;461:L-X;473.. |         0          1          0          0 |         1 
              326:T-I |         0          3          0          0 |         3 
       326:T-I468:E-V |         0          1          0          0 |         1 
              373:D-G |         0          1          0          0 |         1 
404:P-?,406:P-?NONC.. |         0          1          0          0 |         1 
              461:L-F |         0          3          0          0 |         3 
              588:V-F |         0          0          0         50 |        50 
              656:T-S |         0          2          0          0 |         2 
       71:A-X;160:A-X |         0          1          0          0 |         1 
71:A-X;373:D-X;456:.. |         0          2          0          0 |         2 
       71:A-X;456:L-X |         0          3          0          0 |         3 
               84:S-A |         0          0          3          0 |         3 
               84:S-V |         0          0          1          0 |         1 
               84:S-X |         0          0          2          0 |         2 
        84:S-X;88:E-X |         0          0          1          0 |         1 
               99:F-X |         1          0          0          0 |         1 
                   NA |         0          0          1          1 |         2 
----------------------+--------------------------------------------+----------
                Total |         1         18          8         51 |        78 


. 
. replace value="A" if count==1
(78 real changes made)

. 
. drop count

. 
. 
. 
. 
. 
. 
. 
. * swap blanks to dashes to make easier to see

. 
. assert value!=""

. 
. 
. 
. noi bysort type: tab site value, m 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
      aac6aph2 |     3,904        233 |     4,137 
    aaddaph4ia |     3,872        265 |     4,137 
    aadeant6ia |     4,070         67 |     4,137 
        ant9ia |     3,698        439 |     4,137 
        ant9ib |     4,137          0 |     4,137 
        aph2ic |     4,137          0 |     4,137 
  apha3aph3iii |     3,981        156 |     4,137 
          blaz |       721      3,416 |     4,137 
           cat |     4,137          0 |     4,137 
           cfr |     4,128          9 |     4,137 
          dfra |     4,029        108 |     4,137 
          dfrc |     4,058         79 |     4,137 
          dfrd |     4,137          0 |     4,137 
          dfrg |     3,977        160 |     4,137 
          dfrk |     4,124         13 |     4,137 
          erma |     3,687        450 |     4,137 
          ermb |     4,127         10 |     4,137 
          ermc |     3,585        552 |     4,137 
          ermt |     4,077         60 |     4,137 
          ermy |     4,137          0 |     4,137 
          fusb |     4,066         71 |     4,137 
          fusc |     3,908        229 |     4,137 
          isab |     4,137          0 |     4,137 
          lnua |     4,104         33 |     4,137 
          lnub |     4,133          4 |     4,137 
          meca |     2,993      1,144 |     4,137 
          mecc |     4,086         51 |     4,137 
          mphc |     4,085         52 |     4,137 
          msra |     4,083         54 |     4,137 
          mupa |     4,088         49 |     4,137 
          mupb |     4,137          0 |     4,137 
          qaca |     4,000        137 |     4,137 
          qacb |     4,045         92 |     4,137 
       qaccsmr |     3,970        167 |     4,137 
          sat4 |     3,984        153 |     4,137 
           str |     4,125         12 |     4,137 
          tetk |     3,820        317 |     4,137 
          tetl |     4,130          7 |     4,137 
          tetm |     4,022        115 |     4,137 
          teto |     4,137          0 |     4,137 
          vana |     4,137          0 |     4,137 
          vanb |     4,137          0 |     4,137 
          vanc |     4,137          0 |     4,137 
          vgaa |     4,134          3 |     4,137 
          vgab |     4,137          0 |     4,137 
          vgba |     4,137          0 |     4,137 
---------------+----------------------+----------
         Total |   181,595      8,707 |   190,302 


----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
          dfrb |     3,888        249 |     4,137 
          fusa |     3,942        195 |     4,137 
          grla |     3,219        918 |     4,137 
          gyra |     3,333        804 |     4,137 
          iles |     4,137          0 |     4,137 
          rpob |     4,058         79 |     4,137 
---------------+----------------------+----------
         Total |    22,577      2,245 |    24,822 


----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
          ccra |     2,997      1,140 |     4,137 
          ccrb |     3,000      1,137 |     4,137 
         ccrca |     4,028        109 |     4,137 
         ccrcb |     4,058         79 |     4,137 
         ccrcc |     4,042         95 |     4,137 
---------------+----------------------+----------
         Total |    18,125      2,560 |    20,685 


----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
          arca |     4,118         19 |     4,137 
          arcb |     4,121         16 |     4,137 
          arcc |     4,124         13 |     4,137 
          arcd |     4,124         13 |     4,137 
           chp |     1,340      2,797 |     4,137 
           eta |     4,007        130 |     4,137 
           etb |     4,112         25 |     4,137 
           etd |     3,956        181 |     4,137 
          lukm |     4,107         30 |     4,137 
         lukmf |     4,112         25 |     4,137 
        lukpvf |     3,790        347 |     4,137 
        lukpvs |     3,794        343 |     4,137 
           sak |       869      3,268 |     4,137 
          sasx |     4,105         32 |     4,137 
           scn |       441      3,696 |     4,137 
           sea |     3,197        940 |     4,137 
           seb |     3,792        345 |     4,137 
           sec |     3,426        711 |     4,137 
           sed |     3,913        224 |     4,137 
           see |     4,120         17 |     4,137 
           seg |     1,780      2,357 |     4,137 
           seh |     3,695        442 |     4,137 
           sei |     1,794      2,343 |     4,137 
           sej |     3,902        235 |     4,137 
          selr |     3,909        228 |     4,137 
           sep |     3,775        362 |     4,137 
           seu |     1,818      2,319 |     4,137 
         tsst1 |     3,325        812 |     4,137 
---------------+----------------------+----------
         Total |    93,566     22,270 |   115,836 



. 
. 
. 
. save temp5, replace
file temp5.dta saved

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 5 Cleaned summary" _n _dup(80) "="





================================================================================
 5 Cleaned summary
================================================================================

. 
. 
. 
. ***************************************

. 
. * Summary 

. 
. ****************************************

. 
. noi display _N " sample sites"
351645 sample sites

. 
. noi tab type

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |    190,302       54.12       54.12
Chromosomal Resistance |     24,822        7.06       61.18
                   ccr |     20,685        5.88       67.06
             virulence |    115,836       32.94      100.00
-----------------------+-----------------------------------
                 Total |    351,645      100.00

. 
. bysort sample: gen count1=1 if _n==1
(350,266 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. 
. noi di r(sum) " samples"
1379 samples

. 
. bysort site: gen count2=1 if _n==1
(351,560 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         85           1           0          1          1

. 
. noi di r(sum) " sites"
85 sites

. 
. noi tab type if count2==1, m

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |         46       54.12       54.12
Chromosomal Resistance |          6        7.06       61.18
                   ccr |          5        5.88       67.06
             virulence |         28       32.94      100.00
-----------------------+-----------------------------------
                 Total |         85      100.00

. 
. noi tab site if type==""
no observations

. 
. drop count*

. 
. 
. 
. 
. 
. noi di "values by type"
values by type

. 
. noi bysort type: tab value 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |    181,595       95.42       95.42
                                 P |      8,707        4.58      100.00
-----------------------------------+-----------------------------------
                             Total |    190,302      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |     22,577       90.96       90.96
                                 P |      2,245        9.04      100.00
-----------------------------------+-----------------------------------
                             Total |     24,822      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |     18,125       87.62       87.62
                                 P |      2,560       12.38      100.00
-----------------------------------+-----------------------------------
                             Total |     20,685      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |     93,566       80.77       80.77
                                 P |     22,270       19.23      100.00
-----------------------------------+-----------------------------------
                             Total |    115,836      100.00


. 
. 
. 
. noi di "breakdown by site"
breakdown by site

. 
. noi bysort type site:  tab value 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aac6aph2

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,904       94.37       94.37
                                 P |        233        5.63      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aaddaph4ia

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,872       93.59       93.59
                                 P |        265        6.41      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aadeant6ia

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,070       98.38       98.38
                                 P |         67        1.62      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ia

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,698       89.39       89.39
                                 P |        439       10.61      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ib

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aph2ic

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = apha3aph3iii

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,981       96.23       96.23
                                 P |        156        3.77      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = blaz

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |        721       17.43       17.43
                                 P |      3,416       82.57      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cat

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cfr

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,128       99.78       99.78
                                 P |          9        0.22      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfra

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,029       97.39       97.39
                                 P |        108        2.61      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,058       98.09       98.09
                                 P |         79        1.91      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrd

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrg

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,977       96.13       96.13
                                 P |        160        3.87      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrk

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,124       99.69       99.69
                                 P |         13        0.31      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = erma

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,687       89.12       89.12
                                 P |        450       10.88      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,127       99.76       99.76
                                 P |         10        0.24      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,585       86.66       86.66
                                 P |        552       13.34      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermt

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,077       98.55       98.55
                                 P |         60        1.45      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermy

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,066       98.28       98.28
                                 P |         71        1.72      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,908       94.46       94.46
                                 P |        229        5.54      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = isab

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnua

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,104       99.20       99.20
                                 P |         33        0.80      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnub

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,133       99.90       99.90
                                 P |          4        0.10      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = meca

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      2,993       72.35       72.35
                                 P |      1,144       27.65      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mecc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,086       98.77       98.77
                                 P |         51        1.23      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mphc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,085       98.74       98.74
                                 P |         52        1.26      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = msra

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,083       98.69       98.69
                                 P |         54        1.31      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupa

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,088       98.82       98.82
                                 P |         49        1.18      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaca

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,000       96.69       96.69
                                 P |        137        3.31      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qacb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,045       97.78       97.78
                                 P |         92        2.22      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaccsmr

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,970       95.96       95.96
                                 P |        167        4.04      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = sat4

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,984       96.30       96.30
                                 P |        153        3.70      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = str

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,125       99.71       99.71
                                 P |         12        0.29      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetk

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,820       92.34       92.34
                                 P |        317        7.66      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetl

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,130       99.83       99.83
                                 P |          7        0.17      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetm

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,022       97.22       97.22
                                 P |        115        2.78      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = teto

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vana

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgaa

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,134       99.93       99.93
                                 P |          3        0.07      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgab

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgba

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = dfrb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,888       93.98       93.98
                                 P |        249        6.02      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = fusa

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,942       95.29       95.29
                                 P |        195        4.71      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = grla

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,219       77.81       77.81
                                 P |        918       22.19      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = gyra

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,333       80.57       80.57
                                 P |        804       19.43      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = iles

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,137      100.00      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = rpob

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,058       98.09       98.09
                                 P |         79        1.91      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccra

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      2,997       72.44       72.44
                                 P |      1,140       27.56      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,000       72.52       72.52
                                 P |      1,137       27.48      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrca

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,028       97.37       97.37
                                 P |        109        2.63      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,058       98.09       98.09
                                 P |         79        1.91      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,042       97.70       97.70
                                 P |         95        2.30      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arca

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,118       99.54       99.54
                                 P |         19        0.46      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,121       99.61       99.61
                                 P |         16        0.39      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcc

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,124       99.69       99.69
                                 P |         13        0.31      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcd

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,124       99.69       99.69
                                 P |         13        0.31      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = chp

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      1,340       32.39       32.39
                                 P |      2,797       67.61      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = eta

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,007       96.86       96.86
                                 P |        130        3.14      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,112       99.40       99.40
                                 P |         25        0.60      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etd

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,956       95.62       95.62
                                 P |        181        4.38      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukm

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,107       99.27       99.27
                                 P |         30        0.73      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukmf

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,112       99.40       99.40
                                 P |         25        0.60      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvf

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,790       91.61       91.61
                                 P |        347        8.39      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvs

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,794       91.71       91.71
                                 P |        343        8.29      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sak

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |        869       21.01       21.01
                                 P |      3,268       78.99      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sasx

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,105       99.23       99.23
                                 P |         32        0.77      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = scn

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |        441       10.66       10.66
                                 P |      3,696       89.34      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sea

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,197       77.28       77.28
                                 P |        940       22.72      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seb

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,792       91.66       91.66
                                 P |        345        8.34      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sec

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,426       82.81       82.81
                                 P |        711       17.19      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sed

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,913       94.59       94.59
                                 P |        224        5.41      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = see

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      4,120       99.59       99.59
                                 P |         17        0.41      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seg

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      1,780       43.03       43.03
                                 P |      2,357       56.97      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seh

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,695       89.32       89.32
                                 P |        442       10.68      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sei

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      1,794       43.36       43.36
                                 P |      2,343       56.64      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sej

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,902       94.32       94.32
                                 P |        235        5.68      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = selr

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,909       94.49       94.49
                                 P |        228        5.51      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sep

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,775       91.25       91.25
                                 P |        362        8.75      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seu

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      1,818       43.94       43.94
                                 P |      2,319       56.06      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = tsst1

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |      3,325       80.37       80.37
                                 P |        812       19.63      100.00
-----------------------------------+-----------------------------------
                             Total |      4,137      100.00


. 
. 
. 
. noi di "breakdown by method"
breakdown by method

. 
. noi bysort method: tab value

----------------------------------------------------------------------------------------------------------------------------------
-> method = genefinder

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |    105,589       90.08       90.08
                                 P |     11,626        9.92      100.00
-----------------------------------+-----------------------------------
                             Total |    117,215      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> method = typewriter

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |    105,705       90.18       90.18
                                 P |     11,510        9.82      100.00
-----------------------------------+-----------------------------------
                             Total |    117,215      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> method = zam

                             value |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                                 A |    104,569       89.21       89.21
                                 P |     12,646       10.79      100.00
-----------------------------------+-----------------------------------
                             Total |    117,215      100.00


. 
. 
. 
. save pipeline_clean_all_values_long, replace
(note: file pipeline_clean_all_values_long.dta not found)
file pipeline_clean_all_values_long.dta saved

. 
. 
. 
. **********

. 
. * and wide

. 
. noi di "Compare site values between methods"
Compare site values between methods

. 
. 
. 
. reshape wide
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   351645   ->  117215
Number of variables                   6   ->       7
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
-----------------------------------------------------------------------------

. 
. gen ValueAll = valuet  + valuez + valueg

. 
. noi tab ValueAll , sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |    104,468       89.13       89.13
        PPP |     11,251        9.60       98.72
        APA |        956        0.82       99.54
        APP |        274        0.23       99.77
        PPA |        165        0.14       99.91
        PAP |         94        0.08       99.99
        AAP |          7        0.01      100.00
------------+-----------------------------------
      Total |    117,215      100.00

. 
. 
. 
. noi di "values by type"
values by type

. 
. noi bysort type: tab ValueA, sort 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     60,405       95.22       95.22
        PPP |      2,772        4.37       99.59
        APA |        117        0.18       99.78
        PPA |         81        0.13       99.91
        APP |         40        0.06       99.97
        PAP |         13        0.02       99.99
        AAP |          6        0.01      100.00
------------+-----------------------------------
      Total |     63,434      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      7,471       90.29       90.29
        PPP |        679        8.21       98.50
        PAP |         81        0.98       99.48
        APA |         39        0.47       99.95
        APP |          2        0.02       99.98
        AAP |          1        0.01       99.99
        PPA |          1        0.01      100.00
------------+-----------------------------------
      Total |      8,274      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      5,897       85.53       85.53
        PPP |        744       10.79       96.32
        APA |        180        2.61       98.93
        PPA |         38        0.55       99.48
        APP |         36        0.52      100.00
------------+-----------------------------------
      Total |      6,895      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     30,695       79.50       79.50
        PPP |      7,056       18.27       97.77
        APA |        620        1.61       99.38
        APP |        196        0.51       99.88
        PPA |         45        0.12      100.00
------------+-----------------------------------
      Total |     38,612      100.00


. 
. 
. 
. noi di "breakdown by site"
breakdown by site

. 
. noi bysort type site:  tab ValueA, sort

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aac6aph2

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,299       94.20       94.20
        PPP |         76        5.51       99.71
        APA |          3        0.22       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aaddaph4ia

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,286       93.26       93.26
        PPP |         86        6.24       99.49
        APA |          7        0.51      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aadeant6ia

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,356       98.33       98.33
        PPP |         21        1.52       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ia

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,228       89.05       89.05
        PPP |        140       10.15       99.20
        PAP |          5        0.36       99.56
        APA |          3        0.22       99.78
        APP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ib

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aph2ic

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = apha3aph3iii

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,326       96.16       96.16
        PPP |         51        3.70       99.85
        APA |          1        0.07       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = blaz

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |      1,129       81.87       81.87
        AAA |        230       16.68       98.55
        APA |         11        0.80       99.35
        APP |          7        0.51       99.85
        PAP |          1        0.07       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cat

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cfr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,375       99.71       99.71
        PPP |          2        0.15       99.85
        APA |          1        0.07       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,340       97.17       97.17
        PPP |         34        2.47       99.64
        APA |          4        0.29       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,339       97.10       97.10
        PPA |         34        2.47       99.56
        APP |          3        0.22       99.78
        APA |          2        0.15       99.93
        PPP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrd

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrg

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,325       96.08       96.08
        PPP |         53        3.84       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrk

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,373       99.56       99.56
        PAP |          5        0.36       99.93
        PPP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = erma

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,222       88.61       88.61
        PPP |        144       10.44       99.06
        APA |          8        0.58       99.64
        APP |          5        0.36      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,375       99.71       99.71
        PPP |          3        0.22       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,181       85.64       85.64
        PPP |        176       12.76       98.40
        APA |         20        1.45       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermt

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,359       98.55       98.55
        PPP |         20        1.45      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermy

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,352       98.04       98.04
        PPP |         22        1.60       99.64
        APA |          5        0.36      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,300       94.27       94.27
        PPP |         74        5.37       99.64
        APA |          3        0.22       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = isab

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnua

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,364       98.91       98.91
        PPP |          9        0.65       99.56
        AAP |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnub

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,377       99.85       99.85
        APA |          1        0.07       99.93
        PPP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = meca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |        991       71.86       71.86
        PPP |        377       27.34       99.20
        APA |          9        0.65       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mecc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,362       98.77       98.77
        PPP |         17        1.23      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mphc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,361       98.69       98.69
        PPP |         17        1.23       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = msra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,361       98.69       98.69
        PPP |         18        1.31      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupa

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,362       98.77       98.77
        PPP |         15        1.09       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,331       96.52       96.52
        PPP |         44        3.19       99.71
        APA |          3        0.22       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qacb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,331       96.52       96.52
        PPA |         44        3.19       99.71
        APA |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaccsmr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,315       95.36       95.36
        PPP |         50        3.63       98.98
        APA |         11        0.80       99.78
        APP |          2        0.15       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = sat4

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,325       96.08       96.08
        PPP |         49        3.55       99.64
        APA |          4        0.29       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = str

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,375       99.71       99.71
        PPP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetk

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,264       91.66       91.66
        PPP |         99        7.18       98.84
        APA |         12        0.87       99.71
        APP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetl

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,376       99.78       99.78
        PPP |          2        0.15       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetm

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,339       97.10       97.10
        PPP |         36        2.61       99.71
        PAP |          2        0.15       99.85
        APA |          1        0.07       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = teto

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vana

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgaa

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,378       99.93       99.93
        PPP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgab

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgba

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = dfrb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,294       93.84       93.84
        PPP |         82        5.95       99.78
        APA |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = fusa

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,300       94.27       94.27
        PPP |         57        4.13       98.40
        APA |         20        1.45       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = grla

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,069       77.52       77.52
        PPP |        302       21.90       99.42
        PAP |          4        0.29       99.71
        APA |          3        0.22       99.93
        AAP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = gyra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,081       78.39       78.39
        PPP |        214       15.52       93.91
        PAP |         77        5.58       99.49
        APA |          6        0.44       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = iles

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = rpob

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,348       97.75       97.75
        PPP |         24        1.74       99.49
        APA |          7        0.51      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |        972       70.49       70.49
        PPP |        365       26.47       96.95
        APA |         39        2.83       99.78
        APP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |        946       68.60       68.60
        PPP |        336       24.37       92.97
        APA |         65        4.71       97.68
        APP |         31        2.25       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,326       96.16       96.16
        PPP |         23        1.67       97.82
        APA |         20        1.45       99.27
        PPA |          9        0.65       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,326       96.16       96.16
        APA |         29        2.10       98.26
        PPA |         22        1.60       99.85
        PPP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,327       96.23       96.23
        APA |         27        1.96       98.19
        PPP |         18        1.31       99.49
        PPA |          6        0.44       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,372       99.49       99.49
        PPP |          6        0.44       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,369       99.27       99.27
        PPA |          6        0.44       99.71
        APA |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,372       99.49       99.49
        PPA |          6        0.44       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcd

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,372       99.49       99.49
        PPA |          6        0.44       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = chp

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        883       64.03       64.03
        AAA |        394       28.57       92.60
        APA |         56        4.06       96.66
        APP |         46        3.34      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = eta

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,329       96.37       96.37
        PPP |         40        2.90       99.27
        APA |         10        0.73      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,365       98.98       98.98
        APA |          8        0.58       99.56
        PPP |          5        0.36       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etd

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,313       95.21       95.21
        PPP |         57        4.13       99.35
        APA |          8        0.58       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukm

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,367       99.13       99.13
        PPP |          9        0.65       99.78
        APA |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukmf

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,366       99.06       99.06
        PPA |          6        0.44       99.49
        APA |          4        0.29       99.78
        PPP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvf

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,254       90.94       90.94
        PPP |        111        8.05       98.98
        APA |         14        1.02      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvs

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,255       91.01       91.01
        PPP |        109        7.90       98.91
        APA |         14        1.02       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sak

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |      1,065       77.23       77.23
        AAA |        246       17.84       95.07
        APA |         63        4.57       99.64
        APP |          5        0.36      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sasx

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,361       98.69       98.69
        PPA |         14        1.02       99.71
        APA |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = scn

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |      1,217       88.25       88.25
        AAA |        132        9.57       97.82
        APA |         15        1.09       98.91
        APP |         15        1.09      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sea

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,032       74.84       74.84
        PPP |        295       21.39       96.23
        APA |         49        3.55       99.78
        APP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,254       90.94       90.94
        PPP |        109        7.90       98.84
        APA |         14        1.02       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sec

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,122       81.36       81.36
        PPP |        225       16.32       97.68
        APA |         28        2.03       99.71
        APP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sed

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,287       93.33       93.33
        PPP |         66        4.79       98.11
        APA |         26        1.89      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = see

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,370       99.35       99.35
        APA |          5        0.36       99.71
        PPP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seg

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        753       54.60       54.60
        AAA |        548       39.74       94.34
        APA |         58        4.21       98.55
        APP |         20        1.45      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seh

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,207       87.53       87.53
        PPP |        134        9.72       97.24
        APA |         36        2.61       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sei

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        741       53.73       53.73
        AAA |        557       40.39       94.13
        APA |         42        3.05       97.17
        APP |         33        2.39       99.56
        PPA |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sej

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,282       92.97       92.97
        PPP |         69        5.00       97.97
        APA |         28        2.03      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = selr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,285       93.18       93.18
        PPP |         67        4.86       98.04
        APA |         27        1.96      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sep

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,236       89.63       89.63
        PPP |        108        7.83       97.46
        APA |         32        2.32       99.78
        APP |          2        0.15       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seu

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        725       52.57       52.57
        AAA |        567       41.12       93.69
        APP |         57        4.13       97.82
        APA |         30        2.18      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = tsst1

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,081       78.39       78.39
        PPP |        255       18.49       96.88
        APA |         39        2.83       99.71
        APP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00


. 
. 
. 
. noi tab site Value A
variable A not found
r(111);

. 
. 
. 
. save pipeline_clean_all_values_wide, replace
(note: file pipeline_clean_all_values_wide.dta not found)
file pipeline_clean_all_values_wide.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. noi tab site ValueA

               |                                   ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPA        PPP |     Total
---------------+-----------------------------------------------------------------------------+----------
      aac6aph2 |     1,299          0          3          1          0          0         76 |     1,379 
    aaddaph4ia |     1,286          0          7          0          0          0         86 |     1,379 
    aadeant6ia |     1,356          0          0          2          0          0         21 |     1,379 
        ant9ia |     1,228          0          3          3          5          0        140 |     1,379 
        ant9ib |     1,379          0          0          0          0          0          0 |     1,379 
        aph2ic |     1,379          0          0          0          0          0          0 |     1,379 
  apha3aph3iii |     1,326          0          1          1          0          0         51 |     1,379 
          arca |     1,372          0          1          0          0          0          6 |     1,379 
          arcb |     1,369          0          4          0          0          6          0 |     1,379 
          arcc |     1,372          0          1          0          0          6          0 |     1,379 
          arcd |     1,372          0          1          0          0          6          0 |     1,379 
          blaz |       230          0         11          7          1          1      1,129 |     1,379 
           cat |     1,379          0          0          0          0          0          0 |     1,379 
          ccra |       972          0         39          3          0          0        365 |     1,379 
          ccrb |       946          0         65         31          0          1        336 |     1,379 
         ccrca |     1,326          0         20          1          0          9         23 |     1,379 
         ccrcb |     1,326          0         29          0          0         22          2 |     1,379 
         ccrcc |     1,327          0         27          1          0          6         18 |     1,379 
           cfr |     1,375          0          1          1          0          0          2 |     1,379 
           chp |       394          0         56         46          0          0        883 |     1,379 
          dfra |     1,340          0          4          0          0          1         34 |     1,379 
          dfrb |     1,294          0          3          0          0          0         82 |     1,379 
          dfrc |     1,339          0          2          3          0         34          1 |     1,379 
          dfrd |     1,379          0          0          0          0          0          0 |     1,379 
          dfrg |     1,325          0          1          0          0          0         53 |     1,379 
          dfrk |     1,373          0          0          0          5          0          1 |     1,379 
          erma |     1,222          0          8          5          0          0        144 |     1,379 
          ermb |     1,375          0          1          0          0          0          3 |     1,379 
          ermc |     1,181          0         20          2          0          0        176 |     1,379 
          ermt |     1,359          0          0          0          0          0         20 |     1,379 
          ermy |     1,379          0          0          0          0          0          0 |     1,379 
           eta |     1,329          0         10          0          0          0         40 |     1,379 
           etb |     1,365          0          8          1          0          0          5 |     1,379 
           etd |     1,313          0          8          1          0          0         57 |     1,379 
          fusa |     1,300          0         20          2          0          0         57 |     1,379 
          fusb |     1,352          0          5          0          0          0         22 |     1,379 
          fusc |     1,300          0          3          2          0          0         74 |     1,379 
          grla |     1,069          1          3          0          4          0        302 |     1,379 
          gyra |     1,081          0          6          0         77          1        214 |     1,379 
          iles |     1,379          0          0          0          0          0          0 |     1,379 
          isab |     1,379          0          0          0          0          0          0 |     1,379 
          lnua |     1,364          6          0          0          0          0          9 |     1,379 
          lnub |     1,377          0          1          0          0          0          1 |     1,379 
          lukm |     1,367          0          3          0          0          0          9 |     1,379 
         lukmf |     1,366          0          4          0          0          6          3 |     1,379 
        lukpvf |     1,254          0         14          0          0          0        111 |     1,379 
        lukpvs |     1,255          0         14          1          0          0        109 |     1,379 
          meca |       991          0          9          2          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0         17 |     1,379 
          mphc |     1,361          0          1          0          0          0         17 |     1,379 
          msra |     1,361          0          0          0          0          0         18 |     1,379 
          mupa |     1,362          0          0          2          0          0         15 |     1,379 
          mupb |     1,379          0          0          0          0          0          0 |     1,379 
          qaca |     1,331          0          3          1          0          0         44 |     1,379 
          qacb |     1,331          0          4          0          0         44          0 |     1,379 
       qaccsmr |     1,315          0         11          2          0          1         50 |     1,379 
          rpob |     1,348          0          7          0          0          0         24 |     1,379 
           sak |       246          0         63          5          0          0      1,065 |     1,379 
          sasx |     1,361          0          4          0          0         14          0 |     1,379 
          sat4 |     1,325          0          4          1          0          0         49 |     1,379 
           scn |       132          0         15         15          0          0      1,217 |     1,379 
           sea |     1,032          0         49          3          0          0        295 |     1,379 
           seb |     1,254          0         14          2          0          0        109 |     1,379 
           sec |     1,122          0         28          4          0          0        225 |     1,379 
           sed |     1,287          0         26          0          0          0         66 |     1,379 
           see |     1,370          0          5          0          0          0          4 |     1,379 
           seg |       548          0         58         20          0          0        753 |     1,379 
           seh |     1,207          0         36          2          0          0        134 |     1,379 
           sei |       557          0         42         33          0          6        741 |     1,379 
           sej |     1,282          0         28          0          0          0         69 |     1,379 
          selr |     1,285          0         27          0          0          0         67 |     1,379 
           sep |     1,236          0         32          2          0          1        108 |     1,379 
           seu |       567          0         30         57          0          0        725 |     1,379 
           str |     1,375          0          0          0          0          0          4 |     1,379 
          tetk |     1,264          0         12          4          0          0         99 |     1,379 
          tetl |     1,376          0          1          0          0          0          2 |     1,379 
          tetm |     1,339          0          1          1          2          0         36 |     1,379 
          teto |     1,379          0          0          0          0          0          0 |     1,379 
         tsst1 |     1,081          0         39          4          0          0        255 |     1,379 
          vana |     1,379          0          0          0          0          0          0 |     1,379 
          vanb |     1,379          0          0          0          0          0          0 |     1,379 
          vanc |     1,379          0          0          0          0          0          0 |     1,379 
          vgaa |     1,378          0          0          0          0          0          1 |     1,379 
          vgab |     1,379          0          0          0          0          0          0 |     1,379 
          vgba |     1,379          0          0          0          0          0          0 |     1,379 
---------------+-----------------------------------------------------------------------------+----------
         Total |   104,468          7        956        274         94        165     11,251 |   117,215 


. 
. 
. 
. save pipeline_clean_all_values_wide, replace
file pipeline_clean_all_values_wide.dta saved

. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. 
. 
. ************************

. 
. * add antibiotic relevance to sites

. 
. ************************

. 
. use pipeline_clean_all_values_long, clear

. gen antibiotic =""
(351,645 missing values generated)

. 
. replace antibiotic = "ciprofloxacin" if inlist(site, "gyra","gryb", "grla", "grlb")
variable antibiotic was str1 now str13
(8,274 real changes made)

. 
. replace antibiotic = "erythromycinclindamycin" if inlist(site, "erma", "ermb", "ermc", "ermt", "ermy")
variable antibiotic was str13 now str23
(20,685 real changes made)

. 
. replace antibiotic = "erythromycin" if inlist(site, "msra", "mphc")
(8,274 real changes made)

. 
. replace antibiotic = "fusidic acid" if inlist(site, "fusb", "fusc", "fusa", "far")
(12,411 real changes made)

. 
. replace antibiotic = "gentamicin" if inlist(site,"aac6aph2", "aph2ic")
(8,274 real changes made)

. 
. replace antibiotic = "methicillinpenicillin" if inlist(site,"meca", "mecc")
(8,274 real changes made)

. 
. replace antibiotic = "mupirocin" if inlist(site, "mupa", "mupb")
(8,274 real changes made)

. 
. replace antibiotic = "penicillin" if site=="blaz"
(4,137 real changes made)

. 
. replace antibiotic = "rifampicin" if site=="rpob"
(4,137 real changes made)

. 
. replace antibiotic = "tetracycline" if inlist(site, "tetk", "tetl", "tetm", "teto")
(16,548 real changes made)

. 
. replace antibiotic = "trimethoprim" if inlist(site, "dfra", "dfrc", "dfrb", "dfrb","dfrg", "dfrk")
(20,685 real changes made)

. 
. replace antibiotic = "vancomycin" if inlist(site, "vana", "vanb", "vanc")
(12,411 real changes made)

. 
. 
. tab antibiotics
variable antibiotics not found
r(111);

. tab antibiotic

             antibiotic |      Freq.     Percent        Cum.
------------------------+-----------------------------------
          ciprofloxacin |      8,274        6.25        6.25
           erythromycin |      8,274        6.25       12.50
erythromycinclindamycin |     20,685       15.63       28.13
           fusidic acid |     12,411        9.38       37.50
             gentamicin |      8,274        6.25       43.75
  methicillinpenicillin |      8,274        6.25       50.00
              mupirocin |      8,274        6.25       56.25
             penicillin |      4,137        3.13       59.38
             rifampicin |      4,137        3.13       62.50
           tetracycline |     16,548       12.50       75.00
           trimethoprim |     20,685       15.63       90.63
             vancomycin |     12,411        9.38      100.00
------------------------+-----------------------------------
                  Total |    132,384      100.00

. tab antibiotic, m sort

             antibiotic |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                        |    219,261       62.35       62.35
erythromycinclindamycin |     20,685        5.88       68.24
           trimethoprim |     20,685        5.88       74.12
           tetracycline |     16,548        4.71       78.82
           fusidic acid |     12,411        3.53       82.35
             vancomycin |     12,411        3.53       85.88
          ciprofloxacin |      8,274        2.35       88.24
           erythromycin |      8,274        2.35       90.59
             gentamicin |      8,274        2.35       92.94
  methicillinpenicillin |      8,274        2.35       95.29
              mupirocin |      8,274        2.35       97.65
             penicillin |      4,137        1.18       98.82
             rifampicin |      4,137        1.18      100.00
------------------------+-----------------------------------
                  Total |    351,645      100.00

. keep if antibiotic!=""
(219,261 observations deleted)

. 
. compress
  variable site was str14 now str8
  variable value was str34 now str1
  (5,162,976 bytes saved)

. 
. gen marker = (cleanvalue=="P")
cleanvalue not found
r(111);

. 
. drop site set comments type
variable comments not found
r(111);

. keep if antibiotic!=""
(0 observations deleted)

. 
. compress
  (0 bytes saved)

. 
. gen marker = (value=="P")

. 
. drop site set type

. drop if marker!=1
(122,969 observations deleted)

. use pipeline_clean_all_values_long, clear

. 
. 
. 
. gen antibiotic =""
(351,645 missing values generated)

. 
. replace antibiotic = "ciprofloxacin" if inlist(site, "gyra","gryb", "grla", "grlb")
variable antibiotic was str1 now str13
(8,274 real changes made)

. 
. replace antibiotic = "erythromycinclindamycin" if inlist(site, "erma", "ermb", "ermc", "ermt", "ermy")
variable antibiotic was str13 now str23
(20,685 real changes made)

. 
. replace antibiotic = "erythromycin" if inlist(site, "msra", "mphc")
(8,274 real changes made)

. 
. replace antibiotic = "fusidic acid" if inlist(site, "fusb", "fusc", "fusa", "far")
(12,411 real changes made)

. 
. replace antibiotic = "gentamicin" if inlist(site,"aac6aph2", "aph2ic")
(8,274 real changes made)

. 
. replace antibiotic = "methicillinpenicillin" if inlist(site,"meca", "mecc")
(8,274 real changes made)

. 
. replace antibiotic = "mupirocin" if inlist(site, "mupa", "mupb")
(8,274 real changes made)

. 
. replace antibiotic = "penicillin" if site=="blaz"
(4,137 real changes made)

. 
. replace antibiotic = "rifampicin" if site=="rpob"
(4,137 real changes made)

. 
. replace antibiotic = "tetracycline" if inlist(site, "tetk", "tetl", "tetm", "teto")
(16,548 real changes made)

. 
. replace antibiotic = "trimethoprim" if inlist(site, "dfra", "dfrc", "dfrb", "dfrb","dfrg", "dfrk")
(20,685 real changes made)

. 
. replace antibiotic = "vancomycin" if inlist(site, "vana", "vanb", "vanc")
(12,411 real changes made)

. 
. 
. 
. ******* keep just antibiotics

. 
. 
. 
. keep if antibiotic!=""
(219,261 observations deleted)

. 
. compress
  variable site was str14 now str8
  variable value was str34 now str1
  (5,162,976 bytes saved)

. 
. gen marker = (value=="P")

. 
. drop site set type

. 
. 
. 
. * collapse by antibiotic, so that one record per antibiotic/sample/method

. 
. bysort sample method antibiotic: egen maxmarker= max(marker)

. 
. duplicates drop sample method antibiotic maxmarker, force

Duplicates in terms of sample method antibiotic maxmarker

(82,740 observations deleted)

. drop value

. reshape wide maxmarker, i( sample method) j(antibiotic) string
(note: j = ciprofloxacin erythromycin erythromycinclindamycin fusidic acid gentamicin methicillinpenicillin mupirocin penicillin r
> ifampicin tetracycline trimethoprim vancomycin)
variable marker not constant within sample method
    Your data are currently long.  You are performing a reshape wide.  You typed something like

        . reshape wide a b, i(sample method) j(antibiotic)

    There are variables other than a, b, sample method, antibiotic in your data.  They must be constant within sample method
    because that is the only way they can fit into wide data without loss of information.

    The variable or variables listed above are not constant within sample method.  Perhaps the values are in error.  Type
    reshape error for a list of the problem observations.

    Either that, or the values vary because they should vary, in which case you must either add the variables to the list of xij
    variables to be reshaped, or drop them.
r(9);

. drop marker

. * now create wide record, one column per antibiotic and clean up the mult indicators

. 
. reshape wide maxmarker, i( sample method) j(antibiotic) string
(note: j = ciprofloxacin erythromycin erythromycinclindamycin fusidic acid gentamicin methicillinpenicillin mupirocin penicillin r
> ifampicin tetracycline trimethoprim vancomycin)
(note: no data for antibiotic == fusidic)
(note: no data for antibiotic == acid)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    49644   ->    4137
Number of variables                   4   ->      13
j variable (11 values)       antibiotic   ->   (dropped)
xij variables:
                              maxmarker   ->   maxmarkerciprofloxacin maxmarkererythromycin ... maxmarkervancomycin
-----------------------------------------------------------------------------

. use pipeline_clean_all_values_long, clear

. 
. 
. 
. gen antibiotic =""
(351,645 missing values generated)

. 
. replace antibiotic = "ciprofloxacin" if inlist(site, "gyra","gryb", "grla", "grlb")
variable antibiotic was str1 now str13
(8,274 real changes made)

. 
. replace antibiotic = "erythromycinclindamycin" if inlist(site, "erma", "ermb", "ermc", "ermt", "ermy")
variable antibiotic was str13 now str23
(20,685 real changes made)

. 
. replace antibiotic = "erythromycin" if inlist(site, "msra", "mphc")
(8,274 real changes made)

. 
. replace antibiotic = "fusidic_acid" if inlist(site, "fusb", "fusc", "fusa", "far")
(12,411 real changes made)

. 
. replace antibiotic = "gentamicin" if inlist(site,"aac6aph2", "aph2ic")
(8,274 real changes made)

. 
. replace antibiotic = "methicillinpenicillin" if inlist(site,"meca", "mecc")
(8,274 real changes made)

. 
. replace antibiotic = "mupirocin" if inlist(site, "mupa", "mupb")
(8,274 real changes made)

. 
. replace antibiotic = "penicillin" if site=="blaz"
(4,137 real changes made)

. 
. replace antibiotic = "rifampicin" if site=="rpob"
(4,137 real changes made)

. 
. replace antibiotic = "tetracycline" if inlist(site, "tetk", "tetl", "tetm", "teto")
(16,548 real changes made)

. 
. replace antibiotic = "trimethoprim" if inlist(site, "dfra", "dfrc", "dfrb", "dfrb","dfrg", "dfrk")
(20,685 real changes made)

. 
. replace antibiotic = "vancomycin" if inlist(site, "vana", "vanb", "vanc")
(12,411 real changes made)

. 
. 
. 
. ******* keep just antibiotics

. 
. 
. 
. keep if antibiotic!=""
(219,261 observations deleted)

. 
. compress
  variable site was str14 now str8
  variable value was str34 now str1
  (5,162,976 bytes saved)

. 
. gen marker = (value=="P")

. 
. drop site set type

. 
. 
. 
. * collapse by antibiotic, so that one record per antibiotic/sample/method

. 
. bysort sample method antibiotic: egen maxmarker= max(marker)

. 
. duplicates drop sample method antibiotic maxmarker, force

Duplicates in terms of sample method antibiotic maxmarker

(82,740 observations deleted)

. 
. drop value marker

. 
. 
. 
. 
. 
. * now create wide record, one column per antibiotic and clean up the mult indicators

. 
. reshape wide maxmarker, i( sample method) j(antibiotic) string
(note: j = ciprofloxacin erythromycin erythromycinclindamycin fusidic_acid gentamicin methicillinpenicillin mupirocin penicillin r
> ifampicin tetracycline trimethoprim vancomycin)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    49644   ->    4137
Number of variables                   4   ->      14
j variable (12 values)       antibiotic   ->   (dropped)
xij variables:
                              maxmarker   ->   maxmarkerciprofloxacin maxmarkererythromycin ... maxmarkervancomycin
-----------------------------------------------------------------------------

. 
. * clean up multiple indicators

. 
. rename maxmarker* *

. 
. replace erythromycin = 1 if (erythromycinclindamycin==1)
(1,034 real changes made)

. 
. rename erythromycinclindamycin clindamycin

. 
. gen methicillin =  methicillinpenicillin

. 
. replace penicillin = 1 if  methicillinpenicillin==1
(81 real changes made)

. 
. drop methicillinpenicillin

. * reshape to long for purposes of merge later

. 
. rename * predict*

. 
. rename (predictsample predictmethod) (sample method)

. 
. 
. 
. reshape long predict, i(sample method) j(Antibiotic) string
(note: j = ciprofloxacin clindamycin erythromycin fusidic_acid gentamicin methicillin mupirocin penicillin rifampicin tetracycline
>  trimethoprim vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     4137   ->   49644
Number of variables                  14   ->       4
j variable (12 values)                    ->   Antibiotic
xij variables:
predictciprofloxacin predictclindamycin ... predictvancomycin->predict
-----------------------------------------------------------------------------

. 
. gen predict2 = "R" if predict==1
(40,120 missing values generated)

. 
. replace predict2 ="S" if inlist(predict,.,0)
(40,120 real changes made)

. use pipeline_clean_all_values_long, clear

. 
. 
. 
. gen antibiotic =""
(351,645 missing values generated)

. 
. replace antibiotic = "ciprofloxacin" if inlist(site, "gyra","gryb", "grla", "grlb")
variable antibiotic was str1 now str13
(8,274 real changes made)

. 
. replace antibiotic = "erythromycinclindamycin" if inlist(site, "erma", "ermb", "ermc", "ermt", "ermy")
variable antibiotic was str13 now str23
(20,685 real changes made)

. 
. replace antibiotic = "erythromycin" if inlist(site, "msra", "mphc")
(8,274 real changes made)

. 
. replace antibiotic = "fusidic_acid" if inlist(site, "fusb", "fusc", "fusa", "far")
(12,411 real changes made)

. 
. replace antibiotic = "gentamicin" if inlist(site,"aac6aph2", "aph2ic")
(8,274 real changes made)

. 
. replace antibiotic = "methicillinpenicillin" if inlist(site,"meca", "mecc")
(8,274 real changes made)

. 
. replace antibiotic = "mupirocin" if inlist(site, "mupa", "mupb")
(8,274 real changes made)

. 
. replace antibiotic = "penicillin" if site=="blaz"
(4,137 real changes made)

. 
. replace antibiotic = "rifampicin" if site=="rpob"
(4,137 real changes made)

. 
. replace antibiotic = "tetracycline" if inlist(site, "tetk", "tetl", "tetm", "teto")
(16,548 real changes made)

. 
. replace antibiotic = "trimethoprim" if inlist(site, "dfra", "dfrc", "dfrb", "dfrb","dfrg", "dfrk")
(20,685 real changes made)

. 
. replace antibiotic = "vancomycin" if inlist(site, "vana", "vanb", "vanc")
(12,411 real changes made)

. 
. 
. 
. ******* keep just antibiotics

. 
. 
. 
. keep if antibiotic!=""
(219,261 observations deleted)

. 
. compress
  variable site was str14 now str8
  variable value was str34 now str1
  (5,162,976 bytes saved)

. 
. gen marker = (value=="P")

. 
. drop site set type

. 
. 
. 
. * collapse by antibiotic, so that one record per antibiotic/sample/method

. 
. bysort sample method antibiotic: egen maxmarker= max(marker)

. 
. duplicates drop sample method antibiotic maxmarker, force

Duplicates in terms of sample method antibiotic maxmarker

(82,740 observations deleted)

. 
. drop value marker

. 
. 
. 
. 
. 
. * now create wide record, one column per antibiotic

. 
. reshape wide maxmarker, i( sample method) j(antibiotic) string
(note: j = ciprofloxacin erythromycin erythromycinclindamycin fusidic_acid gentamicin methicillinpenicillin mupirocin penicillin r
> ifampicin tetracycline trimethoprim vancomycin)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    49644   ->    4137
Number of variables                   4   ->      14
j variable (12 values)       antibiotic   ->   (dropped)
xij variables:
                              maxmarker   ->   maxmarkerciprofloxacin maxmarkererythromycin ... maxmarkervancomycin
-----------------------------------------------------------------------------

. 
. 
. 
. 
. 
. * clean up multiple indicators

. 
. rename maxmarker* *

. 
. replace erythromycin = 1 if (erythromycinclindamycin==1)
(1,034 real changes made)

. 
. rename erythromycinclindamycin clindamycin

. 
. gen methicillin =  methicillinpenicillin

. 
. replace penicillin = 1 if  methicillinpenicillin==1
(81 real changes made)

. 
. drop methicillinpenicillin

. 
. 
. tab sample, m

           Sample_id |      Freq.     Percent        Cum.
---------------------+-----------------------------------
           C00000784 |          3        0.07        0.07
           C00000785 |          3        0.07        0.15
           C00000786 |          3        0.07        0.22
           C00000787 |          3        0.07        0.29
           C00000788 |          3        0.07        0.36
           C00000789 |          3        0.07        0.44
           C00000790 |          3        0.07        0.51
           C00000795 |          3        0.07        0.58
           C00000796 |          3        0.07        0.65
           C00000799 |          3        0.07        0.73
           C00000800 |          3        0.07        0.80
           C00000805 |          3        0.07        0.87
           C00000806 |          3        0.07        0.94
           C00000808 |          3        0.07        1.02
           C00000809 |          3        0.07        1.09
           C00000814 |          3        0.07        1.16
           C00000815 |          3        0.07        1.23
           C00000816 |          3        0.07        1.31
           C00000817 |          3        0.07        1.38
           C00000818 |          3        0.07        1.45
           C00000819 |          3        0.07        1.52
           C00000820 |          3        0.07        1.60
           C00000825 |          3        0.07        1.67
           C00000826 |          3        0.07        1.74
           C00000827 |          3        0.07        1.81
           C00000828 |          3        0.07        1.89
           C00000829 |          3        0.07        1.96
           C00000830 |          3        0.07        2.03
           C00000831 |          3        0.07        2.10
           C00000834 |          3        0.07        2.18
           C00000835 |          3        0.07        2.25
           C00000836 |          3        0.07        2.32
           C00000837 |          3        0.07        2.39
           C00000838 |          3        0.07        2.47
           C00000839 |          3        0.07        2.54
           C00000840 |          3        0.07        2.61
           C00000845 |          3        0.07        2.68
           C00000846 |          3        0.07        2.76
           C00000847 |          3        0.07        2.83
           C00000848 |          3        0.07        2.90
           C00000849 |          3        0.07        2.97
           C00000850 |          3        0.07        3.05
           C00000851 |          3        0.07        3.12
           C00000852 |          3        0.07        3.19
           C00000857 |          3        0.07        3.26
           C00000858 |          3        0.07        3.34
           C00000859 |          3        0.07        3.41
           C00000860 |          3        0.07        3.48
           C00000861 |          3        0.07        3.55
           C00000862 |          3        0.07        3.63
           C00000863 |          3        0.07        3.70
           C00000864 |          3        0.07        3.77
           C00001075 |          3        0.07        3.84
           C00001076 |          3        0.07        3.92
           C00001077 |          3        0.07        3.99
           C00001078 |          3        0.07        4.06
           C00001079 |          3        0.07        4.13
           C00001080 |          3        0.07        4.21
           C00001081 |          3        0.07        4.28
           C00001082 |          3        0.07        4.35
           C00001083 |          3        0.07        4.42
           C00001084 |          3        0.07        4.50
           C00001085 |          3        0.07        4.57
           C00001086 |          3        0.07        4.64
           C00001087 |          3        0.07        4.71
           C00001088 |          3        0.07        4.79
           C00001089 |          3        0.07        4.86
           C00001090 |          3        0.07        4.93
           C00001091 |          3        0.07        5.00
           C00001092 |          3        0.07        5.08
           C00001093 |          3        0.07        5.15
           C00001094 |          3        0.07        5.22
           C00001096 |          3        0.07        5.29
           C00001097 |          3        0.07        5.37
           C00001098 |          3        0.07        5.44
           C00001099 |          3        0.07        5.51
           C00001100 |          3        0.07        5.58
           C00001101 |          3        0.07        5.66
           C00001102 |          3        0.07        5.73
           C00001103 |          3        0.07        5.80
           C00001104 |          3        0.07        5.87
           C00001105 |          3        0.07        5.95
           C00001106 |          3        0.07        6.02
           C00001107 |          3        0.07        6.09
           C00001108 |          3        0.07        6.16
           C00001109 |          3        0.07        6.24
           C00001110 |          3        0.07        6.31
           C00001111 |          3        0.07        6.38
           C00001112 |          3        0.07        6.45
           C00001113 |          3        0.07        6.53
           C00001114 |          3        0.07        6.60
           C00001115 |          3        0.07        6.67
           C00001116 |          3        0.07        6.74
           C00001117 |          3        0.07        6.82
           C00001118 |          3        0.07        6.89
           C00001119 |          3        0.07        6.96
           C00001120 |          3        0.07        7.03
           C00001121 |          3        0.07        7.11
           C00001122 |          3        0.07        7.18
           C00001123 |          3        0.07        7.25
           C00001124 |          3        0.07        7.32
           C00001126 |          3        0.07        7.40
           C00001127 |          3        0.07        7.47
           C00001128 |          3        0.07        7.54
           C00001129 |          3        0.07        7.61
           C00001130 |          3        0.07        7.69
           C00001131 |          3        0.07        7.76
           C00001132 |          3        0.07        7.83
           C00001133 |          3        0.07        7.90
           C00001134 |          3        0.07        7.98
           C00001135 |          3        0.07        8.05
           C00001136 |          3        0.07        8.12
           C00001137 |          3        0.07        8.19
           C00001138 |          3        0.07        8.27
           C00001139 |          3        0.07        8.34
           C00001140 |          3        0.07        8.41
           C00001141 |          3        0.07        8.48
           C00001142 |          3        0.07        8.56
           C00001143 |          3        0.07        8.63
           C00001144 |          3        0.07        8.70
           C00001145 |          3        0.07        8.77
           C00001146 |          3        0.07        8.85
           C00001147 |          3        0.07        8.92
           C00001148 |          3        0.07        8.99
           C00001149 |          3        0.07        9.06
           C00001150 |          3        0.07        9.14
           C00001151 |          3        0.07        9.21
           C00001152 |          3        0.07        9.28
           C00001153 |          3        0.07        9.35
           C00001154 |          3        0.07        9.43
           C00001155 |          3        0.07        9.50
           C00001156 |          3        0.07        9.57
           C00001157 |          3        0.07        9.64
           C00001158 |          3        0.07        9.72
           C00001159 |          3        0.07        9.79
           C00001160 |          3        0.07        9.86
           C00001161 |          3        0.07        9.93
           C00001162 |          3        0.07       10.01
           C00001163 |          3        0.07       10.08
           C00001164 |          3        0.07       10.15
           C00001165 |          3        0.07       10.22
           C00001178 |          3        0.07       10.30
           C00001179 |          3        0.07       10.37
           C00001180 |          3        0.07       10.44
           C00001181 |          3        0.07       10.51
           C00001182 |          3        0.07       10.59
           C00001183 |          3        0.07       10.66
           C00001184 |          3        0.07       10.73
           C00001185 |          3        0.07       10.80
           C00001186 |          3        0.07       10.88
           C00001187 |          3        0.07       10.95
           C00001188 |          3        0.07       11.02
           C00001189 |          3        0.07       11.09
           C00001190 |          3        0.07       11.17
           C00001191 |          3        0.07       11.24
           C00001192 |          3        0.07       11.31
           C00001193 |          3        0.07       11.39
           C00001194 |          3        0.07       11.46
           C00001195 |          3        0.07       11.53
           C00001196 |          3        0.07       11.60
           C00001197 |          3        0.07       11.68
           C00001198 |          3        0.07       11.75
           C00001199 |          3        0.07       11.82
           C00001200 |          3        0.07       11.89
           C00001201 |          3        0.07       11.97
           C00001202 |          3        0.07       12.04
           C00001203 |          3        0.07       12.11
           C00001204 |          3        0.07       12.18
           C00001205 |          3        0.07       12.26
           C00001206 |          3        0.07       12.33
           C00001207 |          3        0.07       12.40
           C00001208 |          3        0.07       12.47
           C00001209 |          3        0.07       12.55
           C00001210 |          3        0.07       12.62
           C00001211 |          3        0.07       12.69
           C00001212 |          3        0.07       12.76
           C00001213 |          3        0.07       12.84
           C00001214 |          3        0.07       12.91
           C00001216 |          3        0.07       12.98
           C00001217 |          3        0.07       13.05
           C00001218 |          3        0.07       13.13
           C00001219 |          3        0.07       13.20
           C00001220 |          3        0.07       13.27
           C00001221 |          3        0.07       13.34
           C00001222 |          3        0.07       13.42
           C00001223 |          3        0.07       13.49
           C00001224 |          3        0.07       13.56
           C00001225 |          3        0.07       13.63
           C00001226 |          3        0.07       13.71
           C00001227 |          3        0.07       13.78
           C00001228 |          3        0.07       13.85
           C00001229 |          3        0.07       13.92
           C00001230 |          3        0.07       14.00
           C00001231 |          3        0.07       14.07
           C00001232 |          3        0.07       14.14
           C00001233 |          3        0.07       14.21
           C00001234 |          3        0.07       14.29
           C00001235 |          3        0.07       14.36
           C00001236 |          3        0.07       14.43
           C00001237 |          3        0.07       14.50
           C00001238 |          3        0.07       14.58
           C00001239 |          3        0.07       14.65
           C00001240 |          3        0.07       14.72
           C00001241 |          3        0.07       14.79
           C00001242 |          3        0.07       14.87
           C00001243 |          3        0.07       14.94
           C00001244 |          3        0.07       15.01
           C00001245 |          3        0.07       15.08
           C00001246 |          3        0.07       15.16
           C00001247 |          3        0.07       15.23
           C00001248 |          3        0.07       15.30
           C00001250 |          3        0.07       15.37
           C00001251 |          3        0.07       15.45
           C00001252 |          3        0.07       15.52
           C00001253 |          3        0.07       15.59
           C00001254 |          3        0.07       15.66
           C00001255 |          3        0.07       15.74
           C00001256 |          3        0.07       15.81
           C00001257 |          3        0.07       15.88
           C00001258 |          3        0.07       15.95
           C00001259 |          3        0.07       16.03
           C00001260 |          3        0.07       16.10
           C00001262 |          3        0.07       16.17
           C00001263 |          3        0.07       16.24
           C00001264 |          3        0.07       16.32
           C00001265 |          3        0.07       16.39
           C00001266 |          3        0.07       16.46
           C00001267 |          3        0.07       16.53
           C00001268 |          3        0.07       16.61
           C00001269 |          3        0.07       16.68
           C00001270 |          3        0.07       16.75
           C00001271 |          3        0.07       16.82
           C00001272 |          3        0.07       16.90
           C00001274 |          3        0.07       16.97
           C00001275 |          3        0.07       17.04
           C00001276 |          3        0.07       17.11
           C00001277 |          3        0.07       17.19
           C00001278 |          3        0.07       17.26
           C00001279 |          3        0.07       17.33
           C00001280 |          3        0.07       17.40
           C00001281 |          3        0.07       17.48
           C00001282 |          3        0.07       17.55
           C00001283 |          3        0.07       17.62
           C00001284 |          3        0.07       17.69
           C00001384 |          3        0.07       17.77
           C00001385 |          3        0.07       17.84
           C00001386 |          3        0.07       17.91
           C00001387 |          3        0.07       17.98
           C00001388 |          3        0.07       18.06
           C00001389 |          3        0.07       18.13
           C00001390 |          3        0.07       18.20
           C00001397 |          3        0.07       18.27
           C00001399 |          3        0.07       18.35
           C00001400 |          3        0.07       18.42
           C00001401 |          3        0.07       18.49
           C00001402 |          3        0.07       18.56
           C00001404 |          3        0.07       18.64
           C00001405 |          3        0.07       18.71
           C00001406 |          3        0.07       18.78
           C00001440 |          3        0.07       18.85
           C00001441 |          3        0.07       18.93
           C00001442 |          3        0.07       19.00
           C00001443 |          3        0.07       19.07
           C00001445 |          3        0.07       19.14
           C00001446 |          3        0.07       19.22
           C00001447 |          3        0.07       19.29
           C00001448 |          3        0.07       19.36
           C00001449 |          3        0.07       19.43
           C00001451 |          3        0.07       19.51
           C00001452 |          3        0.07       19.58
           C00001453 |          3        0.07       19.65
           C00002619 |          3        0.07       19.72
           C00002620 |          3        0.07       19.80
           C00002621 |          3        0.07       19.87
           C00002622 |          3        0.07       19.94
           C00002623 |          3        0.07       20.01
           C00002624 |          3        0.07       20.09
           C00002625 |          3        0.07       20.16
           C00002626 |          3        0.07       20.23
           C00002649 |          3        0.07       20.30
           C00002652 |          3        0.07       20.38
           C00002653 |          3        0.07       20.45
           C00002655 |          3        0.07       20.52
           C00002656 |          3        0.07       20.59
           C00002657 |          3        0.07       20.67
           C00002658 |          3        0.07       20.74
           C00002661 |          3        0.07       20.81
           C00002662 |          3        0.07       20.88
           C00003083 |          3        0.07       20.96
           C00003084 |          3        0.07       21.03
           C00003085 |          3        0.07       21.10
           C00003086 |          3        0.07       21.17
           C00003087 |          3        0.07       21.25
           C00003088 |          3        0.07       21.32
           C00003089 |          3        0.07       21.39
           C00003090 |          3        0.07       21.46
           C00003091 |          3        0.07       21.54
           C00003092 |          3        0.07       21.61
           C00003093 |          3        0.07       21.68
           C00003095 |          3        0.07       21.75
           C00003096 |          3        0.07       21.83
           C00003098 |          3        0.07       21.90
           C00003099 |          3        0.07       21.97
           C00003100 |          3        0.07       22.04
           C00003101 |          3        0.07       22.12
           C00003102 |          3        0.07       22.19
           C00003103 |          3        0.07       22.26
           C00003104 |          3        0.07       22.34
           C00003106 |          3        0.07       22.41
           C00003107 |          3        0.07       22.48
           C00003108 |          3        0.07       22.55
           C00003109 |          3        0.07       22.63
           C00003110 |          3        0.07       22.70
           C00003111 |          3        0.07       22.77
           C00003112 |          3        0.07       22.84
           C00003113 |          3        0.07       22.92
           C00003114 |          3        0.07       22.99
           C00003115 |          3        0.07       23.06
           C00003116 |          3        0.07       23.13
           C00003118 |          3        0.07       23.21
           C00003119 |          3        0.07       23.28
           C00003120 |          3        0.07       23.35
           C00003121 |          3        0.07       23.42
           C00003122 |          3        0.07       23.50
           C00003124 |          3        0.07       23.57
           C00003125 |          3        0.07       23.64
           C00003126 |          3        0.07       23.71
           C00003127 |          3        0.07       23.79
           C00003128 |          3        0.07       23.86
           C00003129 |          3        0.07       23.93
           C00003130 |          3        0.07       24.00
           C00003131 |          3        0.07       24.08
           C00003132 |          3        0.07       24.15
           C00003133 |          3        0.07       24.22
           C00003134 |          3        0.07       24.29
           C00003135 |          3        0.07       24.37
           C00003136 |          3        0.07       24.44
           C00003137 |          3        0.07       24.51
           C00003138 |          3        0.07       24.58
           C00003139 |          3        0.07       24.66
           C00003140 |          3        0.07       24.73
           C00003141 |          3        0.07       24.80
           C00003142 |          3        0.07       24.87
           C00003143 |          3        0.07       24.95
           C00003144 |          3        0.07       25.02
           C00003145 |          3        0.07       25.09
           C00003147 |          3        0.07       25.16
           C00003148 |          3        0.07       25.24
           C00003149 |          3        0.07       25.31
           C00003150 |          3        0.07       25.38
           C00003151 |          3        0.07       25.45
           C00003152 |          3        0.07       25.53
           C00003153 |          3        0.07       25.60
           C00003154 |          3        0.07       25.67
           C00003155 |          3        0.07       25.74
           C00003156 |          3        0.07       25.82
           C00003158 |          3        0.07       25.89
           C00003159 |          3        0.07       25.96
           C00003160 |          3        0.07       26.03
           C00003161 |          3        0.07       26.11
           C00003162 |          3        0.07       26.18
           C00003163 |          3        0.07       26.25
           C00003164 |          3        0.07       26.32
           C00003165 |          3        0.07       26.40
           C00003166 |          3        0.07       26.47
           C00003167 |          3        0.07       26.54
           C00003168 |          3        0.07       26.61
           C00003169 |          3        0.07       26.69
           C00003170 |          3        0.07       26.76
           C00003171 |          3        0.07       26.83
           C00003172 |          3        0.07       26.90
           C00003173 |          3        0.07       26.98
           C00003174 |          3        0.07       27.05
           C00003175 |          3        0.07       27.12
           C00003176 |          3        0.07       27.19
           C00003177 |          3        0.07       27.27
           C00003178 |          3        0.07       27.34
           C00003179 |          3        0.07       27.41
           C00003180 |          3        0.07       27.48
           C00003181 |          3        0.07       27.56
           C00003182 |          3        0.07       27.63
           C00003183 |          3        0.07       27.70
           C00003184 |          3        0.07       27.77
           C00003185 |          3        0.07       27.85
           C00003186 |          3        0.07       27.92
           C00003187 |          3        0.07       27.99
           C00003188 |          3        0.07       28.06
           C00003189 |          3        0.07       28.14
           C00003190 |          3        0.07       28.21
           C00003191 |          3        0.07       28.28
           C00003192 |          3        0.07       28.35
           C00003193 |          3        0.07       28.43
           C00003194 |          3        0.07       28.50
           C00003195 |          3        0.07       28.57
           C00003196 |          3        0.07       28.64
           C00003197 |          3        0.07       28.72
           C00003198 |          3        0.07       28.79
           C00003199 |          3        0.07       28.86
           C00003200 |          3        0.07       28.93
           C00003201 |          3        0.07       29.01
           C00003202 |          3        0.07       29.08
           C00003203 |          3        0.07       29.15
           C00003204 |          3        0.07       29.22
           C00003205 |          3        0.07       29.30
           C00003206 |          3        0.07       29.37
           C00003207 |          3        0.07       29.44
           C00003208 |          3        0.07       29.51
           C00003209 |          3        0.07       29.59
           C00003210 |          3        0.07       29.66
           C00003211 |          3        0.07       29.73
           C00003212 |          3        0.07       29.80
           C00003213 |          3        0.07       29.88
           C00003215 |          3        0.07       29.95
           C00003216 |          3        0.07       30.02
           C00003217 |          3        0.07       30.09
           C00003218 |          3        0.07       30.17
           C00003219 |          3        0.07       30.24
           C00003220 |          3        0.07       30.31
           C00003221 |          3        0.07       30.38
           C00003222 |          3        0.07       30.46
           C00003223 |          3        0.07       30.53
           C00003224 |          3        0.07       30.60
           C00003225 |          3        0.07       30.67
           C00003226 |          3        0.07       30.75
           C00003227 |          3        0.07       30.82
           C00003228 |          3        0.07       30.89
           C00003229 |          3        0.07       30.96
           C00003231 |          3        0.07       31.04
           C00003232 |          3        0.07       31.11
           C00003233 |          3        0.07       31.18
           C00003235 |          3        0.07       31.25
           C00003236 |          3        0.07       31.33
           C00003237 |          3        0.07       31.40
           C00003238 |          3        0.07       31.47
           C00003239 |          3        0.07       31.54
           C00003240 |          3        0.07       31.62
           C00003241 |          3        0.07       31.69
           C00003242 |          3        0.07       31.76
           C00003243 |          3        0.07       31.83
           C00003244 |          3        0.07       31.91
           C00003245 |          3        0.07       31.98
           C00003246 |          3        0.07       32.05
           C00003247 |          3        0.07       32.12
           C00003248 |          3        0.07       32.20
           C00003249 |          3        0.07       32.27
           C00003250 |          3        0.07       32.34
           C00003251 |          3        0.07       32.41
           C00003252 |          3        0.07       32.49
           C00003253 |          3        0.07       32.56
           C00003254 |          3        0.07       32.63
           C00003255 |          3        0.07       32.70
           C00003256 |          3        0.07       32.78
           C00003257 |          3        0.07       32.85
           C00003258 |          3        0.07       32.92
           C00003259 |          3        0.07       32.99
           C00003260 |          3        0.07       33.07
           C00003261 |          3        0.07       33.14
           C00003262 |          3        0.07       33.21
           C00003263 |          3        0.07       33.28
           C00003264 |          3        0.07       33.36
           C00003265 |          3        0.07       33.43
           C00003266 |          3        0.07       33.50
           C00003267 |          3        0.07       33.58
           C00003268 |          3        0.07       33.65
           C00003269 |          3        0.07       33.72
           C00003270 |          3        0.07       33.79
           C00003271 |          3        0.07       33.87
           C00003272 |          3        0.07       33.94
           C00003274 |          3        0.07       34.01
           C00003275 |          3        0.07       34.08
           C00003276 |          3        0.07       34.16
           C00003277 |          3        0.07       34.23
           C00003278 |          3        0.07       34.30
           C00003279 |          3        0.07       34.37
           C00003280 |          3        0.07       34.45
           C00003281 |          3        0.07       34.52
           C00003282 |          3        0.07       34.59
           C00003283 |          3        0.07       34.66
           C00003284 |          3        0.07       34.74
           C00003285 |          3        0.07       34.81
           C00003286 |          3        0.07       34.88
           C00003287 |          3        0.07       34.95
           C00003288 |          3        0.07       35.03
           C00003289 |          3        0.07       35.10
           C00003290 |          3        0.07       35.17
           C00003291 |          3        0.07       35.24
           C00003292 |          3        0.07       35.32
           C00003294 |          3        0.07       35.39
           C00003295 |          3        0.07       35.46
           C00003296 |          3        0.07       35.53
           C00003298 |          3        0.07       35.61
           C00003299 |          3        0.07       35.68
           C00003301 |          3        0.07       35.75
           C00003302 |          3        0.07       35.82
           C00003303 |          3        0.07       35.90
           C00003304 |          3        0.07       35.97
           C00003305 |          3        0.07       36.04
           C00003306 |          3        0.07       36.11
           C00003307 |          3        0.07       36.19
           C00003308 |          3        0.07       36.26
           C00003309 |          3        0.07       36.33
           C00003310 |          3        0.07       36.40
           C00003311 |          3        0.07       36.48
           C00003312 |          3        0.07       36.55
           C00003313 |          3        0.07       36.62
           C00003314 |          3        0.07       36.69
           C00003315 |          3        0.07       36.77
           C00003316 |          3        0.07       36.84
           C00003317 |          3        0.07       36.91
           C00003318 |          3        0.07       36.98
           C00003319 |          3        0.07       37.06
           C00003320 |          3        0.07       37.13
           C00003321 |          3        0.07       37.20
           C00003322 |          3        0.07       37.27
           C00003323 |          3        0.07       37.35
           C00003324 |          3        0.07       37.42
           C00003325 |          3        0.07       37.49
           C00003328 |          3        0.07       37.56
           C00003329 |          3        0.07       37.64
           C00003330 |          3        0.07       37.71
           C00003332 |          3        0.07       37.78
           C00003333 |          3        0.07       37.85
           C00003334 |          3        0.07       37.93
           C00003335 |          3        0.07       38.00
           C00003336 |          3        0.07       38.07
           C00003337 |          3        0.07       38.14
           C00003338 |          3        0.07       38.22
           C00003339 |          3        0.07       38.29
           C00003340 |          3        0.07       38.36
           C00003341 |          3        0.07       38.43
           C00003343 |          3        0.07       38.51
           C00003344 |          3        0.07       38.58
           C00003345 |          3        0.07       38.65
           C00003346 |          3        0.07       38.72
           C00003347 |          3        0.07       38.80
           C00003348 |          3        0.07       38.87
           C00003349 |          3        0.07       38.94
           C00003350 |          3        0.07       39.01
           C00003351 |          3        0.07       39.09
           C00003352 |          3        0.07       39.16
           C00003353 |          3        0.07       39.23
           C00003354 |          3        0.07       39.30
           C00003355 |          3        0.07       39.38
           C00003356 |          3        0.07       39.45
           C00003357 |          3        0.07       39.52
           C00003358 |          3        0.07       39.59
           C00003359 |          3        0.07       39.67
           C00003360 |          3        0.07       39.74
           C00003361 |          3        0.07       39.81
           C00003362 |          3        0.07       39.88
           C00003363 |          3        0.07       39.96
           C00003364 |          3        0.07       40.03
           C00003365 |          3        0.07       40.10
           C00003366 |          3        0.07       40.17
           C00003367 |          3        0.07       40.25
           C00003368 |          3        0.07       40.32
           C00003369 |          3        0.07       40.39
           C00003370 |          3        0.07       40.46
           C00003371 |          3        0.07       40.54
           C00003372 |          3        0.07       40.61
           C00003373 |          3        0.07       40.68
           C00003374 |          3        0.07       40.75
           C00003375 |          3        0.07       40.83
           C00003376 |          3        0.07       40.90
           C00003377 |          3        0.07       40.97
           C00003378 |          3        0.07       41.04
           C00003379 |          3        0.07       41.12
           C00003380 |          3        0.07       41.19
           C00003381 |          3        0.07       41.26
           C00003382 |          3        0.07       41.33
           C00003383 |          3        0.07       41.41
           C00003384 |          3        0.07       41.48
           C00003385 |          3        0.07       41.55
           C00003386 |          3        0.07       41.62
           C00003387 |          3        0.07       41.70
           C00003388 |          3        0.07       41.77
           C00003389 |          3        0.07       41.84
           C00003390 |          3        0.07       41.91
           C00003391 |          3        0.07       41.99
           C00003392 |          3        0.07       42.06
           C00003393 |          3        0.07       42.13
           C00003394 |          3        0.07       42.20
           C00003395 |          3        0.07       42.28
           C00003396 |          3        0.07       42.35
           C00003397 |          3        0.07       42.42
           C00003398 |          3        0.07       42.49
           C00003399 |          3        0.07       42.57
           C00003400 |          3        0.07       42.64
           C00003402 |          3        0.07       42.71
           C00003403 |          3        0.07       42.78
           C00003404 |          3        0.07       42.86
           C00003405 |          3        0.07       42.93
           C00003406 |          3        0.07       43.00
           C00003407 |          3        0.07       43.07
           C00003408 |          3        0.07       43.15
           C00003409 |          3        0.07       43.22
           C00003410 |          3        0.07       43.29
           C00003411 |          3        0.07       43.36
           C00003412 |          3        0.07       43.44
           C00003413 |          3        0.07       43.51
           C00003414 |          3        0.07       43.58
           C00003415 |          3        0.07       43.65
           C00003417 |          3        0.07       43.73
           C00003418 |          3        0.07       43.80
           C00003419 |          3        0.07       43.87
           C00003420 |          3        0.07       43.94
           C00003421 |          3        0.07       44.02
           C00003422 |          3        0.07       44.09
           C00003423 |          3        0.07       44.16
           C00003424 |          3        0.07       44.23
           C00003425 |          3        0.07       44.31
           C00007061 |          3        0.07       44.38
           C00007062 |          3        0.07       44.45
           C00007063 |          3        0.07       44.53
           C00007064 |          3        0.07       44.60
           C00007065 |          3        0.07       44.67
           C00007066 |          3        0.07       44.74
           C00007067 |          3        0.07       44.82
           C00007068 |          3        0.07       44.89
           C00007069 |          3        0.07       44.96
           C00007070 |          3        0.07       45.03
           C00007071 |          3        0.07       45.11
           C00007072 |          3        0.07       45.18
           C00007073 |          3        0.07       45.25
           C00007074 |          3        0.07       45.32
           C00007075 |          3        0.07       45.40
           C00007076 |          3        0.07       45.47
           C00007077 |          3        0.07       45.54
           C00007078 |          3        0.07       45.61
           C00007079 |          3        0.07       45.69
           C00007080 |          3        0.07       45.76
           C00007081 |          3        0.07       45.83
           C00007082 |          3        0.07       45.90
           C00007083 |          3        0.07       45.98
           C00007085 |          3        0.07       46.05
           C00007086 |          3        0.07       46.12
           C00007087 |          3        0.07       46.19
           C00007089 |          3        0.07       46.27
           C00007091 |          3        0.07       46.34
           C00007092 |          3        0.07       46.41
           C00007093 |          3        0.07       46.48
           C00007094 |          3        0.07       46.56
           C00007095 |          3        0.07       46.63
           C00007096 |          3        0.07       46.70
           C00007097 |          3        0.07       46.77
           C00007098 |          3        0.07       46.85
           C00007099 |          3        0.07       46.92
           C00007100 |          3        0.07       46.99
           C00007101 |          3        0.07       47.06
           C00007102 |          3        0.07       47.14
           C00007103 |          3        0.07       47.21
           C00007104 |          3        0.07       47.28
           C00007105 |          3        0.07       47.35
           C00007106 |          3        0.07       47.43
           C00007107 |          3        0.07       47.50
           C00007108 |          3        0.07       47.57
           C00007109 |          3        0.07       47.64
           C00007110 |          3        0.07       47.72
           C00007111 |          3        0.07       47.79
           C00007112 |          3        0.07       47.86
           C00007113 |          3        0.07       47.93
           C00007114 |          3        0.07       48.01
           C00007116 |          3        0.07       48.08
           C00008625 |          3        0.07       48.15
           C00008626 |          3        0.07       48.22
           C00008627 |          3        0.07       48.30
           C00008628 |          3        0.07       48.37
           C00008629 |          3        0.07       48.44
           C00008630 |          3        0.07       48.51
           C00008632 |          3        0.07       48.59
           C00008633 |          3        0.07       48.66
           C00008635 |          3        0.07       48.73
           C00008636 |          3        0.07       48.80
           C00008637 |          3        0.07       48.88
           C00008638 |          3        0.07       48.95
           C00008946 |          3        0.07       49.02
           C00008947 |          3        0.07       49.09
           C00008948 |          3        0.07       49.17
           C00008949 |          3        0.07       49.24
           C00008958 |          3        0.07       49.31
           C00008959 |          3        0.07       49.38
           C00008960 |          3        0.07       49.46
           C00008970 |          3        0.07       49.53
           C00008971 |          3        0.07       49.60
           C00008972 |          3        0.07       49.67
           C00008973 |          3        0.07       49.75
           C00008982 |          3        0.07       49.82
           C00008984 |          3        0.07       49.89
           C00008985 |          3        0.07       49.96
           C00008994 |          3        0.07       50.04
           C00008996 |          3        0.07       50.11
           C00008997 |          3        0.07       50.18
           C00009006 |          3        0.07       50.25
           C00009008 |          3        0.07       50.33
           C00009017 |          3        0.07       50.40
           C00009018 |          3        0.07       50.47
           C00009020 |          3        0.07       50.54
           C00009021 |          3        0.07       50.62
           C00009029 |          3        0.07       50.69
           C00009030 |          3        0.07       50.76
           C00009033 |          3        0.07       50.83
           C00012736 |          3        0.07       50.91
           C00012737 |          3        0.07       50.98
           C00012738 |          3        0.07       51.05
           C00012739 |          3        0.07       51.12
           C00012740 |          3        0.07       51.20
           C00012741 |          3        0.07       51.27
           C00012742 |          3        0.07       51.34
           C00012743 |          3        0.07       51.41
           C00012744 |          3        0.07       51.49
           C00012745 |          3        0.07       51.56
           C00012747 |          3        0.07       51.63
           C00012748 |          3        0.07       51.70
           C00012749 |          3        0.07       51.78
           C00012750 |          3        0.07       51.85
           C00012751 |          3        0.07       51.92
           C00012752 |          3        0.07       51.99
           C00012753 |          3        0.07       52.07
           C00012754 |          3        0.07       52.14
           C00012755 |          3        0.07       52.21
           C00012756 |          3        0.07       52.28
           C00012757 |          3        0.07       52.36
           C00012758 |          3        0.07       52.43
           C00012759 |          3        0.07       52.50
           C00012760 |          3        0.07       52.57
           C00012761 |          3        0.07       52.65
           C00012762 |          3        0.07       52.72
           C00012763 |          3        0.07       52.79
           C00012764 |          3        0.07       52.86
           C00012765 |          3        0.07       52.94
           C00012766 |          3        0.07       53.01
           C00012767 |          3        0.07       53.08
           C00012768 |          3        0.07       53.15
           C00012769 |          3        0.07       53.23
           C00012770 |          3        0.07       53.30
           C00012771 |          3        0.07       53.37
           C00012772 |          3        0.07       53.44
           C00012773 |          3        0.07       53.52
           C00012774 |          3        0.07       53.59
           C00012775 |          3        0.07       53.66
           C00012776 |          3        0.07       53.73
           C00012777 |          3        0.07       53.81
           C00012778 |          3        0.07       53.88
           C00012779 |          3        0.07       53.95
           C00012780 |          3        0.07       54.02
           C00012781 |          3        0.07       54.10
           C00012782 |          3        0.07       54.17
           C00012783 |          3        0.07       54.24
           C00012784 |          3        0.07       54.31
           C00012785 |          3        0.07       54.39
           C00012786 |          3        0.07       54.46
           C00012787 |          3        0.07       54.53
           C00012788 |          3        0.07       54.60
           C00012789 |          3        0.07       54.68
           C00012790 |          3        0.07       54.75
           C00012792 |          3        0.07       54.82
           C00012793 |          3        0.07       54.89
           C00012795 |          3        0.07       54.97
           C00012796 |          3        0.07       55.04
           C00012797 |          3        0.07       55.11
           C00012798 |          3        0.07       55.18
           C00012799 |          3        0.07       55.26
           C00012800 |          3        0.07       55.33
           C00012801 |          3        0.07       55.40
           C00012802 |          3        0.07       55.47
           C00012803 |          3        0.07       55.55
           C00012804 |          3        0.07       55.62
           C00012805 |          3        0.07       55.69
           C00012806 |          3        0.07       55.77
           C00012807 |          3        0.07       55.84
           C00012808 |          3        0.07       55.91
           C00012809 |          3        0.07       55.98
           C00012810 |          3        0.07       56.06
           C00012811 |          3        0.07       56.13
           C00012812 |          3        0.07       56.20
           C00012814 |          3        0.07       56.27
           C00012815 |          3        0.07       56.35
           C00012816 |          3        0.07       56.42
           C00012817 |          3        0.07       56.49
           C00012818 |          3        0.07       56.56
           C00012819 |          3        0.07       56.64
           C00012820 |          3        0.07       56.71
           C00012821 |          3        0.07       56.78
           C00012822 |          3        0.07       56.85
           C00012823 |          3        0.07       56.93
           C00012824 |          3        0.07       57.00
           C00012825 |          3        0.07       57.07
           C00012826 |          3        0.07       57.14
           C00012827 |          3        0.07       57.22
           C00012828 |          3        0.07       57.29
           C00012829 |          3        0.07       57.36
           C00012830 |          3        0.07       57.43
           C00012831 |          3        0.07       57.51
           C00012832 |          3        0.07       57.58
           C00012833 |          3        0.07       57.65
           C00012834 |          3        0.07       57.72
           C00012835 |          3        0.07       57.80
           C00013156 |          3        0.07       57.87
           C00013157 |          3        0.07       57.94
           C00013158 |          3        0.07       58.01
           C00013159 |          3        0.07       58.09
           C00013160 |          3        0.07       58.16
           C00013161 |          3        0.07       58.23
           C00013162 |          3        0.07       58.30
           C00013163 |          3        0.07       58.38
           C00013164 |          3        0.07       58.45
           C00013165 |          3        0.07       58.52
           C00013166 |          3        0.07       58.59
           C00013167 |          3        0.07       58.67
           C00013168 |          3        0.07       58.74
           C00013169 |          3        0.07       58.81
           C00013170 |          3        0.07       58.88
           C00013171 |          3        0.07       58.96
           C00013172 |          3        0.07       59.03
           C00013173 |          3        0.07       59.10
           C00013174 |          3        0.07       59.17
           C00013175 |          3        0.07       59.25
           C00013176 |          3        0.07       59.32
           C00013177 |          3        0.07       59.39
           C00013178 |          3        0.07       59.46
           C00013179 |          3        0.07       59.54
           C00013180 |          3        0.07       59.61
           C00013181 |          3        0.07       59.68
           C00013182 |          3        0.07       59.75
           C00013183 |          3        0.07       59.83
           C00013184 |          3        0.07       59.90
           C00013185 |          3        0.07       59.97
           C00013186 |          3        0.07       60.04
           C00013187 |          3        0.07       60.12
           C00013188 |          3        0.07       60.19
           C00013189 |          3        0.07       60.26
           C00013190 |          3        0.07       60.33
           C00013191 |          3        0.07       60.41
           C00013192 |          3        0.07       60.48
           C00013193 |          3        0.07       60.55
           C00013194 |          3        0.07       60.62
           C00013195 |          3        0.07       60.70
           C00013196 |          3        0.07       60.77
           C00013197 |          3        0.07       60.84
           C00013198 |          3        0.07       60.91
           C00013199 |          3        0.07       60.99
           C00013200 |          3        0.07       61.06
           C00013201 |          3        0.07       61.13
           C00013202 |          3        0.07       61.20
           C00013203 |          3        0.07       61.28
           C00013204 |          3        0.07       61.35
           C00013205 |          3        0.07       61.42
           C00013206 |          3        0.07       61.49
           C00013207 |          3        0.07       61.57
           C00013208 |          3        0.07       61.64
           C00013209 |          3        0.07       61.71
           C00013210 |          3        0.07       61.78
           C00013211 |          3        0.07       61.86
           C00013212 |          3        0.07       61.93
           C00013213 |          3        0.07       62.00
           C00013214 |          3        0.07       62.07
           C00013215 |          3        0.07       62.15
           C00013216 |          3        0.07       62.22
           C00013217 |          3        0.07       62.29
           C00013218 |          3        0.07       62.36
           C00013219 |          3        0.07       62.44
           C00013220 |          3        0.07       62.51
           C00013221 |          3        0.07       62.58
           C00013223 |          3        0.07       62.65
           C00013224 |          3        0.07       62.73
           C00013225 |          3        0.07       62.80
           C00013226 |          3        0.07       62.87
           C00013227 |          3        0.07       62.94
           C00013228 |          3        0.07       63.02
           C00013229 |          3        0.07       63.09
           C00013230 |          3        0.07       63.16
           C00013231 |          3        0.07       63.23
           C00013232 |          3        0.07       63.31
           C00013233 |          3        0.07       63.38
           C00013234 |          3        0.07       63.45
           C00013235 |          3        0.07       63.52
           C00013236 |          3        0.07       63.60
           C00013237 |          3        0.07       63.67
           C00013238 |          3        0.07       63.74
           C00013239 |          3        0.07       63.81
           C00013240 |          3        0.07       63.89
           C00013241 |          3        0.07       63.96
           C00013242 |          3        0.07       64.03
           C00013243 |          3        0.07       64.10
           C00013244 |          3        0.07       64.18
           C00013245 |          3        0.07       64.25
           C00013246 |          3        0.07       64.32
           C00013247 |          3        0.07       64.39
           C00013248 |          3        0.07       64.47
           C00013249 |          3        0.07       64.54
           C00013250 |          3        0.07       64.61
           C00013251 |          3        0.07       64.68
           C00013313 |          3        0.07       64.76
           C00013314 |          3        0.07       64.83
           C00013315 |          3        0.07       64.90
           C00013316 |          3        0.07       64.97
           C00013317 |          3        0.07       65.05
           C00013318 |          3        0.07       65.12
           C00013319 |          3        0.07       65.19
           C00013320 |          3        0.07       65.26
           C00013321 |          3        0.07       65.34
           C00013322 |          3        0.07       65.41
           C00013323 |          3        0.07       65.48
           C00013324 |          3        0.07       65.55
           C00013325 |          3        0.07       65.63
           C00013326 |          3        0.07       65.70
           C00013327 |          3        0.07       65.77
           C00013328 |          3        0.07       65.84
           C00013329 |          3        0.07       65.92
           C00013330 |          3        0.07       65.99
           C00013331 |          3        0.07       66.06
           C00013332 |          3        0.07       66.13
           C00013333 |          3        0.07       66.21
           C00013334 |          3        0.07       66.28
           C00013335 |          3        0.07       66.35
           C00013336 |          3        0.07       66.42
           C00013337 |          3        0.07       66.50
           C00013338 |          3        0.07       66.57
           C00013339 |          3        0.07       66.64
           C00013340 |          3        0.07       66.72
           C00013341 |          3        0.07       66.79
           C00013342 |          3        0.07       66.86
           C00013343 |          3        0.07       66.93
           C00013344 |          3        0.07       67.01
           C00013345 |          3        0.07       67.08
           C00013346 |          3        0.07       67.15
           C00013347 |          3        0.07       67.22
           C00013348 |          3        0.07       67.30
           C00013349 |          3        0.07       67.37
           C00013350 |          3        0.07       67.44
           C00013351 |          3        0.07       67.51
           C00013352 |          3        0.07       67.59
           C00013353 |          3        0.07       67.66
           C00013354 |          3        0.07       67.73
           C00013355 |          3        0.07       67.80
           C00013357 |          3        0.07       67.88
           C00013358 |          3        0.07       67.95
           C00013359 |          3        0.07       68.02
           C00013360 |          3        0.07       68.09
           C00013361 |          3        0.07       68.17
           C00013362 |          3        0.07       68.24
           C00013363 |          3        0.07       68.31
           C00013364 |          3        0.07       68.38
           C00013365 |          3        0.07       68.46
           C00013366 |          3        0.07       68.53
           C00013367 |          3        0.07       68.60
           C00013368 |          3        0.07       68.67
           C00013369 |          3        0.07       68.75
           C00013370 |          3        0.07       68.82
           C00013371 |          3        0.07       68.89
           C00013372 |          3        0.07       68.96
           C00013373 |          3        0.07       69.04
           C00013374 |          3        0.07       69.11
           C00013375 |          3        0.07       69.18
           C00013376 |          3        0.07       69.25
           C00013377 |          3        0.07       69.33
           C00013378 |          3        0.07       69.40
           C00013379 |          3        0.07       69.47
           C00013380 |          3        0.07       69.54
           C00013381 |          3        0.07       69.62
           C00013382 |          3        0.07       69.69
           C00013383 |          3        0.07       69.76
           C00013384 |          3        0.07       69.83
           C00013385 |          3        0.07       69.91
           C00013386 |          3        0.07       69.98
           C00013387 |          3        0.07       70.05
           C00013388 |          3        0.07       70.12
           C00013389 |          3        0.07       70.20
           C00013390 |          3        0.07       70.27
           C00013391 |          3        0.07       70.34
           C00013392 |          3        0.07       70.41
           C00013393 |          3        0.07       70.49
           C00013394 |          3        0.07       70.56
           C00013395 |          3        0.07       70.63
           C00013396 |          3        0.07       70.70
           C00013397 |          3        0.07       70.78
           C00013398 |          3        0.07       70.85
           C00013399 |          3        0.07       70.92
           C00013400 |          3        0.07       70.99
           C00013401 |          3        0.07       71.07
           C00013402 |          3        0.07       71.14
           C00013403 |          3        0.07       71.21
           C00013404 |          3        0.07       71.28
           C00013405 |          3        0.07       71.36
           C00013406 |          3        0.07       71.43
           C00013407 |          3        0.07       71.50
           C00013408 |          3        0.07       71.57
    H034660053-158-1 |          3        0.07       71.65
    H053380485-162-1 |          3        0.07       71.72
 H064100394-262-H1-2 |          3        0.07       71.79
H064300179-366-H11-2 |          3        0.07       71.86
    H064940387-213-1 |          3        0.07       71.94
H065060092-367-A12-2 |          3        0.07       72.01
 H065120079-263-A1-2 |          3        0.07       72.08
 H071160354-264-B1-2 |          3        0.07       72.15
    H071660602-163-1 |          3        0.07       72.23
    H071680494-214-1 |          3        0.07       72.30
 H073120347-265-C1-2 |          3        0.07       72.37
 H074780626-266-D1-2 |          3        0.07       72.44
H075000499-369-C12-2 |          3        0.07       72.52
    H080980484-164-1 |          3        0.07       72.59
 H082600495-244-F0-2 |          3        0.07       72.66
 H082640642-267-E1-2 |          3        0.07       72.73
H082660627-370-D12-2 |          3        0.07       72.81
    H084660685-165-1 |          3        0.07       72.88
 H091100226-245-G0-2 |          3        0.07       72.95
    H092520302-216-1 |          3        0.07       73.02
 H092640331-268-F1-2 |          3        0.07       73.10
    H092800184-166-2 |          3        0.07       73.17
 H092820427-242-D0-2 |          3        0.07       73.24
 H093620523-269-G1-2 |          3        0.07       73.31
 H094320264-270-H1-2 |          3        0.07       73.39
 H094920323-271-A1-2 |          3        0.07       73.46
    H100140197-167-2 |          3        0.07       73.53
    H100160424-168-2 |          3        0.07       73.60
 H100180330-243-E0-2 |          3        0.07       73.68
    H100200151-169-2 |          3        0.07       73.75
 H100460391-272-B1-2 |          3        0.07       73.82
    H100600212-171-2 |          3        0.07       73.89
    H100760181-170-2 |          3        0.07       73.97
    H100800158-172-2 |          3        0.07       74.04
    H101020134-173-2 |          3        0.07       74.11
 H101120403-273-C1-2 |          3        0.07       74.18
    H101160185-174-2 |          3        0.07       74.26
    H101520278-175-2 |          3        0.07       74.33
    H101580214-176-2 |          3        0.07       74.40
 H101740329-274-D1-2 |          3        0.07       74.47
 H101740629-240-B0-2 |          3        0.07       74.55
    H101860122-177-2 |          3        0.07       74.62
    H102380070-178-2 |          3        0.07       74.69
    H102500043-180-2 |          3        0.07       74.76
 H102520268-275-E1-2 |          3        0.07       74.84
 H102560009-276-F1-2 |          3        0.07       74.91
    H102760150-181-2 |          3        0.07       74.98
 H102820334-277-G1-2 |          3        0.07       75.05
H102840083-328-B07-2 |          3        0.07       75.13
 H102840444-246-H0-2 |          3        0.07       75.20
    H102940768-182-2 |          3        0.07       75.27
    H103060332-756-2 |          3        0.07       75.34
    H103220288-184-2 |          3        0.07       75.42
    H103260058-185-2 |          3        0.07       75.49
 H103300404-218-D0-2 |          3        0.07       75.56
    H103320100-186-2 |          3        0.07       75.63
 H103360314-241-C0-2 |          3        0.07       75.71
    H103440108-442-2 |          3        0.07       75.78
H103560109-371-E12-2 |          3        0.07       75.85
H103600186-372-F12-2 |          3        0.07       75.92
H104040516-329-C07-2 |          3        0.07       76.00
    H104060122-187-2 |          3        0.07       76.07
    H104080090-443-2 |          3        0.07       76.14
 H104340409-219-E0-2 |          3        0.07       76.21
 H104340410-220-F0-2 |          3        0.07       76.29
H104380040-330-D07-2 |          3        0.07       76.36
    H104420050-188-2 |          3        0.07       76.43
    H104420250-444-2 |          3        0.07       76.50
    H104460171-189-2 |          3        0.07       76.58
    H104540051-115-2 |          3        0.07       76.65
    H104600048-190-2 |          3        0.07       76.72
    H104600072-445-1 |          3        0.07       76.79
    H104740158-446-1 |          3        0.07       76.87
 H105020135-247-A0-2 |          3        0.07       76.94
    H105020486-191-2 |          3        0.07       77.01
H105040039-373-G12-2 |          3        0.07       77.08
 H105140339-248-B0-2 |          3        0.07       77.16
H105260391-374-H12-2 |          3        0.07       77.23
    H110300192-447-1 |          3        0.07       77.30
    H110500202-448-1 |          3        0.07       77.37
    H110520238-116-2 |          3        0.07       77.45
    H110520393-449-1 |          3        0.07       77.52
    H110640215-450-1 |          3        0.07       77.59
    H110740135-193-2 |          3        0.07       77.66
    H110740137-194-2 |          3        0.07       77.74
    H110820268-195-2 |          3        0.07       77.81
    H110940110-451-1 |          3        0.07       77.88
    H110960065-452-1 |          3        0.07       77.96
    H111000085-453-1 |          3        0.07       78.03
    H111060067-117-2 |          3        0.07       78.10
    H111200062-454-1 |          3        0.07       78.17
    H111200066-118-2 |          3        0.07       78.25
 H111220168-221-G0-2 |          3        0.07       78.32
    H111280103-119-2 |          3        0.07       78.39
    H111600186-455-2 |          3        0.07       78.46
    H111640001-197-2 |          3        0.07       78.54
    H111740190-456-2 |          3        0.07       78.61
    H111820058-457-2 |          3        0.07       78.68
    H111820165-458-2 |          3        0.07       78.75
    H111940137-460-2 |          3        0.07       78.83
H111960080-332-F07-2 |          3        0.07       78.90
    H111960095-121-2 |          3        0.07       78.97
    H112000100-141-1 |          3        0.07       79.04
    H112060137-461-2 |          3        0.07       79.12
    H112280147-462-2 |          3        0.07       79.19
    H112340069-463-2 |          3        0.07       79.26
    H112460665-122-2 |          3        0.07       79.33
    H112540036-142-1 |          3        0.07       79.41
    H112660153-200-1 |          3        0.07       79.48
    H112820061-464-2 |          3        0.07       79.55
 H112940084-249-C0-2 |          3        0.07       79.62
    H113000047-465-2 |          3        0.07       79.70
    H113020124-201-1 |          3        0.07       79.77
    H113020155-466-2 |          3        0.07       79.84
    H113080385-467-2 |          3        0.07       79.91
    H113140144-468-2 |          3        0.07       79.99
    H113140166-125-2 |          3        0.07       80.06
H113140175-334-H07-2 |          3        0.07       80.13
 H113260170-250-D0-2 |          3        0.07       80.20
H113420072-336-B08-2 |          3        0.07       80.28
 H113480152-251-E0-2 |          3        0.07       80.35
    H113540198-126-2 |          3        0.07       80.42
    H113560219-469-2 |          3        0.07       80.49
    H113580127-202-1 |          3        0.07       80.57
 H113640207-252-F0-2 |          3        0.07       80.64
    H113640215-127-2 |          3        0.07       80.71
    H113640238-143-1 |          3        0.07       80.78
 H113800363-253-G0-2 |          3        0.07       80.86
 H113840385-254-H0-2 |          3        0.07       80.93
    H113880160-476-1 |          3        0.07       81.00
    H113920133-128-1 |          3        0.07       81.07
    H113920345-478-1 |          3        0.07       81.15
 H114080202-255-A1-2 |          3        0.07       81.22
    H114120077-144-1 |          3        0.07       81.29
H114140296-279-A01-2 |          3        0.07       81.36
H114140657-280-B01-2 |          3        0.07       81.44
    H114160352-129-1 |          3        0.07       81.51
 H114160372-256-B1-2 |          3        0.07       81.58
H114260054-337-C08-2 |          3        0.07       81.65
    H114340058-470-2 |          3        0.07       81.73
H114380198-338-D08-2 |          3        0.07       81.80
 H114460212-222-H0-2 |          3        0.07       81.87
    H114480099-376-2 |          3        0.07       81.94
    H114640339-378-2 |          3        0.07       82.02
H114680370-339-E08-2 |          3        0.07       82.09
    H114700173-203-1 |          3        0.07       82.16
    H114700366-481-1 |          3        0.07       82.23
    H114720432-482-1 |          3        0.07       82.31
    H114720434-145-1 |          3        0.07       82.38
    H114740269-130-1 |          3        0.07       82.45
    H114760249-131-1 |          3        0.07       82.52
    H114760251-379-2 |          3        0.07       82.60
    H114760256-484-1 |          3        0.07       82.67
    H114840019-380-2 |          3        0.07       82.74
    H114880313-487-1 |          3        0.07       82.81
    H114980322-488-1 |          3        0.07       82.89
H115100079-340-F08-2 |          3        0.07       82.96
    H115280628-204-1 |          3        0.07       83.03
H120160169-341-G08-2 |          3        0.07       83.10
    H120220271-381-2 |          3        0.07       83.18
    H120260225-382-2 |          3        0.07       83.25
H120260243-343-A09-2 |          3        0.07       83.32
    H120360008-383-2 |          3        0.07       83.39
 H120420116-223-A0-2 |          3        0.07       83.47
    H120440759-384-2 |          3        0.07       83.54
    H120440759-787-2 |          3        0.07       83.61
 H120600058-224-B0-2 |          3        0.07       83.68
H120600059-344-B09-2 |          3        0.07       83.76
H120620136-345-C09-2 |          3        0.07       83.83
    H120680309-385-2 |          3        0.07       83.90
    H120700039-205-1 |          3        0.07       83.97
    H120840077-528-1 |          3        0.07       84.05
 H120840083-225-C0-2 |          3        0.07       84.12
    H120860086-386-2 |          3        0.07       84.19
H120860096-346-D09-2 |          3        0.07       84.26
    H120980139-387-2 |          3        0.07       84.34
    H121000455-532-1 |          3        0.07       84.41
    H121060252-533-1 |          3        0.07       84.48
    H121100042-534-1 |          3        0.07       84.55
    H121120051-535-1 |          3        0.07       84.63
    H121120058-504-1 |          3        0.07       84.70
    H121300130-139-1 |          3        0.07       84.77
    H121320081-505-1 |          3        0.07       84.84
    H121320082-506-1 |          3        0.07       84.92
    H121320099-507-1 |          3        0.07       84.99
    H121340220-509-1 |          3        0.07       85.06
H121580125-347-E09-2 |          3        0.07       85.13
    H121800040-510-1 |          3        0.07       85.21
    H121800058-132-1 |          3        0.07       85.28
    H122020138-389-2 |          3        0.07       85.35
    H122140282-391-2 |          3        0.07       85.42
    H122440082-511-1 |          3        0.07       85.50
H122560310-348-F09-2 |          3        0.07       85.57
    H122640061-512-1 |          3        0.07       85.64
    H122660093-513-1 |          3        0.07       85.71
    H122660123-514-1 |          3        0.07       85.79
    H122840129-206-1 |          3        0.07       85.86
H122880108-349-G09-2 |          3        0.07       85.93
    H122880144-207-1 |          3        0.07       86.00
H122900151-350-H09-2 |          3        0.07       86.08
    H122960028-515-1 |          3        0.07       86.15
    H122960030-517-1 |          3        0.07       86.22
    H122960038-519-1 |          3        0.07       86.29
    H123020176-551-1 |          3        0.07       86.37
    H123020177-552-1 |          3        0.07       86.44
    H123020178-553-1 |          3        0.07       86.51
    H123080096-564-1 |          3        0.07       86.58
    H123100270-554-1 |          3        0.07       86.66
    H123100271-555-1 |          3        0.07       86.73
    H123120336-557-1 |          3        0.07       86.80
    H123120337-556-1 |          3        0.07       86.87
    H123120338-558-1 |          3        0.07       86.95
H123120383-351-A10-2 |          3        0.07       87.02
    H123220266-561-1 |          3        0.07       87.09
    H123320438-393-2 |          3        0.07       87.16
    H123340190-394-2 |          3        0.07       87.24
H123340195-352-B10-2 |          3        0.07       87.31
    H123420107-133-1 |          3        0.07       87.38
H123700164-353-C10-2 |          3        0.07       87.45
    H123800096-395-1 |          3        0.07       87.53
H123800113-354-D10-2 |          3        0.07       87.60
    H123860403-208-1 |          3        0.07       87.67
    H124000095-396-1 |          3        0.07       87.74
    H124040783-397-1 |          3        0.07       87.82
    H124060094-134-1 |          3        0.07       87.89
    H124120101-398-1 |          3        0.07       87.96
 H124160359-226-D0-2 |          3        0.07       88.03
    H124280296-399-1 |          3        0.07       88.11
H124420844-355-E10-2 |          3        0.07       88.18
 H124420845-227-E0-2 |          3        0.07       88.25
    H124440847-135-1 |          3        0.07       88.32
    H124480251-136-1 |          3        0.07       88.40
    H124480843-137-1 |          3        0.07       88.47
 H124520214-228-F0-2 |          3        0.07       88.54
    H124560310-400-1 |          3        0.07       88.61
    H124720623-209-1 |          3        0.07       88.69
    H124860349-210-1 |          3        0.07       88.76
    H124940430-401-1 |          3        0.07       88.83
    H124940456-402-1 |          3        0.07       88.91
 H125000105-229-G0-2 |          3        0.07       88.98
    H125000105-833-2 |          3        0.07       89.05
 H125020289-230-H0-2 |          3        0.07       89.12
H125020290-278-H12-2 |          3        0.07       89.20
    H125180913-403-1 |          3        0.07       89.27
H125280642-356-F10-2 |          3        0.07       89.34
    H125280642-841-2 |          3        0.07       89.41
H130240275-357-G10-2 |          3        0.07       89.49
    H130260219-404-1 |          3        0.07       89.56
H130380213-358-H10-2 |          3        0.07       89.63
H130380230-359-A11-2 |          3        0.07       89.70
H130380233-360-B11-2 |          3        0.07       89.78
H130400296-361-C11-2 |          3        0.07       89.85
 H130500318-232-B0-2 |          3        0.07       89.92
    H130660215-405-2 |          3        0.07       89.99
    H130920247-406-2 |          3        0.07       90.07
    H131060196-407-2 |          3        0.07       90.14
    H131240104-409-2 |          3        0.07       90.21
    H131320219-410-2 |          3        0.07       90.28
    H131320234-411-2 |          3        0.07       90.36
    H131660094-412-2 |          3        0.07       90.43
    H131740193-413-2 |          3        0.07       90.50
    H131800554-414-2 |          3        0.07       90.57
    H131800573-415-2 |          3        0.07       90.65
    H132280003-416-2 |          3        0.07       90.72
    H132280131-417-2 |          3        0.07       90.79
    H132440092-418-2 |          3        0.07       90.86
    H132540570-419-2 |          3        0.07       90.94
    H132620132-420-2 |          3        0.07       91.01
    H132780171-421-2 |          3        0.07       91.08
    H132920375-623-1 |          3        0.07       91.15
    H132940485-625-1 |          3        0.07       91.23
    H133000236-626-1 |          3        0.07       91.30
    H133020301-629-1 |          3        0.07       91.37
    H133060075-630-1 |          3        0.07       91.44
    H133060077-633-1 |          3        0.07       91.52
    H133060079-613-1 |          3        0.07       91.59
    H133100176-615-1 |          3        0.07       91.66
    H133120386-618-1 |          3        0.07       91.73
    H133180031-619-1 |          3        0.07       91.81
    H133180045-620-1 |          3        0.07       91.88
    H133180046-621-1 |          3        0.07       91.95
    H133180047-622-1 |          3        0.07       92.02
    H133200270-608-1 |          3        0.07       92.10
    H133200302-603-1 |          3        0.07       92.17
    H133240054-609-1 |          3        0.07       92.24
    H133300150-656-1 |          3        0.07       92.31
    H133300151-657-1 |          3        0.07       92.39
    H133440211-645-1 |          3        0.07       92.46
    H133520197-646-1 |          3        0.07       92.53
    H133520198-647-1 |          3        0.07       92.60
    H133560609-593-1 |          3        0.07       92.68
    H133580080-596-1 |          3        0.07       92.75
    H133580086-601-1 |          3        0.07       92.82
    H133580087-582-1 |          3        0.07       92.89
    H133720214-574-1 |          3        0.07       92.97
    H133720215-575-1 |          3        0.07       93.04
    H133760113-576-1 |          3        0.07       93.11
    H133760667-565-1 |          3        0.07       93.18
    H133860126-577-1 |          3        0.07       93.26
    H133900439-581-1 |          3        0.07       93.33
    H133920237-578-1 |          3        0.07       93.40
    H133960268-568-1 |          3        0.07       93.47
    H133960269-569-1 |          3        0.07       93.55
    H133960276-571-1 |          3        0.07       93.62
 RH07000425-233-C0-2 |          3        0.07       93.69
RH08000015-282-D01-2 |          3        0.07       93.76
    RH08000028-150-1 |          3        0.07       93.84
RH08000348-362-D11-2 |          3        0.07       93.91
RH08000350-363-E11-2 |          3        0.07       93.98
RH08000352-364-F11-2 |          3        0.07       94.05
    RH09000011-151-1 |          3        0.07       94.13
    RH09000012-153-1 |          3        0.07       94.20
RH10000289-283-E01-2 |          3        0.07       94.27
    RH10000292-140-1 |          3        0.07       94.34
 RH10000295-234-D0-2 |          3        0.07       94.42
 RH10000375-235-E0-2 |          3        0.07       94.49
 RH10000389-236-F0-2 |          3        0.07       94.56
    RH10000401-154-1 |          3        0.07       94.63
    RH10000448-161-1 |          3        0.07       94.71
RH11000029-284-F01-2 |          3        0.07       94.78
RH11000035-285-G01-2 |          3        0.07       94.85
 RH11000042-258-D1-2 |          3        0.07       94.92
RH11000044-286-H01-2 |          3        0.07       95.00
RH11000056-287-A02-2 |          3        0.07       95.07
RH11000072-288-B02-2 |          3        0.07       95.14
RH11000090-289-C02-2 |          3        0.07       95.21
RH11000093-290-D02-2 |          3        0.07       95.29
RH11000097-291-E02-2 |          3        0.07       95.36
    RH11000109-422-2 |          3        0.07       95.43
RH11000133-292-F02-2 |          3        0.07       95.50
RH11000142-293-G02-2 |          3        0.07       95.58
RH11000146-294-H02-2 |          3        0.07       95.65
    RH11000301-155-1 |          3        0.07       95.72
 RH11000388-259-E1-2 |          3        0.07       95.79
 RH12000004-237-G0-2 |          3        0.07       95.87
RH12000028-296-B03-2 |          3        0.07       95.94
RH12000031-297-C03-2 |          3        0.07       96.01
RH12000046-298-D03-2 |          3        0.07       96.08
 RH12000051-238-H0-2 |          3        0.07       96.16
RH12000054-299-E03-2 |          3        0.07       96.23
RH12000340-301-G03-2 |          3        0.07       96.30
RH12000341-302-H03-2 |          3        0.07       96.37
RH12000342-303-A04-2 |          3        0.07       96.45
RH12000343-304-B04-2 |          3        0.07       96.52
RH12000344-305-C04-2 |          3        0.07       96.59
RH12000345-306-D04-2 |          3        0.07       96.66
RH12000346-307-E04-2 |          3        0.07       96.74
RH12000347-308-F04-2 |          3        0.07       96.81
RH12000348-309-G04-2 |          3        0.07       96.88
RH12000349-310-H04-2 |          3        0.07       96.95
RH12000350-311-A05-2 |          3        0.07       97.03
RH12000351-312-B05-2 |          3        0.07       97.10
RH12000352-313-C05-2 |          3        0.07       97.17
RH12000353-314-D05-2 |          3        0.07       97.24
RH12000354-315-E05-2 |          3        0.07       97.32
RH12000355-316-F05-2 |          3        0.07       97.39
RH12000356-317-G05-2 |          3        0.07       97.46
RH12000357-318-H05-2 |          3        0.07       97.53
RH12000358-319-A06-2 |          3        0.07       97.61
RH12000359-320-B06-2 |          3        0.07       97.68
RH12000360-321-C06-2 |          3        0.07       97.75
RH12000361-322-D06-2 |          3        0.07       97.82
RH12000362-323-E06-2 |          3        0.07       97.90
    RH12000363-423-2 |          3        0.07       97.97
    RH12000364-424-2 |          3        0.07       98.04
    RH12000365-425-2 |          3        0.07       98.11
    RH12000366-426-2 |          3        0.07       98.19
    RH12000367-427-2 |          3        0.07       98.26
    RH12000368-428-2 |          3        0.07       98.33
    RH12000369-429-2 |          3        0.07       98.40
    RH12000370-430-2 |          3        0.07       98.48
    RH12000371-431-2 |          3        0.07       98.55
    RH12000372-432-2 |          3        0.07       98.62
    RH12000373-433-2 |          3        0.07       98.69
    RH12000374-434-2 |          3        0.07       98.77
    RH12000375-435-2 |          3        0.07       98.84
    RH12000376-436-2 |          3        0.07       98.91
    RH12000377-437-2 |          3        0.07       98.98
    RH12000378-438-2 |          3        0.07       99.06
    RH12000379-439-2 |          3        0.07       99.13
    RH12000380-440-2 |          3        0.07       99.20
    RH12000381-441-2 |          3        0.07       99.27
 RH12000502-260-F1-2 |          3        0.07       99.35
 RH12000503-261-G1-2 |          3        0.07       99.42
 RH12000505-239-A0-2 |          3        0.07       99.49
RH12000538-325-G06-2 |          3        0.07       99.56
RH12000539-326-H06-2 |          3        0.07       99.64
    RH12000540-156-1 |          3        0.07       99.71
    RH12000540-755-2 |          3        0.07       99.78
    RH12000541-157-1 |          3        0.07       99.85
RH12000656-365-G11-2 |          3        0.07       99.93
    RH13000429-211-1 |          3        0.07      100.00
---------------------+-----------------------------------
               Total |      4,137      100.00

. tab method, m

     method |      Freq.     Percent        Cum.
------------+-----------------------------------
 genefinder |      1,379       33.33       33.33
 typewriter |      1,379       33.33       66.67
        zam |      1,379       33.33      100.00
------------+-----------------------------------
      Total |      4,137      100.00

. foreach k in Penicillin Methicillin Ciprofloxacin Erythromycin Clindamycin Tetracycline Fusidicacid Gentamicin Rifampicin Trimet
> hoprim Vancomycin Mupirocin {
  2. 
. noi di "`k'"
  3. 
. 
. 
. }
Penicillin
Methicillin
Ciprofloxacin
Erythromycin
Clindamycin
Tetracycline
Fusidicacid
Gentamicin
Rifampicin
Trimethoprim
Vancomycin
Mupirocin

. foreach k in  ciprofloxacin erythromycin clindamycin fusidic_acid gentamicin mupirocin penicillin rifampicin tetracycline trimet
> hoprim vancomycin methicillin{
  2. 
. noi di "`k'"
  3. 
. 
. 
. }
ciprofloxacin
erythromycin
clindamycin
fusidic_acid
gentamicin
mupirocin
penicillin
rifampicin
tetracycline
trimethoprim
vancomycin
methicillin

. 
. foreach k in  ciprofloxacin erythromycin clindamycin fusidic_acid gentamicin mupirocin penicillin rifampicin tetracycline trimet
> hoprim vancomycin methicillin{
  2. 
. noi di "`k'"
  3. 
. gen `k'_predict
  4. 
. }
ciprofloxacin
=exp required
r(100);

. foreach k in  ciprofloxacin erythromycin clindamycin fusidic_acid gentamicin mupirocin penicillin rifampicin tetracycline trimet
> hoprim vancomycin methicillin{
  2. 
. noi di "`k'"
  3. 
. gen `k'_predict = ""
  4. 
. }
ciprofloxacin
(4,137 missing values generated)
erythromycin
(4,137 missing values generated)
clindamycin
(4,137 missing values generated)
fusidic_acid
(4,137 missing values generated)
gentamicin
(4,137 missing values generated)
mupirocin
(4,137 missing values generated)
penicillin
(4,137 missing values generated)
rifampicin
(4,137 missing values generated)
tetracycline
(4,137 missing values generated)
trimethoprim
(4,137 missing values generated)
vancomycin
(4,137 missing values generated)
methicillin
(4,137 missing values generated)

. 
. foreach k in  ciprofloxacin erythromycin clindamycin fusidic_acid gentamicin mupirocin penicillin rifampicin tetracycline trimet
> hoprim vancomycin methicillin{
  2. 
. noi di "`k'"
  3. 
. gen predict`k'= "R" if `k'==1
  4. 
. replace predict`k' = "S" if `k'==0
  5. 
. drop `k'
  6. 
. rename predict`k' `k'
  7. 
. noi tab `k', m
  8. 
. }
ciprofloxacin
(3,210 missing values generated)
(3,210 real changes made)

ciprofloxac |
         in |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |        927       22.41       22.41
          S |      3,210       77.59      100.00
------------+-----------------------------------
      Total |      4,137      100.00
erythromycin
(3,045 missing values generated)
(3,045 real changes made)

erythromyci |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |      1,092       26.40       26.40
          S |      3,045       73.60      100.00
------------+-----------------------------------
      Total |      4,137      100.00
clindamycin
(3,089 missing values generated)
(3,089 real changes made)

clindamycin |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |      1,048       25.33       25.33
          S |      3,089       74.67      100.00
------------+-----------------------------------
      Total |      4,137      100.00
fusidic_acid
(3,649 missing values generated)
(3,649 real changes made)

fusidic_aci |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |        488       11.80       11.80
          S |      3,649       88.20      100.00
------------+-----------------------------------
      Total |      4,137      100.00
gentamicin
(3,904 missing values generated)
(3,904 real changes made)

 gentamicin |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |        233        5.63        5.63
          S |      3,904       94.37      100.00
------------+-----------------------------------
      Total |      4,137      100.00
mupirocin
(4,088 missing values generated)
(4,088 real changes made)

  mupirocin |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |         49        1.18        1.18
          S |      4,088       98.82      100.00
------------+-----------------------------------
      Total |      4,137      100.00
penicillin
(640 missing values generated)
(640 real changes made)

 penicillin |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |      3,497       84.53       84.53
          S |        640       15.47      100.00
------------+-----------------------------------
      Total |      4,137      100.00
rifampicin
(4,058 missing values generated)
(4,058 real changes made)

 rifampicin |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |         79        1.91        1.91
          S |      4,058       98.09      100.00
------------+-----------------------------------
      Total |      4,137      100.00
tetracycline
(3,752 missing values generated)
(3,752 real changes made)

tetracyclin |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |        385        9.31        9.31
          S |      3,752       90.69      100.00
------------+-----------------------------------
      Total |      4,137      100.00
trimethoprim
(3,602 missing values generated)
(3,602 real changes made)

trimethopri |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |        535       12.93       12.93
          S |      3,602       87.07      100.00
------------+-----------------------------------
      Total |      4,137      100.00
vancomycin
(4,137 missing values generated)
(4,137 real changes made)

 vancomycin |      Freq.     Percent        Cum.
------------+-----------------------------------
          S |      4,137      100.00      100.00
------------+-----------------------------------
      Total |      4,137      100.00
methicillin
(2,946 missing values generated)
(2,946 real changes made)

methicillin |      Freq.     Percent        Cum.
------------+-----------------------------------
          R |      1,191       28.79       28.79
          S |      2,946       71.21      100.00
------------+-----------------------------------
      Total |      4,137      100.00

. drop *_*

. save anti_prediction, replace
(note: file anti_prediction.dta not found)
file anti_prediction.dta saved

. 
. 
. 
. rename * value*

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long
no xij variables found
    You typed something like reshape wide a b, i(i) j(j).
    reshape looked for existing variables named a# and b# but could not find any.  Remember this picture:

         long                                wide
        +---------------+                   +------------------+
        | i   j   a   b |                   | i   a1 a2  b1 b2 |
        |---------------| <--- reshape ---> |------------------|
        | 1   1   1   2 |                   | 1   1   3   2  4 |
        | 1   2   3   4 |                   | 2   5   7   6  8 |
        | 2   1   5   6 |                   +------------------+
        | 2   2   7   8 |
        +---------------+

        long to wide: reshape wide a b, i(i) j(j)    (j existing variable)
        wide to long: reshape long a b, i(i) j(j)    (j    new   variable)
r(111);

. 
. noi bysort method: tab site value 

----------------------------------------------------------------------------------------------------------------------------------
-> method = genefinder
variable site not found
r(111);

. 
. noi bysort site: tab method value
variable site not found
r(111);

. reshape long value, i(sample method) j(site) string
(note: j = ciprofloxacin clindamycin erythromycin gentamicin methicillin mupirocin penicillin rifampicin tetracycline trimethoprim
>  vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     4137   ->   45507
Number of variables                  13   ->       4
j variable (11 values)                    ->   site
xij variables:
valueciprofloxacin valueclindamycin ... valuevancomycin->value
-----------------------------------------------------------------------------

. noi bysort method: tab site value 

----------------------------------------------------------------------------------------------------------------------------------
-> method = genefinder

              |         value
         site |         R          S |     Total
--------------+----------------------+----------
ciprofloxacin |       307      1,072 |     1,379 
  clindamycin |       345      1,034 |     1,379 
 erythromycin |       360      1,019 |     1,379 
   gentamicin |        77      1,302 |     1,379 
  methicillin |       395        984 |     1,379 
    mupirocin |        17      1,362 |     1,379 
   penicillin |     1,164        215 |     1,379 
   rifampicin |        24      1,355 |     1,379 
 tetracycline |       125      1,254 |     1,379 
 trimethoprim |       179      1,200 |     1,379 
   vancomycin |         0      1,379 |     1,379 
--------------+----------------------+----------
        Total |     2,993     12,176 |    15,169 


----------------------------------------------------------------------------------------------------------------------------------
-> method = typewriter

              |         value
         site |         R          S |     Total
--------------+----------------------+----------
ciprofloxacin |       306      1,073 |     1,379 
  clindamycin |       338      1,041 |     1,379 
 erythromycin |       354      1,025 |     1,379 
   gentamicin |        76      1,303 |     1,379 
  methicillin |       393        986 |     1,379 
    mupirocin |        15      1,364 |     1,379 
   penicillin |     1,161        218 |     1,379 
   rifampicin |        24      1,355 |     1,379 
 tetracycline |       121      1,258 |     1,379 
 trimethoprim |       176      1,203 |     1,379 
   vancomycin |         0      1,379 |     1,379 
--------------+----------------------+----------
        Total |     2,964     12,205 |    15,169 


----------------------------------------------------------------------------------------------------------------------------------
-> method = zam

              |         value
         site |         R          S |     Total
--------------+----------------------+----------
ciprofloxacin |       314      1,065 |     1,379 
  clindamycin |       365      1,014 |     1,379 
 erythromycin |       378      1,001 |     1,379 
   gentamicin |        80      1,299 |     1,379 
  methicillin |       403        976 |     1,379 
    mupirocin |        17      1,362 |     1,379 
   penicillin |     1,172        207 |     1,379 
   rifampicin |        31      1,348 |     1,379 
 tetracycline |       139      1,240 |     1,379 
 trimethoprim |       180      1,199 |     1,379 
   vancomycin |         0      1,379 |     1,379 
--------------+----------------------+----------
        Total |     3,079     12,090 |    15,169 



. 
. noi bysort site: tab method value

----------------------------------------------------------------------------------------------------------------------------------
-> site = ciprofloxacin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |       307      1,072 |     1,379 
typewriter |       306      1,073 |     1,379 
       zam |       314      1,065 |     1,379 
-----------+----------------------+----------
     Total |       927      3,210 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = clindamycin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |       345      1,034 |     1,379 
typewriter |       338      1,041 |     1,379 
       zam |       365      1,014 |     1,379 
-----------+----------------------+----------
     Total |     1,048      3,089 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = erythromycin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |       360      1,019 |     1,379 
typewriter |       354      1,025 |     1,379 
       zam |       378      1,001 |     1,379 
-----------+----------------------+----------
     Total |     1,092      3,045 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = gentamicin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |        77      1,302 |     1,379 
typewriter |        76      1,303 |     1,379 
       zam |        80      1,299 |     1,379 
-----------+----------------------+----------
     Total |       233      3,904 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = methicillin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |       395        984 |     1,379 
typewriter |       393        986 |     1,379 
       zam |       403        976 |     1,379 
-----------+----------------------+----------
     Total |     1,191      2,946 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = mupirocin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |        17      1,362 |     1,379 
typewriter |        15      1,364 |     1,379 
       zam |        17      1,362 |     1,379 
-----------+----------------------+----------
     Total |        49      4,088 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = penicillin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |     1,164        215 |     1,379 
typewriter |     1,161        218 |     1,379 
       zam |     1,172        207 |     1,379 
-----------+----------------------+----------
     Total |     3,497        640 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = rifampicin

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |        24      1,355 |     1,379 
typewriter |        24      1,355 |     1,379 
       zam |        31      1,348 |     1,379 
-----------+----------------------+----------
     Total |        79      4,058 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = tetracycline

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |       125      1,254 |     1,379 
typewriter |       121      1,258 |     1,379 
       zam |       139      1,240 |     1,379 
-----------+----------------------+----------
     Total |       385      3,752 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = trimethoprim

           |         value
    method |         R          S |     Total
-----------+----------------------+----------
genefinder |       179      1,200 |     1,379 
typewriter |       176      1,203 |     1,379 
       zam |       180      1,199 |     1,379 
-----------+----------------------+----------
     Total |       535      3,602 |     4,137 


----------------------------------------------------------------------------------------------------------------------------------
-> site = vancomycin

           |   value
    method |         S |     Total
-----------+-----------+----------
genefinder |     1,379 |     1,379 
typewriter |     1,379 |     1,379 
       zam |     1,379 |     1,379 
-----------+-----------+----------
     Total |     4,137 |     4,137 



. reshape wide value, i(sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    45507   ->   15169
Number of variables                   4   ->       5
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
-----------------------------------------------------------------------------

. gen valueall = valueg + valuet + valuez

. tab valueall, m

   valueall |      Freq.     Percent        Cum.
------------+-----------------------------------
        RRR |      2,959       19.51       19.51
        RRS |          5        0.03       19.54
        RSR |         28        0.18       19.72
        RSS |          1        0.01       19.73
        SSR |         92        0.61       20.34
        SSS |     12,084       79.66      100.00
------------+-----------------------------------
      Total |     15,169      100.00

. noi tab valuea, m sort

   valueall |      Freq.     Percent        Cum.
------------+-----------------------------------
        SSS |     12,084       79.66       79.66
        RRR |      2,959       19.51       99.17
        SSR |         92        0.61       99.78
        RSR |         28        0.18       99.96
        RRS |          5        0.03       99.99
        RSS |          1        0.01      100.00
------------+-----------------------------------
      Total |     15,169      100.00

. 
. 
. 
. noi tab site valuea, m sort
option sort not allowed
r(198);

. noi tab valuea, m

   valueall |      Freq.     Percent        Cum.
------------+-----------------------------------
        RRR |      2,959       19.51       19.51
        RRS |          5        0.03       19.54
        RSR |         28        0.18       19.72
        RSS |          1        0.01       19.73
        SSR |         92        0.61       20.34
        SSS |     12,084       79.66      100.00
------------+-----------------------------------
      Total |     15,169      100.00

. help tab

. noi tab site valuea,m sort
option sort not allowed
r(198);

. noi tab valuea, m sort

   valueall |      Freq.     Percent        Cum.
------------+-----------------------------------
        SSS |     12,084       79.66       79.66
        RRR |      2,959       19.51       99.17
        SSR |         92        0.61       99.78
        RSR |         28        0.18       99.96
        RRS |          5        0.03       99.99
        RSS |          1        0.01      100.00
------------+-----------------------------------
      Total |     15,169      100.00

. 
. 
. 
. noi tab site valuea, m

              |                             valueall
         site |       RRR        RRS        RSR        RSS        SSR        SSS |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |       306          0          0          1          8      1,064 |     1,379 
  clindamycin |       338          0          7          0         20      1,014 |     1,379 
 erythromycin |       354          0          6          0         18      1,001 |     1,379 
   gentamicin |        76          0          1          0          3      1,299 |     1,379 
  methicillin |       393          0          2          0          8        976 |     1,379 
    mupirocin |        15          0          2          0          0      1,362 |     1,379 
   penicillin |     1,161          0          3          0          8        207 |     1,379 
   rifampicin |        24          0          0          0          7      1,348 |     1,379 
 tetracycline |       121          0          4          0         14      1,240 |     1,379 
 trimethoprim |       171          5          3          0          6      1,194 |     1,379 
   vancomycin |         0          0          0          0          0      1,379 |     1,379 
--------------+------------------------------------------------------------------+----------
        Total |     2,959          5         28          1         92     12,084 |    15,169 


. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. run clean_pheno.do
