----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\users\amy.mason\Pipeline_27_07_2016\Datasets\clean.log
  log type:  text
 opened on:  19 Oct 2016, 13:29:52

. 
. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on 19 Oct 2016 13:29:52

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Combine all predictive sets" _n _dup(80) "="





================================================================================
 1 Combine all predictive sets
================================================================================

. 
. 
. 
. 
. 
. ****** combine the 3 sets

. 
. noi di "combine"
combine

. 
. use pipeline_data_gf, clear

. 
. append using pipeline_data_tw.dta, force
(note: variable comments was str7, now str68 to accommodate using data's values)
(note: variable value was str27, now str34 to accommodate using data's values)

. 
. append using pipeline_data_z2.dta, force
(note: variable value was str34, now str46 to accommodate using data's values)

. 
. gsort sample - set

. 
. by sample: replace set=set[_n-1] if _n>1 & set==""
(120,843 real changes made)

. 
. by sample: assert set==set[_n-1] if _n>1

. 
. replace site = lower(site)
(288,654 real changes made)

. 
. noi di _N " results"
395178 results

. 
. bysort site: gen tab=1 if _n==1
(395,069 missing values generated)

. 
. summ tab 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |        109           1           0          1          1

. 
. noi di "on " r(sum) " sites"
on 109 sites

. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,207        1.06        1.06
    aaddaph4ia |      4,207        1.06        2.13
    aadeant6ia |      4,207        1.06        3.19
          acrb |      4,207        1.06        4.26
          acrc |      4,207        1.06        5.32
          acrd |      4,207        1.06        6.39
allelicprofile |      1,389        0.35        6.74
    ant9_iaspc |      4,207        1.06        7.80
    ant9_ibspc |      4,207        1.06        8.87
        aph2ic |      4,207        1.06        9.93
  apha3aph3iii |      4,207        1.06       11.00
            ar |      1,429        0.36       11.36
          arca |      4,207        1.06       12.42
          blaz |      4,207        1.06       13.49
           cat |      4,207        1.06       14.55
          ccra |      1,429        0.36       14.91
        ccra_1 |      2,778        0.70       15.62
        ccra_2 |      2,778        0.70       16.32
        ccra_3 |      2,778        0.70       17.02
        ccra_4 |      2,778        0.70       17.73
          ccrb |      1,429        0.36       18.09
        ccrb_1 |      2,778        0.70       18.79
        ccrb_2 |      2,778        0.70       19.49
        ccrb_3 |      2,778        0.70       20.20
        ccrb_4 |      2,778        0.70       20.90
        ccrb_6 |      2,778        0.70       21.60
        ccrc_a |      4,207        1.06       22.67
        ccrc_b |      4,207        1.06       23.73
        ccrc_c |      4,207        1.06       24.80
           cfr |      4,207        1.06       25.86
           chp |      4,207        1.06       26.93
         dfr_a |      4,207        1.06       27.99
         dfr_c |      4,207        1.06       29.05
         dfr_d |      4,207        1.06       30.12
         dfr_g |      4,207        1.06       31.18
         dfr_k |      4,207        1.06       32.25
          dfrb |      4,207        1.06       33.31
          erma |      1,429        0.36       33.67
        erma_1 |      2,778        0.70       34.38
        erma_2 |      2,778        0.70       35.08
          ermb |      4,207        1.06       36.15
          ermc |      4,207        1.06       37.21
          ermt |      4,207        1.06       38.27
          ermy |      4,207        1.06       39.34
           eta |      4,207        1.06       40.40
           etb |      4,207        1.06       41.47
           etd |      4,207        1.06       42.53
         fus_b |      4,207        1.06       43.60
         fus_c |      4,207        1.06       44.66
          fusa |      4,207        1.06       45.73
          grla |      4,207        1.06       46.79
          gyra |      4,207        1.06       47.86
         ile_s |        491        0.12       47.98
          iles |      2,287        0.58       48.56
          isab |      4,207        1.06       49.62
         lnu_a |      4,207        1.06       50.69
         lnu_b |      4,207        1.06       51.75
           luk |      1,429        0.36       52.11
          lukm |      4,207        1.06       53.18
         lukmf |      4,207        1.06       54.24
        lukpvf |      4,207        1.06       55.31
        lukpvs |      4,207        1.06       56.37
          meca |      4,207        1.06       57.44
          mecc |      4,207        1.06       58.50
          mlst |      1,389        0.35       58.85
          mphc |      4,207        1.06       59.92
          msra |      4,207        1.06       60.98
          mupa |      4,207        1.06       62.05
          mupb |      4,207        1.06       63.11
         qac_a |      4,207        1.06       64.18
         qac_b |      4,207        1.06       65.24
      qac_csmr |      4,207        1.06       66.31
          rpob |      4,207        1.06       67.37
           sak |      4,207        1.06       68.43
          sasx |      4,207        1.06       69.50
          sat4 |      4,207        1.06       70.56
           scn |      4,207        1.06       71.63
           sea |      1,429        0.36       71.99
         sea_1 |      2,778        0.70       72.69
         sea_2 |      2,778        0.70       73.40
           seb |      4,207        1.06       74.46
           sec |      4,207        1.06       75.52
           sed |      4,207        1.06       76.59
           see |      4,207        1.06       77.65
           seg |      4,207        1.06       78.72
           seh |      1,429        0.36       79.08
         seh_1 |      2,778        0.70       79.78
         seh_2 |      2,778        0.70       80.49
           sei |      4,207        1.06       81.55
           sej |      4,207        1.06       82.62
          selr |      4,207        1.06       83.68
           sep |      4,207        1.06       84.74
           seu |      1,429        0.36       85.11
         seu_1 |      2,778        0.70       85.81
         seu_2 |      2,778        0.70       86.51
            st |      1,389        0.35       86.86
           str |      4,207        1.06       87.93
          tetk |      4,207        1.06       88.99
          tetl |      4,207        1.06       90.06
          tetm |      4,207        1.06       91.12
          teto |      4,207        1.06       92.19
         tsst1 |      4,207        1.06       93.25
         van_a |      4,207        1.06       94.32
         van_b |      4,207        1.06       95.38
         van_c |      4,207        1.06       96.44
          vgaa |      4,207        1.06       97.51
        vgaalc |      1,429        0.36       97.87
          vgab |      4,207        1.06       98.94
          vgba |      4,207        1.06      100.00
---------------+-----------------------------------
         Total |    395,178      100.00

. 
. drop tab

. 
. bysort sample: gen tab=1 if _n==1
(393,749 missing values generated)

. 
. summ tab

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |      1,429           1           0          1          1

. 
. noi di "from " r(sum) " samples"
from 1429 samples

. 
. tab set if tab==1, m

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
            |         40        2.80        2.80
 Collindale |        397       27.78       30.58
  Oxford491 |        491       34.36       64.94
  Oxford501 |        501       35.06      100.00
------------+-----------------------------------
      Total |      1,429      100.00

. 
. drop tab

. 
. 
. 
. save pipeline_predict_raw, replace
file pipeline_predict_raw.dta saved

. 
. 
. 
. ***********************************************************

. 
. * 1) Remove samples that are contaminated for all methods

. 
. *********************************************************

. 
. use pipeline_predict_raw, clear

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Remove samples that were contaminated for all methods" _n _dup(80) "="





================================================================================
 1 Remove samples that were contaminated for all methods
================================================================================

. 
. 
. 
. use pipeline_predict_raw, clear

. 
. preserve

. 
. reshape wide value  comment, i(set sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   395178   ->  153983
Number of variables                   6   ->       9
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
                               comments   ->   commentsgenefinder commentstypewriter commentszam
-----------------------------------------------------------------------------

. 
. noi display _N " sample sites"
153983 sample sites

. 
. restore

. 
. gen contam=.
(395,178 missing values generated)

. 
. replace contam=1 if inlist(sample,"C00012813", "C00001215", "C00001249", "C00012746", "C00012791")
(1,410 real changes made)

. 
. replace contam=1 if inlist(sample,"H113120068-138-1","H121000461-388-2","H131100031-408-2","H111840168-459-2","H111200061-196-2"
> )
(1,410 real changes made)

. 
. preserve

. 
. keep if contam==1
(392,358 observations deleted)

. 
. reshape wide value  comment, i(set sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     2820   ->    1085
Number of variables                   7   ->      10
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
                               comments   ->   commentsgenefinder commentstypewriter commentszam
-----------------------------------------------------------------------------

. 
. * count

. 
. bysort sample: gen count=1 if _n==1
(1,075 missing values generated)

. 
. summ contam if count==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      contam |         10           1           0          1          1

. 
. noi di r(sum) " samples contaminated"
10 samples contaminated

. 
. 
. 
. keep sample set site value* comment* 

. 
. compress
  variable sample was str20 now str16
  variable commentsgenefinder was str68 now str7
  variable valuegenefinder was str46 now str18
  variable commentstypewriter was str68 now str31
  variable valuetypewriter was str46 now str10
  variable commentszam was str68 now str1
  variable valuezam was str46 now str23
  (277,760 bytes saved)

. 
. sort sample site

. 
. order sample site value* comment*

. 
. 
. 
. noi save problem_samples, replace
file problem_samples.dta saved

. 
. 
. 
. 
. 
. restore

. 
. summ contam

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      contam |      2,820           1           0          1          1

. 
. noi di r(sum) " values for contaminated samples dropped from study"
2820 values for contaminated samples dropped from study

. 
. noi drop if contam==1
(2,820 observations deleted)

. 
. drop contam

. 
. compress
  (0 bytes saved)

. 
. save pipeline_noncontam, replace
file pipeline_noncontam.dta saved

. 
. *****************************************************

. 
. * clean site names

. 
. ******************************************************

. 
. use pipeline_noncontam, clear

. 
. noi di _n(5) _dup(80) "=" _n "consolidate names/ spelling errors for various sites" _n _dup(80) "=" 





================================================================================
consolidate names/ spelling errors for various sites
================================================================================

. 
. 
. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(4,177 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(4,177 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(12,531 real changes made)

. 
. replace site = "mlst" if site=="st"
(1,379 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(4,177 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(4,177 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(4,177 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "dfr")
(20,885 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "fus")
(8,354 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "ile")
(486 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "lnu")
(8,354 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "qac")
(12,531 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "van")
(12,531 real changes made)

. 
. 
. 
. 
. 
. compress
  (0 bytes saved)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. 
. 
. 
. 
. * some sites split into numbers variants; remerge

. 
. 
. 
. noi di "combining numbered variants into single sites"
combining numbered variants into single sites

. 
. 
. 
. use temp, clear

. 
. 
. 
. drop comments 

. 
. keep if strpos(site, "erma") | strpos(site,"ccr") | strpos(site, "se")
(286,834 observations deleted)

. 
. drop if inlist(site, "ccrcb", "ccrca", "ccrcc", "seb", "sec", "sed")
(25,062 observations deleted)

. 
. reshape wide value, i(set sample method) j(site) string
(note: j = ccra ccra_1 ccra_2 ccra_3 ccra_4 ccrb ccrb_1 ccrb_2 ccrb_3 ccrb_4 ccrb_6 erma erma_1 erma_2 sea sea_1 sea_2 see seg seh
>  seh_1 seh_2 sei sej selr sep seu seu_1 seu_2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    80462   ->    4177
Number of variables                   5   ->      32
j variable (29 values)             site   ->   (dropped)
xij variables:
                                  value   ->   valueccra valueccra_1 ... valueseu_2
-----------------------------------------------------------------------------

. 
. 
. 
. *erma

. 
. replace valueerma="A" if valueerma_1=="A" & valueerma_2=="A" &valueerma==""
(2,465 real changes made)

. 
. replace valueerma="P" if (valueerma_1=="P" | valueerma_2=="P" ) & valueerma==""
(293 real changes made)

. 
. assert valueerma!=""

. 
. drop valueerma_1 valueerma_2

. 
. 
. 
. *ccra

. 
. replace valueccra="A" if valueccra=="" & valueccra_1=="A" & valueccra_2=="A" & valueccra_3=="A" & valueccra_4=="A"
(2,025 real changes made)

. 
. replace valueccra="P" if valueccra=="" & (valueccra_1=="P"|  valueccra_2=="P"| valueccra_3=="P"| valueccra_4=="P")
(733 real changes made)

. 
. assert valueccra!=""

. 
. drop valueccra_*

. 
. 
. 
. * ccrb

. 
. replace valueccrb="A" if valueccrb=="" & valueccrb_1=="A" & valueccrb_2=="A" & valueccrb_3=="A" & valueccrb_4=="A" & valueccrb_6
> =="A" 
(2,054 real changes made)

. 
. replace valueccrb="P" if valueccrb=="" & (valueccrb_1=="P" | valueccrb_2=="P"|valueccrb_3=="P"|valueccrb_4=="P"|valueccrb_6=="P"
>  )
(704 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueccrb!="" if !strpos(sample, "C0001165")

. 
. drop valueccrb_*

. 
. 
. 
. * sea

. 
. replace valuesea="A" if valuesea_1=="A" & valuesea_2=="A"  & valuesea=="" 
(2,165 real changes made)

. 
. replace valuesea="P" if valuesea_1=="P" | valuesea_2=="P"  & valuesea=="" 
(593 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valuesea!=""  if !strpos(sample, "C0001165")

. 
. drop valuesea_*

. 
. 
. 
. *seh

. 
. replace valueseh="A" if valueseh_1=="A" & valueseh_2=="A"  & valueseh=="" 
(2,488 real changes made)

. 
. replace valueseh="P" if valueseh_1=="P" | valueseh_2=="P"  & valueseh=="" 
(270 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseh!=""  if !strpos(sample, "C0001165")

. 
. drop valueseh_*

. 
. 
. 
. *seu

. 
. replace valueseu="A" if valueseu_1=="A" & valueseu_2=="A" &  valueseu=="" 
(1,251 real changes made)

. 
. replace valueseu="P" if valueseu_1=="P" | valueseu_2=="P"  & valueseu=="" 
(1,507 real changes made)

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseu!=""  if !strpos(sample, "C0001165")

. 
. drop valueseu_*

. 
. 
. 
. reshape long
(note: j = ccra ccrb erma sea see seg seh sei sej selr sep seu)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     4177   ->   50124
Number of variables                  15   ->       5
j variable (12 values)                    ->   site
xij variables:
       valueccra valueccrb ... valueseu   ->   value
-----------------------------------------------------------------------------

. 
. rename value cleanvalue

. 
. 
. 
. merge 1:1 set sample method site using temp, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       375,330
        from master                    16,548  (_merge==1)
        from using                    358,782  (_merge==2)

    matched                            33,576
        not updated                    33,576  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. assert _merge!=4

. 
. assert _merge!=5

. 
. noi assert value == cleanvalue if _merge==3

. 
. noi tab site if _merge ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          ccra |      2,758       16.67       16.67
          ccrb |      2,758       16.67       33.33
          erma |      2,758       16.67       50.00
           sea |      2,758       16.67       66.67
           seh |      2,758       16.67       83.33
           seu |      2,758       16.67      100.00
---------------+-----------------------------------
         Total |     16,548      100.00

. 
. replace value = cleanvalue if value==""
(16,548 real changes made)

. 
. noi tab site if strpos(site, "_")

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
        ccra_1 |      2,758        5.88        5.88
        ccra_2 |      2,758        5.88       11.76
        ccra_3 |      2,758        5.88       17.65
        ccra_4 |      2,758        5.88       23.53
        ccrb_1 |      2,758        5.88       29.41
        ccrb_2 |      2,758        5.88       35.29
        ccrb_3 |      2,758        5.88       41.18
        ccrb_4 |      2,758        5.88       47.06
        ccrb_6 |      2,758        5.88       52.94
        erma_1 |      2,758        5.88       58.82
        erma_2 |      2,758        5.88       64.71
         sea_1 |      2,758        5.88       70.59
         sea_2 |      2,758        5.88       76.47
         seh_1 |      2,758        5.88       82.35
         seh_2 |      2,758        5.88       88.24
         seu_1 |      2,758        5.88       94.12
         seu_2 |      2,758        5.88      100.00
---------------+-----------------------------------
         Total |     46,886      100.00

. 
. drop if strpos(site, "_")
(46,886 observations deleted)

. 
. noi tab site if _merge==2 

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,177        1.34        1.34
    aaddaph4ia |      4,177        1.34        2.68
    aadeant6ia |      4,177        1.34        4.02
allelicprofile |      1,379        0.44        4.46
        ant9ia |      4,177        1.34        5.80
        ant9ib |      4,177        1.34        7.14
        aph2ic |      4,177        1.34        8.48
  apha3aph3iii |      4,177        1.34        9.82
            ar |      1,419        0.45       10.27
          arca |      4,177        1.34       11.61
          arcb |      4,177        1.34       12.95
          arcc |      4,177        1.34       14.29
          arcd |      4,177        1.34       15.63
          blaz |      4,177        1.34       16.97
           cat |      4,177        1.34       18.31
         ccrca |      4,177        1.34       19.65
         ccrcb |      4,177        1.34       20.99
         ccrcc |      4,177        1.34       22.32
           cfr |      4,177        1.34       23.66
           chp |      4,177        1.34       25.00
          dfra |      4,177        1.34       26.34
          dfrb |      4,177        1.34       27.68
          dfrc |      4,177        1.34       29.02
          dfrd |      4,177        1.34       30.36
          dfrg |      4,177        1.34       31.70
          dfrk |      4,177        1.34       33.04
          ermb |      4,177        1.34       34.38
          ermc |      4,177        1.34       35.72
          ermt |      4,177        1.34       37.06
          ermy |      4,177        1.34       38.40
           eta |      4,177        1.34       39.73
           etb |      4,177        1.34       41.07
           etd |      4,177        1.34       42.41
          fusa |      4,177        1.34       43.75
          fusb |      4,177        1.34       45.09
          fusc |      4,177        1.34       46.43
          grla |      4,177        1.34       47.77
          gyra |      4,177        1.34       49.11
          iles |      2,758        0.88       49.99
          isab |      4,177        1.34       51.33
          lnua |      4,177        1.34       52.67
          lnub |      4,177        1.34       54.01
           luk |      1,419        0.45       54.47
          lukm |      4,177        1.34       55.81
         lukmf |      4,177        1.34       57.14
        lukpvf |      4,177        1.34       58.48
        lukpvs |      4,177        1.34       59.82
          meca |      4,177        1.34       61.16
          mecc |      4,177        1.34       62.50
          mlst |      2,758        0.88       63.39
          mphc |      4,177        1.34       64.73
          msra |      4,177        1.34       66.06
          mupa |      4,177        1.34       67.40
          mupb |      4,177        1.34       68.74
          qaca |      4,177        1.34       70.08
          qacb |      4,177        1.34       71.42
       qaccsmr |      4,177        1.34       72.76
          rpob |      4,177        1.34       74.10
           sak |      4,177        1.34       75.44
          sasx |      4,177        1.34       76.78
          sat4 |      4,177        1.34       78.12
           scn |      4,177        1.34       79.46
           seb |      4,177        1.34       80.80
           sec |      4,177        1.34       82.14
           sed |      4,177        1.34       83.47
           str |      4,177        1.34       84.81
          tetk |      4,177        1.34       86.15
          tetl |      4,177        1.34       87.49
          tetm |      4,177        1.34       88.83
          teto |      4,177        1.34       90.17
         tsst1 |      4,177        1.34       91.51
          vana |      4,177        1.34       92.85
          vanb |      4,177        1.34       94.19
          vanc |      4,177        1.34       95.53
          vgaa |      4,177        1.34       96.87
        vgaalc |      1,419        0.45       97.32
          vgab |      4,177        1.34       98.66
          vgba |      4,177        1.34      100.00
---------------+-----------------------------------
         Total |    311,896      100.00

. 
. drop _merge cleanvalue comment

. 
.  
. 
. 
. 
. reshape wide value , i(sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   362020   ->  127590
Number of variables                   5   ->       6
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
-----------------------------------------------------------------------------

. 
. noi display _N " sample sites"
127590 sample sites

. 
. bysort sample: gen count1=1 if _n==1
(126,171 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,419           1           0          1          1

. 
. noi di r(sum) " samples"
1419 samples

. 
. bysort site: gen count2=1 if _n==1
(127,500 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         90           1           0          1          1

. 
. noi di r(sum) " sites"
90 sites

. 
. drop count*

. 
. 
. 
. save temp2, replace
file temp2.dta saved

. 
. 
. 
. 
. 
. **************************************************

. 
. * SITE TYPES

. 
. ***************************************************

. 
. use temp2, clear

. 
. 
. 
. gen type = "mlst"  if inlist(site, "mlst")
(126,211 missing values generated)

. 
. 
. 
. replace type = "virulence" if inlist(site, "arca","arcb", "arcc", "arcd", "sasx")
variable type was str4 now str9
(7,095 real changes made)

. 
. replace type = "virulence" if inlist(site, "sea", "sea1", "sea2", "seb", "sec", "sed" )
(5,676 real changes made)

. 
. replace type = "virulence" if inlist(site, "seh2", "sei", "sej", "selr", "sep","seu", "seu1", "seu2")
(7,095 real changes made)

. 
. replace type = "virulence" if inlist(site, "eta", "etb", "etd", "chp", "sak", "scn", "lukpvf" )
(9,933 real changes made)

. 
. replace type = "virulence" if inlist(site, "luk", "lukm", "lukmf", "lukpvs", "tsst1")
(7,095 real changes made)

. 
. replace type = "virulence" if inlist(site, "see", "seg", "seh", "seh1" )
(4,257 real changes made)

. 
. 
. 
. 
. 
. replace type = "ccr" if strpos(site, "ccr")==1
(7,095 real changes made)

. 
. 
. 
. replace type = "Chromosomal Resistance" if inlist(site, "iles", "gyra", "grla", "dfrb", "fusa", "rpob")
variable type was str9 now str22
(8,474 real changes made)

. 
. 
. 
. 
. 
. replace type = "Aquired Resistance"  if inlist(site, "blaz", "meca", "mecc", "aac6aph2" )
(5,676 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"aaddaph4ia","aadeant6ia", "ant9ia", "ant9ib","aph2ic", "apha3aph3iii" )
(8,514 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "str", "fusb", "fusc", "vana", "vanb", "vanc")
(8,514 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"lnua", "lnub", "isab", "vgaa", "vgab", "vgba","erma1", "erma2", "erma")
(9,933 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "ermb", "ermc", "ermy", "ermt", "msra", "mphc", "mupa", "mupb")
(11,352 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "sat4", "tetk", "tetl", "tetm", "teto", "dfra", "dfrc", "dfrd")
(11,352 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "dfrg", "dfrk", "cfr", "cat", "qaca", "qacb", "qaccsmr")
(9,933 real changes made)

. 
. 
. 
. 
. 
. 
. 
. * Summary 

. 
. noi display _N " sample sites"
127590 sample sites

. 
. noi tab type

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |     65,274       52.91       52.91
Chromosomal Resistance |      8,474        6.87       59.78
                   ccr |      7,095        5.75       65.53
                  mlst |      1,379        1.12       66.65
             virulence |     41,151       33.35      100.00
-----------------------+-----------------------------------
                 Total |    123,373      100.00

. 
. bysort sample: gen count1=1 if _n==1
(126,171 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,419           1           0          1          1

. 
. noi di r(sum) " samples"
1419 samples

. 
. bysort site: gen count2=1 if _n==1
(127,500 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         90           1           0          1          1

. 
. noi di r(sum) " sites"
90 sites

. 
. noi tab type if count2==1, m

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                       |          3        3.33        3.33
    Aquired Resistance |         46       51.11       54.44
Chromosomal Resistance |          6        6.67       61.11
                   ccr |          5        5.56       66.67
                  mlst |          1        1.11       67.78
             virulence |         29       32.22      100.00
-----------------------+-----------------------------------
                 Total |         90      100.00

. 
. noi tab site if type==""

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379       32.70       32.70
            ar |      1,419       33.65       66.35
        vgaalc |      1,419       33.65      100.00
---------------+-----------------------------------
         Total |      4,217      100.00

. 
. drop count*

. 
. 
. 
. save temp3, replace
file temp3.dta saved

. 
. 
. 
. 
. 
. **********************

. 
. *2) LOOK AT MISSING DATA BETWEEN METHODS

. 
. ****************************************************

. 
. noi di _n(5) _dup(80) "=" _n " 2 Missing data between methods" _n _dup(80) "="





================================================================================
 2 Missing data between methods
================================================================================

. 
. 
. 
. * how many values are missing

. 
. use temp3, clear

. 
. 
. 
. * create absence markers

. 
. gen  zbyte=( valuezam!="")

. 
. gen  tbyte=( valuetypewriter !="")

. 
. gen  gbyte=( valuegenefinder   !="")

. 
. gen new= string( tbyte ) + string(zbyte) + string(gbyte)

. 
. replace new ="Phenotype" if type=="Phenotype"
(0 real changes made)

. 
. noi di "sample-sites missing values - key (typewriter mykrobe genefinder)"
sample-sites missing values - key (typewriter mykrobe genefinder)

. 
. table new

----------------------
      new |      Freq.
----------+-----------
      000 |        172
      001 |      1,379
      010 |      7,445
      101 |      8,793
      111 |    109,801
----------------------

. 
. 
. 
. 
. 
. *000

. 
. summ zbyte if new=="000"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |        172           0           0          0          0

. 
. noi di r(N) " not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below"
172 not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below

. 
. 
. 
. 
. 
. *010

. 
. summ zbyte if new== "010"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      7,445           1           0          1          1

. 
. noi di r(N) " Called only by mykrobe"
7445 Called only by mykrobe

. 
. * vgaalc

. 
. noi tab site new if inlist(site, "vgaalc"), m

               |    new
          site |       010 |     Total
---------------+-----------+----------
        vgaalc |     1,419 |     1,419 
---------------+-----------+----------
         Total |     1,419 |     1,419 


. 
. summ zbyte if inlist(site, "vgaalc")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. 
. noi di r(N) " vgaalc only supplied by mykrobe, drop from database"
1419 vgaalc only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "vgaalc")
(1,419 observations deleted)

. 
. noi di _N " sample sites remaining" 
126171 sample sites remaining

. 
. * luk

. 
. noi tab site new if strpos(site, "luk"), m

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
           luk |     1,419          0 |     1,419 
          lukm |        40      1,379 |     1,419 
         lukmf |        40      1,379 |     1,419 
        lukpvf |        40      1,379 |     1,419 
        lukpvs |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 


. 
. summ zbyte if inlist(site, "luk")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. 
. noi di r(N) " luk only supplied by mykrobe, drop from database"
1419 luk only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "luk")
(1,419 observations deleted)

. 
. noi di _N " sample sites remaining" 
124752 sample sites remaining

. 
. * ar

. 
. noi tab site new if strpos(site, "ar"), m

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
            ar |     1,419          0 |     1,419 
          arca |        40      1,379 |     1,419 
          arcb |        40      1,379 |     1,419 
          arcc |        40      1,379 |     1,419 
          arcd |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 


. 
. summ zbyte if inlist(site, "ar")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. 
. noi di r(N) "ar only supplied by mykrobe, drop from database"
1419ar only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "ar")
(1,419 observations deleted)

. 
. noi di _N " sample sites remaining" 
123333 sample sites remaining

. 
. 
. 
. 
. 
. * samples not in other sets

. 
. vallist sample if new=="010", local(list)
C00011619 C00011654 C00001125 C00011641 C00011605 C00011593 C00011643 C00011571 C00011569 C00011632 C00011608 C00011570 C00011656 
> C00003214 C00011642 C00011594 C00011584 C00011572 C00011617 C00003117 C00011631 C00003094 C00011607 C00011582 C00003123 C0000329
> 3 C00011606 C00011655 C00011595 C00011618 C00011629 C00011630 C00011620 C00003342 C00011644 C00011581 C00011653 C00003273 C00009
> 009 C00011596

. 
. noi tab sample new if strpos("`list'", sample)

                     |          new
           Sample_id |       000        010 |     Total
---------------------+----------------------+----------
           C00001125 |         5         79 |        84 
           C00003094 |         5         79 |        84 
           C00003117 |         5         79 |        84 
           C00003123 |         5         79 |        84 
           C00003214 |         4         80 |        84 
           C00003273 |         5         79 |        84 
           C00003293 |         5         79 |        84 
           C00003342 |         5         79 |        84 
           C00009009 |         4         80 |        84 
           C00011569 |         4         80 |        84 
           C00011570 |         3         81 |        84 
           C00011571 |         5         79 |        84 
           C00011572 |         3         81 |        84 
           C00011581 |         5         79 |        84 
           C00011582 |         5         79 |        84 
           C00011584 |         5         79 |        84 
           C00011593 |         5         79 |        84 
           C00011594 |         2         82 |        84 
           C00011595 |         3         81 |        84 
           C00011596 |         3         81 |        84 
           C00011605 |         3         81 |        84 
           C00011606 |         5         79 |        84 
           C00011607 |         3         81 |        84 
           C00011608 |         5         79 |        84 
           C00011617 |         4         80 |        84 
           C00011618 |         5         79 |        84 
           C00011619 |         4         80 |        84 
           C00011620 |         5         79 |        84 
           C00011629 |         4         80 |        84 
           C00011630 |         5         79 |        84 
           C00011631 |         5         79 |        84 
           C00011632 |         5         79 |        84 
           C00011641 |         3         81 |        84 
           C00011642 |         5         79 |        84 
           C00011643 |         3         81 |        84 
           C00011644 |         3         81 |        84 
           C00011653 |         5         79 |        84 
           C00011654 |         5         79 |        84 
           C00011655 |         4         80 |        84 
           C00011656 |         5         79 |        84 
---------------------+----------------------+----------
               Total |       172      3,188 |     3,360 


. 
. bysort sample: gen count =1 if _n==1
(121,914 missing values generated)

. 
. summ zbyte if strpos("`list'", sample) & count==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |         40        .975    .1581139          0          1

. 
. noi di r(N) " samples are only processed by mykrobe - drop from comparision set"
40 samples are only processed by mykrobe - drop from comparision set

. 
. summ zbyte if strpos("`list'", sample) 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      3,360    .9488095    .2204189          0          1

. 
. noi di r(N) " sample sites affected"
3360 sample sites affected

. 
. drop if strpos("`list'", sample)
(3,360 observations deleted)

. 
. drop count 

. 
. 
. 
. *001

. 
. summ gbyte if new =="001"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       gbyte |      1,379           1           0          1          1

. 
. noi di r(N) "Called only by genefinder"
1379Called only by genefinder

. 
. noi di "sites in sample-sites only supplied by genefinder"
sites in sample-sites only supplied by genefinder

. 
. noi tab site if new =="001"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379      100.00      100.00
---------------+-----------------------------------
         Total |      1,379      100.00

. 
. * allelicprofile - drop

. 
. noi tab site new if inlist(site, "allelicprofile"), m

               |    new
          site |       001 |     Total
---------------+-----------+----------
allelicprofile |     1,379 |     1,379 
---------------+-----------+----------
         Total |     1,379 |     1,379 


. 
. summ zbyte if inlist(site, "allelicprofile")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,379           0           0          0          0

. 
. noi di r(N) " allelicprofile only supplied by genefinder, drop from database"
1379 allelicprofile only supplied by genefinder, drop from database

. 
. noi drop if inlist(site, "allelicprofile")
(1,379 observations deleted)

. 
. noi di _N " sample sites remaining" 
118594 sample sites remaining

. 
. assert new!="001"

. 
. 
. 
. 
. 
. 
. 
. * 101

. 
. summ zbyte if new =="101"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      8,793           0           0          0          0

. 
. noi di r(N) " no value in mykrobe, eg fusa"
8793 no value in mykrobe, eg fusa

. 
. noi tab site if new=="101"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          dfrb |      1,298       14.76       14.76
          fusa |      1,318       14.99       29.75
          grla |        979       11.13       40.88
          gyra |      1,085       12.34       53.22
          iles |      1,379       15.68       68.91
          mlst |      1,379       15.68       84.59
          rpob |      1,355       15.41      100.00
---------------+-----------------------------------
         Total |      8,793      100.00

. 
. noi tab valuezam if site=="fusa"

                              zam value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                 fus_E468V-GAA601104GTA |          1        1.64        1.64
                 fus_G452S-GGT601056AGT |          1        1.64        3.28
                 fus_H457Q-CAC601071CAA |          1        1.64        4.92
                 fus_H457Y-CAC601071TAC |          4        6.56       11.48
fus_H457Y-CAC601071TACfus_A67T-GCA599.. |          2        3.28       14.75
                 fus_L461F-TTA601083TTT |          1        1.64       16.39
                 fus_L461K-TTA601083AAA |         22       36.07       52.46
                 fus_L461S-TTA601083TCA |         17       27.87       80.33
fus_P404L-CCA600912CTAfus_L461F-TTA60.. |          1        1.64       81.97
                 fus_P404Q-CCA600912CAA |          1        1.64       83.61
                 fus_P406L-CCA600918CTA |          1        1.64       85.25
fus_P406L-CCA600918CTAfus_A67T-GCA599.. |          1        1.64       86.89
                  fus_V90I-GTA599970ATA |          8       13.11      100.00
----------------------------------------+-----------------------------------
                                  Total |         61      100.00

. 
. noi tab valuegenefinder valuetypewriter if site=="fusa" & valuezam==""

                      |         typewriter value
     genefinder value | 404:P=>..   656:T=>S         wt |     Total
----------------------+---------------------------------+----------
161:P-X;461:L-X;473.. |         1          0          0 |         1 
              373:D-G |         0          0          1 |         1 
              656:T-S |         0          1          0 |         1 
       71:A-X;160:A-X |         0          0          1 |         1 
71:A-X;373:D-X;456:.. |         0          0          2 |         2 
       71:A-X;456:L-X |         0          0          3 |         3 
                   wt |         0          0      1,309 |     1,309 
----------------------+---------------------------------+----------
                Total |         1          1      1,316 |     1,318 


. 
. noi di " problem is that mykrobe is not reporting absence of mutation as other than blank"
 problem is that mykrobe is not reporting absence of mutation as other than blank

. 
. vallist site if new=="101" & site!="mlst", local(list)
iles fusa rpob dfrb grla gyra

. 
. summ zbyte if strpos("`list'", site) & valuezam==""

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      7,414           0           0          0          0

. 
. noi di "solution: replace " r(N) " blanks in these sites in mykroke with wt -  not mlst which is not a mutation site"
solution: replace 7414 blanks in these sites in mykroke with wt -  not mlst which is not a mutation site

. 
. noi replace valuezam="wt" if  strpos("`list'", site) & valuezam==""
(7,414 real changes made)

. 
. 
. 
. * regen new

. 
. drop new

. 
. drop *byte

. 
. gen  zbyte=( valuezam!="")

. 
. gen  tbyte=( valuetypewriter !="")

. 
. gen  gbyte=( valuegenefinder   !="")

. 
. gen new= string( tbyte ) + string(zbyte) + string(gbyte)

. 
. noi tab new

        new |      Freq.     Percent        Cum.
------------+-----------------------------------
        101 |      1,379        1.16        1.16
        111 |    117,215       98.84      100.00
------------+-----------------------------------
      Total |    118,594      100.00

. 
. * mslt

. 
. noi assert site=="mlst" if new=="101" 

. 
. assert new =="111" if (type!="Phenotype" & site!="mlst")

. 
. noi di "all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)"
all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)

. 
. 
. 
. * save mlst results and drop

. 
. preserve

. 
. keep if site =="mlst"
(117,215 observations deleted)

. 
. gen ident =  strpos(valuetypewriter, valuegene) >0

. 
. replace ident = 1 if valueg=="Novel" & valuet=="NF"
(111 real changes made)

. 
. summ ident 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       ident |      1,379    .9934735    .0805517          0          1

. 
. noi di "mlst agreement between typewriter and genefinder in " r(sum) " cases out of " r(N)
mlst agreement between typewriter and genefinder in 1370 cases out of 1379

. 
. noi di "value missing for all mykrobe"
value missing for all mykrobe

. 
. noi di "rest"
rest

. 
. noi tab valueg valuet if ident==0

                      |   typewriter value
     genefinder value |        NF  Saur-ST.. |     Total
----------------------+----------------------+----------
                  182 |         1          0 |         1 
                   22 |         1          0 |         1 
                 2415 |         1          0 |         1 
                 2416 |         1          0 |         1 
                 2889 |         1          0 |         1 
                  425 |         1          0 |         1 
                    7 |         1          0 |         1 
                   80 |         1          0 |         1 
                Novel |         0          1 |         1 
----------------------+----------------------+----------
                Total |         8          1 |         9 


. 
. keep sample valueg valuet ident

. 
. save mlst, replace
file mlst.dta saved

. 
. restore

. 
. gen marker =1 if site=="mlst"
(117,215 missing values generated)

. 
. summ marker

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      marker |      1,379           1           0          1          1

. 
. noi di "dropping " r(sum) " mlst sites"
dropping 1379 mlst sites

. 
. noi drop if marker==1
(1,379 observations deleted)

. 
. drop marker

. 
. 
. 
. 
. 
. * count how many sample sites left

. 
. 
. 
. noi display _N " sample sites"
117215 sample sites

. 
. bysort sample: gen count1=1 if _n==1
(115,836 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. 
. noi di r(sum) " samples"
1379 samples

. 
. bysort site: gen count2=1 if _n==1
(117,130 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         85           1           0          1          1

. 
. noi di r(sum) " sites"
85 sites

. 
. bysort site: gen count3=1 if _n==1 & site!="mlst" & type!="Phenotype"
(117,130 missing values generated)

. 
. summ count3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count3 |         85           1           0          1          1

. 
. noi di r(sum) " sites not including Phenotype results and mlst"
85 sites not including Phenotype results and mlst

. 
. drop count* new *byte

. 
. 
. 
. 
. 
.  
. 
. save temp4, replace
file temp4.dta saved

. 
. *************************************

. 
. 
. 
. * then add which go with which antibiotic (based on new sheet by clare)

. 
. **********************************************************

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 4 Match to antibiotic prediction" _n _dup(80) "="





================================================================================
 4 Match to antibiotic prediction
================================================================================

. 
. 
. 
. 
. 
. *clean up non binary values

. 
. use temp4, clear

. 
. reshape long
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   117215   ->  351645
Number of variables                   7   ->       6
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. 
. 
. 
. 
. 
.  noi di "missing values"
missing values

. 
. replace value = upper(value)
(23,226 real changes made)

. 
. gen ambi = 1 if inlist(value, "ND", "NT", "LOW COV", "MIXED")
(351,643 missing values generated)

. 
. replace ambi=1 if inlist(value, "NOT DONE", "N/A", "NF", "NA", "-", "X")
(1 real change made)

. 
. summ ambi if ambi ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ambi |          3           1           0          1          1

. 
. noi di r(N) " values have N/A or equivalent values, set these all to A"
3 values have N/A or equivalent values, set these all to A

. 
. noi list site value if ambi==1

        +--------------+
        | site   value |
        |--------------|
133225. | gyra      ND |
143938. | iles      ND |
332620. |  etd       X |
        +--------------+

. 
. noi replace value = "A" if ambi==1
(3 real changes made)

. 
. tab site if ambi ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           etd |          1       33.33       33.33
          gyra |          1       33.33       66.67
          iles |          1       33.33      100.00
---------------+-----------------------------------
         Total |          3      100.00

. 
. drop ambi

. 
. 
. 
. noi di "all values equal A or P, unless chromosonal"
all values equal A or P, unless chromosonal

. 
. replace value=upper(value)
(0 real changes made)

. 
. 
. 
. assert inlist(value, "A", "P") if !strpos(type, "Chro")

. 
. 
. 
. ***************

. 
. gen count = 1 if strpos(value, "=>")
(350,853 missing values generated)

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |        792           1           0          1          1

. 
. noi di r(N) " replace => with - to create uniform recording of mutations"
792 replace => with - to create uniform recording of mutations

. 
. noi replace value = subinstr(value, "=>", "-",.)
(792 real changes made)

. 
. drop count 

. 
. 
. 
. 
. 
. gen count = 1 if strpos(value," ")
(351,641 missing values generated)

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          4           1           0          1          1

. 
. noi di r(N) " remove all spaces in value reports"
4 remove all spaces in value reports

. 
. noi replace value = subinstr(value, " ", "",.)
(4 real changes made)

. 
. drop count 

. 
. 
. 
. * fix new mykrobe output

. 
. gen start=strpos(value,"_")

. 
. gen end= strpos(value, "-")

. 
. replace value= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) if site==lower(substr(va
> lue,1,4)) & strpos(type, "Chr") & method=="zam"
(799 real changes made)

. 
. drop start end

. 
. 
. 
. *swap to binary the point mutations

. 
. * clarify absenses

. 
. gen count = 1  if value=="WT" & strpos(type, "Chromo")
(329,281 missing values generated)

. 
. summ count if count==1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |     22,364           1           0          1          1

. 
. noi di r(N) "replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations"
22364replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations

. 
. noi replace value = "A" if count==1 
(22,364 real changes made)

. 
. drop count

. 
. 
. 
. * clarify point mutations based on clare's paper

. 
. noi di "mutations: if count!=1 then no considered positive as not in panal on clare's paper"
mutations: if count!=1 then no considered positive as not in panal on clare's paper

. 
. *gyra

. 
. noi di "gyra mutations"
gyra mutations

. 
. gen count =1 if value =="84:S-L" & strpos(site, "gyra")
(350,769 missing values generated)

. 
. noi tab value count if site=="gyra" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               84:S-A |         0          3 |         3 
               84:S-L |       876          0 |       876 
               84:S-V |         0          1 |         1 
               84:S-X |         0          2 |         2 
        84:S-X;88:E-X |         0          1 |         1 
----------------------+----------------------+----------
                Total |       876          7 |       883 


. 
. replace value = "P" if count ==1
(876 real changes made)

. 
. noi tab value count if site=="gyra" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               84:S-A |         0          3 |         3 
               84:S-V |         0          1 |         1 
               84:S-X |         0          2 |         2 
        84:S-X;88:E-X |         0          1 |         1 
                    A |         0      3,254 |     3,254 
                    P |       876          0 |       876 
----------------------+----------------------+----------
                Total |       876      3,261 |     4,137 


. 
. drop count 

. 
. *grla

. 
. noi di "grla mutations"
grla mutations

. 
. gen count =1 if strpos(value, "80:S-F") & strpos(site, "grla")
(350,746 missing values generated)

. 
. replace count=1 if strpos(value, "80:S-Y") & strpos(site, "grla")
(12 real changes made)

. 
. replace count=1  if strpos(value, "84:E-G") & strpos(site, "grla")
(1 real change made)

. 
. noi tab value count if site=="grla" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               45:I-M |         0        101 |       101 
               80:S-F |       896          0 |       896 
        80:S-F;84:E-K |         3          0 |         3 
               80:S-Y |        12          0 |        12 
               84:E-G |         1          0 |         1 
----------------------+----------------------+----------
                Total |       912        101 |     1,013 


. 
. replace value = "P" if count ==1
(912 real changes made)

. 
. noi tab value count if site=="grla" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               45:I-M |         0        101 |       101 
                    A |         0      3,124 |     3,124 
                    P |       912          0 |       912 
----------------------+----------------------+----------
                Total |       912      3,225 |     4,137 


. 
. drop count 

. 
. 
. 
. 
. 
. * fusa

. 
. noi di "fusa mutations"
fusa mutations

. 
. 
. 
. gen count =1 if strpos(value, "114:P-H") & strpos(site, "fusa")
(351,645 missing values generated)

. 
. replace count =1  if strpos(value, "461:L-K") & strpos(site, "fusa")
(44 real changes made)

. 
. replace count =1  if strpos(value, "461:L-S") & strpos(site, "fusa")
(34 real changes made)

. 
. replace count =1  if strpos(value, "404:P-L") & strpos(site, "fusa")
(2 real changes made)

. 
. replace count =1  if strpos(value, "90:V-I") & strpos(site, "fusa")
(14 real changes made)

. 
. replace count =1  if strpos(value, "457:H-Y") & strpos(site, "fusa")
(12 real changes made)

. 
. replace count =1 if strpos(value, "67:A-T") & strpos(site, "fusa")
(1 real change made)

. 
. replace count =1 if strpos(value, "406:P-L") & strpos(site, "fusa")
(3 real changes made)

. 
. replace count =1 if strpos(value, "464:R-S") & strpos(site, "fusa")
(0 real changes made)

. 
. replace count =1  if strpos(value, "464:R-H") & strpos(site, "fusa")
(0 real changes made)

. 
. replace count =1  if strpos(value, "457:H-Q") & strpos(site, "fusa")
(2 real changes made)

. 
. replace count =1  if strpos(value, "453:M-I") & strpos(site, "fusa")
(0 real changes made)

. 
. replace count =1  if strpos(value, "452:G-C") & strpos(site, "fusa")
(0 real changes made)

. 
. replace count =1  if strpos(value, "452:G-S") & strpos(site, "fusa")
(2 real changes made)

. 
. replace count =1  if strpos(value, "404:P-Q") & strpos(site, "fusa")
(2 real changes made)

. 
. noi tab value count if site=="fusa" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
376:A-T;404:P-L;461.. |         1          0 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
      404:P-L,461:L-F |         1          0 |         1 
              404:P-Q |         2          0 |         2 
              406:P-L |         3          0 |         3 
              452:G-S |         2          0 |         2 
              457:H-Q |         2          0 |         2 
              457:H-Y |        10          0 |        10 
              461:L-F |         0          2 |         2 
              461:L-K |        44          0 |        44 
              461:L-S |        34          0 |        34 
              656:T-S |         0          2 |         2 
       67:A-T;406:P-L |         1          0 |         1 
       67:A-T;457:H-Y |         2          0 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
               90:V-I |        14          0 |        14 
FUS_E468V-GAA601104.. |         0          1 |         1 
FUS_G452S-GGT601056.. |         0          1 |         1 
FUS_H457Q-CAC601071.. |         0          1 |         1 
FUS_H457Y-CAC601071.. |         0          4 |         4 
FUS_H457Y-CAC601071.. |         0          2 |         2 
FUS_L461F-TTA601083.. |         0          1 |         1 
FUS_L461K-TTA601083.. |         0         22 |        22 
FUS_L461S-TTA601083.. |         0         17 |        17 
FUS_P404L-CCA600912.. |         0          1 |         1 
FUS_P404Q-CCA600912.. |         0          1 |         1 
FUS_P406L-CCA600918.. |         0          1 |         1 
FUS_P406L-CCA600918.. |         0          1 |         1 
FUS_V90I-GTA599970ATA |         0          8 |         8 
----------------------+----------------------+----------
                Total |       116         76 |       192 


. 
. replace value = "P" if count ==1
(116 real changes made)

. 
. noi tab value count if site=="fusa" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
              461:L-F |         0          2 |         2 
              656:T-S |         0          2 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
                    A |         0      3,945 |     3,945 
FUS_E468V-GAA601104.. |         0          1 |         1 
FUS_G452S-GGT601056.. |         0          1 |         1 
FUS_H457Q-CAC601071.. |         0          1 |         1 
FUS_H457Y-CAC601071.. |         0          4 |         4 
FUS_H457Y-CAC601071.. |         0          2 |         2 
FUS_L461F-TTA601083.. |         0          1 |         1 
FUS_L461K-TTA601083.. |         0         22 |        22 
FUS_L461S-TTA601083.. |         0         17 |        17 
FUS_P404L-CCA600912.. |         0          1 |         1 
FUS_P404Q-CCA600912.. |         0          1 |         1 
FUS_P406L-CCA600918.. |         0          1 |         1 
FUS_P406L-CCA600918.. |         0          1 |         1 
FUS_V90I-GTA599970ATA |         0          8 |         8 
                    P |       116          0 |       116 
----------------------+----------------------+----------
                Total |       116      4,021 |     4,137 


. 
. drop count 

. 
. 
. 
. 
. 
. *rpob

. 
. noi di "rpob mutations"
rpob mutations

. 
. gen count =1 if strpos(value, "464:S-P") & strpos(site, "rpob")
(351,642 missing values generated)

. 
. replace count =1   if strpos(value, "468:Q-R") & strpos(site, "rpob")
(1 real change made)

. 
. replace count =1  if strpos(value, "471:D-Y") & strpos(site, "rpob")
(0 real changes made)

. 
. replace count =1  if strpos(value, "477:A-D") & strpos(site, "rpob")
(3 real changes made)

. 
. replace count =1   if strpos(value, "481:H-N") & strpos(site, "rpob")
(48 real changes made)

. 
. replace count =1  if strpos(value, "481:H-Y") & strpos(site, "rpob")
(17 real changes made)

. 
. noi tab value count if site=="rpob" & strpos(value, "-") , m

                      |   count
                value |         1 |     Total
----------------------+-----------+----------
              464:S-P |         3 |         3 
              468:Q-R |         1 |         1 
              477:A-D |         3 |         3 
              481:H-N |        48 |        48 
              481:H-Y |        17 |        17 
----------------------+-----------+----------
                Total |        72 |        72 


. 
. noi replace value = "P" if count ==1
(72 real changes made)

. 
. noi tab value count if site=="rpob" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
                    A |         0      4,065 |     4,065 
                    P |        72          0 |        72 
----------------------+----------------------+----------
                Total |        72      4,065 |     4,137 


. 
. drop count 

. 
. 
. 
. 
. 
. *dfrb

. 
. noi di "dfrb mutations"
dfrb mutations

. 
. gen count =1 if  strpos(value, "150:H-R") & strpos(site, "dfrb")
(351,627 missing values generated)

. 
. replace count =1   if  strpos(value, "21:L-V") & strpos(site, "dfrb")
(2 real changes made)

. 
. replace count =1   if strpos(value, "31:H-N") & strpos(site, "dfrb")
(2 real changes made)

. 
. replace count =1   if strpos(value, "41:L-F") & strpos(site, "dfrb")
(3 real changes made)

. 
. replace count =1   if strpos(value, "99:F-S") & strpos(site, "dfrb")
(0 real changes made)

. 
. replace count =1   if  strpos(value, "99:F-Y") & strpos(site, "dfrb")
(220 real changes made)

. 
. noi tab value count if site=="dfrb" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
              150:H-R |        18          0 |        18 
               21:L-V |         1          0 |         1 
        21:L-V;99:F-Y |         1          0 |         1 
               31:H-N |         2          0 |         2 
               41:L-F |         3          0 |         3 
               99:F-X |         0          1 |         1 
               99:F-Y |       220          0 |       220 
----------------------+----------------------+----------
                Total |       245          1 |       246 


. 
. noi replace value = "P" if count ==1
(245 real changes made)

. 
. noi tab value count if site=="dfrb" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               99:F-X |         0          1 |         1 
                    A |         0      3,891 |     3,891 
                    P |       245          0 |       245 
----------------------+----------------------+----------
                Total |       245      3,892 |     4,137 


. 
. drop count 

. 
. 
. 
. * replace all other point mutations as A

. 
. noi di "replace mutations not in table with A"
replace mutations not in table with A

. 
. gen count=1 if !inlist(value, "P", "A")& strpos(type, "Chromo")& inlist(method, "genefinder", "typewriter", "zam") & value!=""
(351,410 missing values generated)

. 
. tab value site if count==1, m

                      |                          site
                value |      dfrb       fusa       grla       gyra       iles |     Total
----------------------+-------------------------------------------------------+----------
161:P-X;461:L-X;473.. |         0          1          0          0          0 |         1 
              326:T-I |         0          2          0          0          0 |         2 
              373:D-G |         0          1          0          0          0 |         1 
404:P-?,406:P-?NONC.. |         0          1          0          0          0 |         1 
               45:I-M |         0          0        101          0          0 |       101 
              461:L-F |         0          2          0          0          0 |         2 
              588:V-F |         0          0          0          0         50 |        50 
              656:T-S |         0          2          0          0          0 |         2 
       71:A-X;160:A-X |         0          1          0          0          0 |         1 
71:A-X;373:D-X;456:.. |         0          2          0          0          0 |         2 
       71:A-X;456:L-X |         0          3          0          0          0 |         3 
               84:S-A |         0          0          0          3          0 |         3 
               84:S-V |         0          0          0          1          0 |         1 
               84:S-X |         0          0          0          2          0 |         2 
        84:S-X;88:E-X |         0          0          0          1          0 |         1 
               99:F-X |         1          0          0          0          0 |         1 
FUS_E468V-GAA601104.. |         0          1          0          0          0 |         1 
FUS_G452S-GGT601056.. |         0          1          0          0          0 |         1 
FUS_H457Q-CAC601071.. |         0          1          0          0          0 |         1 
FUS_H457Y-CAC601071.. |         0          4          0          0          0 |         4 
FUS_H457Y-CAC601071.. |         0          2          0          0          0 |         2 
FUS_L461F-TTA601083.. |         0          1          0          0          0 |         1 
FUS_L461K-TTA601083.. |         0         22          0          0          0 |        22 
FUS_L461S-TTA601083.. |         0         17          0          0          0 |        17 
FUS_P404L-CCA600912.. |         0          1          0          0          0 |         1 
FUS_P404Q-CCA600912.. |         0          1          0          0          0 |         1 
FUS_P406L-CCA600918.. |         0          1          0          0          0 |         1 
FUS_P406L-CCA600918.. |         0          1          0          0          0 |         1 
FUS_V90I-GTA599970ATA |         0          8          0          0          0 |         8 
----------------------+-------------------------------------------------------+----------
                Total |         1         76        101          7         50 |       235 


. 
. replace value="A" if count==1 & value!="NA"
(235 real changes made)

. 
. drop count

. 
. 
. 
. 
. 
. 
. 
. * swap blanks to dashes to make easier to see

. 
. assert value!=""

. 
. replace site=lower(site)
(0 real changes made)

. 
. noi bysort type: tab site value, m 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
      aac6aph2 |     3,904        233 |     4,137 
    aaddaph4ia |     3,873        264 |     4,137 
    aadeant6ia |     4,040         97 |     4,137 
        ant9ia |     3,691        446 |     4,137 
        ant9ib |     4,137          0 |     4,137 
        aph2ic |     4,137          0 |     4,137 
  apha3aph3iii |     3,981        156 |     4,137 
          blaz |       615      3,522 |     4,137 
           cat |     4,137          0 |     4,137 
           cfr |     4,128          9 |     4,137 
          dfra |     4,028        109 |     4,137 
          dfrc |     4,058         79 |     4,137 
          dfrd |     4,137          0 |     4,137 
          dfrg |     3,976        161 |     4,137 
          dfrk |     4,119         18 |     4,137 
          erma |     3,690        447 |     4,137 
          ermb |     4,127         10 |     4,137 
          ermc |     3,575        562 |     4,137 
          ermt |     4,077         60 |     4,137 
          ermy |     4,137          0 |     4,137 
          fusb |     4,065         72 |     4,137 
          fusc |     3,908        229 |     4,137 
          isab |     4,137          0 |     4,137 
          lnua |     4,104         33 |     4,137 
          lnub |     4,133          4 |     4,137 
          meca |     2,989      1,148 |     4,137 
          mecc |     4,085         52 |     4,137 
          mphc |     4,085         52 |     4,137 
          msra |     4,081         56 |     4,137 
          mupa |     4,088         49 |     4,137 
          mupb |     4,137          0 |     4,137 
          qaca |     3,998        139 |     4,137 
          qacb |     4,043         94 |     4,137 
       qaccsmr |     3,962        175 |     4,137 
          sat4 |     3,984        153 |     4,137 
           str |     4,125         12 |     4,137 
          tetk |     3,818        319 |     4,137 
          tetl |     4,130          7 |     4,137 
          tetm |     4,020        117 |     4,137 
          teto |     4,137          0 |     4,137 
          vana |     4,137          0 |     4,137 
          vanb |     4,137          0 |     4,137 
          vanc |     4,137          0 |     4,137 
          vgaa |     4,134          3 |     4,137 
          vgab |     4,137          0 |     4,137 
          vgba |     4,137          0 |     4,137 
---------------+----------------------+----------
         Total |   181,415      8,887 |   190,302 


----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
          dfrb |     3,892        245 |     4,137 
          fusa |     4,021        116 |     4,137 
          grla |     3,225        912 |     4,137 
          gyra |     3,261        876 |     4,137 
          iles |     4,137          0 |     4,137 
          rpob |     4,065         72 |     4,137 
---------------+----------------------+----------
         Total |    22,601      2,221 |    24,822 


----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
          ccra |     3,029      1,108 |     4,137 
          ccrb |     3,066      1,071 |     4,137 
         ccrca |     4,036        101 |     4,137 
         ccrcb |     4,061         76 |     4,137 
         ccrcc |     4,050         87 |     4,137 
---------------+----------------------+----------
         Total |    18,242      2,443 |    20,685 


----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence

               |         value
          site |         A          P |     Total
---------------+----------------------+----------
          arca |     4,118         19 |     4,137 
          arcb |     4,124         13 |     4,137 
          arcc |     4,124         13 |     4,137 
          arcd |     4,124         13 |     4,137 
           chp |     1,381      2,756 |     4,137 
           eta |     4,013        124 |     4,137 
           etb |     4,118         19 |     4,137 
           etd |     3,959        178 |     4,137 
          lukm |     4,110         27 |     4,137 
         lukmf |     4,116         21 |     4,137 
        lukpvf |     3,800        337 |     4,137 
        lukpvs |     3,805        332 |     4,137 
           sak |       922      3,215 |     4,137 
          sasx |     4,107         30 |     4,137 
           scn |       452      3,685 |     4,137 
           sea |     3,234        903 |     4,137 
           seb |     3,803        334 |     4,137 
           sec |     3,449        688 |     4,137 
           sed |     3,933        204 |     4,137 
           see |     4,124         13 |     4,137 
           seg |     1,822      2,315 |     4,137 
           seh |     3,727        410 |     4,137 
           sei |     1,823      2,314 |     4,137 
           sej |     3,925        212 |     4,137 
          selr |     3,933        204 |     4,137 
           sep |     3,803        334 |     4,137 
           seu |     1,838      2,299 |     4,137 
         tsst1 |     3,356        781 |     4,137 
---------------+----------------------+----------
         Total |    94,043     21,793 |   115,836 



. 
. 
. 
. save temp5, replace
file temp5.dta saved

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 5 Cleaned summary" _n _dup(80) "="





================================================================================
 5 Cleaned summary
================================================================================

. 
. 
. 
. ***************************************

. 
. * Summary 

. 
. ****************************************

. 
. noi display _N " sample sites"
351645 sample sites

. 
. noi tab type

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |    190,302       54.12       54.12
Chromosomal Resistance |     24,822        7.06       61.18
                   ccr |     20,685        5.88       67.06
             virulence |    115,836       32.94      100.00
-----------------------+-----------------------------------
                 Total |    351,645      100.00

. 
. bysort sample: gen count1=1 if _n==1
(350,266 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. 
. noi di r(sum) " samples"
1379 samples

. 
. bysort site: gen count2=1 if _n==1
(351,560 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         85           1           0          1          1

. 
. noi di r(sum) " sites"
85 sites

. 
. noi tab type if count2==1, m

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |         46       54.12       54.12
Chromosomal Resistance |          6        7.06       61.18
                   ccr |          5        5.88       67.06
             virulence |         28       32.94      100.00
-----------------------+-----------------------------------
                 Total |         85      100.00

. 
. noi tab site if type==""
no observations

. 
. drop count*

. 
. 
. 
. 
. 
. noi di "values by type"
values by type

. 
. noi bysort type: tab value 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |    181,415       95.33       95.33
                                      P |      8,887        4.67      100.00
----------------------------------------+-----------------------------------
                                  Total |    190,302      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |     22,601       91.05       91.05
                                      P |      2,221        8.95      100.00
----------------------------------------+-----------------------------------
                                  Total |     24,822      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |     18,242       88.19       88.19
                                      P |      2,443       11.81      100.00
----------------------------------------+-----------------------------------
                                  Total |     20,685      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |     94,043       81.19       81.19
                                      P |     21,793       18.81      100.00
----------------------------------------+-----------------------------------
                                  Total |    115,836      100.00


. 
. 
. 
. noi di "breakdown by site"
breakdown by site

. 
. noi bysort type site:  tab value 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aac6aph2

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,904       94.37       94.37
                                      P |        233        5.63      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aaddaph4ia

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,873       93.62       93.62
                                      P |        264        6.38      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aadeant6ia

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,040       97.66       97.66
                                      P |         97        2.34      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ia

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,691       89.22       89.22
                                      P |        446       10.78      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ib

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aph2ic

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = apha3aph3iii

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,981       96.23       96.23
                                      P |        156        3.77      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = blaz

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |        615       14.87       14.87
                                      P |      3,522       85.13      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cat

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cfr

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,128       99.78       99.78
                                      P |          9        0.22      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfra

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,028       97.37       97.37
                                      P |        109        2.63      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,058       98.09       98.09
                                      P |         79        1.91      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrd

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrg

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,976       96.11       96.11
                                      P |        161        3.89      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrk

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,119       99.56       99.56
                                      P |         18        0.44      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = erma

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,690       89.20       89.20
                                      P |        447       10.80      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,127       99.76       99.76
                                      P |         10        0.24      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,575       86.42       86.42
                                      P |        562       13.58      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermt

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,077       98.55       98.55
                                      P |         60        1.45      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermy

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,065       98.26       98.26
                                      P |         72        1.74      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,908       94.46       94.46
                                      P |        229        5.54      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = isab

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnua

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,104       99.20       99.20
                                      P |         33        0.80      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnub

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,133       99.90       99.90
                                      P |          4        0.10      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = meca

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      2,989       72.25       72.25
                                      P |      1,148       27.75      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mecc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,085       98.74       98.74
                                      P |         52        1.26      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mphc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,085       98.74       98.74
                                      P |         52        1.26      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = msra

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,081       98.65       98.65
                                      P |         56        1.35      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupa

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,088       98.82       98.82
                                      P |         49        1.18      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaca

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,998       96.64       96.64
                                      P |        139        3.36      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qacb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,043       97.73       97.73
                                      P |         94        2.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaccsmr

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,962       95.77       95.77
                                      P |        175        4.23      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = sat4

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,984       96.30       96.30
                                      P |        153        3.70      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = str

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,125       99.71       99.71
                                      P |         12        0.29      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetk

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,818       92.29       92.29
                                      P |        319        7.71      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetl

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,130       99.83       99.83
                                      P |          7        0.17      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetm

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,020       97.17       97.17
                                      P |        117        2.83      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = teto

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vana

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgaa

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,134       99.93       99.93
                                      P |          3        0.07      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgab

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgba

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = dfrb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,892       94.08       94.08
                                      P |        245        5.92      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = fusa

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,021       97.20       97.20
                                      P |        116        2.80      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = grla

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,225       77.96       77.96
                                      P |        912       22.04      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = gyra

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,261       78.83       78.83
                                      P |        876       21.17      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = iles

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,137      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = rpob

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,065       98.26       98.26
                                      P |         72        1.74      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccra

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,029       73.22       73.22
                                      P |      1,108       26.78      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,066       74.11       74.11
                                      P |      1,071       25.89      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrca

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,036       97.56       97.56
                                      P |        101        2.44      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,061       98.16       98.16
                                      P |         76        1.84      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,050       97.90       97.90
                                      P |         87        2.10      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arca

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,118       99.54       99.54
                                      P |         19        0.46      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,124       99.69       99.69
                                      P |         13        0.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcc

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,124       99.69       99.69
                                      P |         13        0.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcd

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,124       99.69       99.69
                                      P |         13        0.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = chp

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      1,381       33.38       33.38
                                      P |      2,756       66.62      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = eta

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,013       97.00       97.00
                                      P |        124        3.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,118       99.54       99.54
                                      P |         19        0.46      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etd

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,959       95.70       95.70
                                      P |        178        4.30      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukm

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,110       99.35       99.35
                                      P |         27        0.65      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukmf

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,116       99.49       99.49
                                      P |         21        0.51      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvf

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,800       91.85       91.85
                                      P |        337        8.15      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvs

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,805       91.97       91.97
                                      P |        332        8.03      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sak

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |        922       22.29       22.29
                                      P |      3,215       77.71      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sasx

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,107       99.27       99.27
                                      P |         30        0.73      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = scn

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |        452       10.93       10.93
                                      P |      3,685       89.07      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sea

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,234       78.17       78.17
                                      P |        903       21.83      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seb

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,803       91.93       91.93
                                      P |        334        8.07      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sec

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,449       83.37       83.37
                                      P |        688       16.63      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sed

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,933       95.07       95.07
                                      P |        204        4.93      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = see

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      4,124       99.69       99.69
                                      P |         13        0.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seg

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      1,822       44.04       44.04
                                      P |      2,315       55.96      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seh

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,727       90.09       90.09
                                      P |        410        9.91      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sei

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      1,823       44.07       44.07
                                      P |      2,314       55.93      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sej

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,925       94.88       94.88
                                      P |        212        5.12      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = selr

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,933       95.07       95.07
                                      P |        204        4.93      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sep

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,803       91.93       91.93
                                      P |        334        8.07      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seu

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      1,838       44.43       44.43
                                      P |      2,299       55.57      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = tsst1

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |      3,356       81.12       81.12
                                      P |        781       18.88      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,137      100.00


. 
. 
. 
. noi di "breakdown by method"
breakdown by method

. 
. noi bysort method: tab value

----------------------------------------------------------------------------------------------------------------------------------
-> method = genefinder

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |    105,589       90.08       90.08
                                      P |     11,626        9.92      100.00
----------------------------------------+-----------------------------------
                                  Total |    117,215      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> method = typewriter

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |    105,705       90.18       90.18
                                      P |     11,510        9.82      100.00
----------------------------------------+-----------------------------------
                                  Total |    117,215      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> method = zam

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      A |    105,007       89.58       89.58
                                      P |     12,208       10.42      100.00
----------------------------------------+-----------------------------------
                                  Total |    117,215      100.00


. 
. 
. 
. save pipeline_clean_all_values_long, replace
file pipeline_clean_all_values_long.dta saved

. 
. 
. 
. **********

. 
. * and wide

. 
. noi di "Compare site values between methods"
Compare site values between methods

. 
. 
. 
. reshape wide
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   351645   ->  117215
Number of variables                   6   ->       7
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
-----------------------------------------------------------------------------

. 
. gen ValueAll = valuet  + valuez + valueg

. 
. noi tab ValueAll , sort m

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |    104,923       89.51       89.51
        PPP |     11,279        9.62       99.14
        APA |        501        0.43       99.56
        APP |        263        0.22       99.79
        PPA |        165        0.14       99.93
        PAP |         66        0.06       99.98
        AAP |         18        0.02      100.00
------------+-----------------------------------
      Total |    117,215      100.00

. 
. 
. 
. noi di "values by type"
values by type

. 
. noi bysort type: tab ValueA, sort  m 

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     60,238       94.96       94.96
        PPP |      2,785        4.39       99.35
        APA |        284        0.45       99.80
        PPA |         81        0.13       99.93
        APP |         40        0.06       99.99
        AAP |          6        0.01      100.00
------------+-----------------------------------
      Total |     63,434      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      7,508       90.74       90.74
        PPP |        694        8.39       99.13
        PAP |         66        0.80       99.93
        AAP |          3        0.04       99.96
        APA |          2        0.02       99.99
        PPA |          1        0.01      100.00
------------+-----------------------------------
      Total |      8,274      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      6,005       87.09       87.09
        PPP |        744       10.79       97.88
        APA |         72        1.04       98.93
        PPA |         38        0.55       99.48
        APP |         27        0.39       99.87
        AAP |          9        0.13      100.00
------------+-----------------------------------
      Total |      6,895      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     31,172       80.73       80.73
        PPP |      7,056       18.27       99.01
        APP |        196        0.51       99.51
        APA |        143        0.37       99.88
        PPA |         45        0.12      100.00
------------+-----------------------------------
      Total |     38,612      100.00


. 
. 
. 
. noi di "breakdown by site"
breakdown by site

. 
. noi bysort type site:  tab ValueA, sort m

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aac6aph2

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,299       94.20       94.20
        PPP |         76        5.51       99.71
        APA |          3        0.22       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aaddaph4ia

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,287       93.33       93.33
        PPP |         86        6.24       99.56
        APA |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aadeant6ia

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,326       96.16       96.16
        APA |         30        2.18       98.33
        PPP |         21        1.52       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ia

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,226       88.91       88.91
        PPP |        145       10.51       99.42
        APA |          5        0.36       99.78
        APP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ant9ib

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = aph2ic

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = apha3aph3iii

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,326       96.16       96.16
        PPP |         51        3.70       99.85
        APA |          1        0.07       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = blaz

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |      1,130       81.94       81.94
        AAA |        125        9.06       91.01
        APA |        116        8.41       99.42
        APP |          7        0.51       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cat

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = cfr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,375       99.71       99.71
        PPP |          2        0.15       99.85
        APA |          1        0.07       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,339       97.10       97.10
        PPP |         34        2.47       99.56
        APA |          5        0.36       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,339       97.10       97.10
        PPA |         34        2.47       99.56
        APP |          3        0.22       99.78
        APA |          2        0.15       99.93
        PPP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrd

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrg

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,324       96.01       96.01
        PPP |         53        3.84       99.85
        APA |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = dfrk

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,373       99.56       99.56
        PPP |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = erma

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,225       88.83       88.83
        PPP |        144       10.44       99.27
        APA |          5        0.36       99.64
        APP |          5        0.36      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,375       99.71       99.71
        PPP |          3        0.22       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,171       84.92       84.92
        PPP |        176       12.76       97.68
        APA |         30        2.18       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermt

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,359       98.55       98.55
        PPP |         20        1.45      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = ermy

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,351       97.97       97.97
        PPP |         22        1.60       99.56
        APA |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = fusc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,300       94.27       94.27
        PPP |         74        5.37       99.64
        APA |          3        0.22       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = isab

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnua

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,364       98.91       98.91
        PPP |          9        0.65       99.56
        AAP |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = lnub

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,377       99.85       99.85
        APA |          1        0.07       99.93
        PPP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = meca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |        987       71.57       71.57
        PPP |        377       27.34       98.91
        APA |         13        0.94       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mecc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,361       98.69       98.69
        PPP |         17        1.23       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mphc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,361       98.69       98.69
        PPP |         17        1.23       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = msra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,359       98.55       98.55
        PPP |         18        1.31       99.85
        APA |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupa

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,362       98.77       98.77
        PPP |         15        1.09       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = mupb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,329       96.37       96.37
        PPP |         44        3.19       99.56
        APA |          5        0.36       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qacb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,329       96.37       96.37
        PPA |         44        3.19       99.56
        APA |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = qaccsmr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,307       94.78       94.78
        PPP |         50        3.63       98.40
        APA |         19        1.38       99.78
        APP |          2        0.15       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = sat4

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,325       96.08       96.08
        PPP |         49        3.55       99.64
        APA |          4        0.29       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = str

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,375       99.71       99.71
        PPP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetk

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,262       91.52       91.52
        PPP |         99        7.18       98.69
        APA |         14        1.02       99.71
        APP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetl

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,376       99.78       99.78
        PPP |          2        0.15       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = tetm

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,339       97.10       97.10
        PPP |         38        2.76       99.85
        APA |          1        0.07       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = teto

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vana

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vanc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgaa

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,378       99.93       99.93
        PPP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgab

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Aquired Resistance, site = vgba

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = dfrb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,297       94.05       94.05
        PPP |         81        5.87       99.93
        PAP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = fusa

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,320       95.72       95.72
        PAP |         57        4.13       99.85
        AAP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = grla

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,072       77.74       77.74
        PPP |        299       21.68       99.42
        PAP |          7        0.51       99.93
        AAP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = gyra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,086       78.75       78.75
        PPP |        291       21.10       99.85
        APA |          1        0.07       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = iles

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,379      100.00      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = Chromosomal Resistance, site = rpob

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,354       98.19       98.19
        PPP |         23        1.67       99.85
        APA |          1        0.07       99.93
        PAP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccra

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,004       72.81       72.81
        PPP |        365       26.47       99.27
        APA |          7        0.51       99.78
        APP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,003       72.73       72.73
        PPP |        336       24.37       97.10
        APP |         22        1.60       98.69
        AAP |          9        0.65       99.35
        APA |          8        0.58       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,334       96.74       96.74
        PPP |         23        1.67       98.40
        APA |         12        0.87       99.27
        PPA |          9        0.65       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,329       96.37       96.37
        APA |         26        1.89       98.26
        PPA |         22        1.60       99.85
        PPP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = ccr, site = ccrcc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,335       96.81       96.81
        APA |         19        1.38       98.19
        PPP |         18        1.31       99.49
        PPA |          6        0.44       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arca

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,372       99.49       99.49
        PPP |          6        0.44       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,372       99.49       99.49
        PPA |          6        0.44       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcc

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,372       99.49       99.49
        PPA |          6        0.44       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = arcd

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,372       99.49       99.49
        PPA |          6        0.44       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = chp

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        883       64.03       64.03
        AAA |        435       31.54       95.58
        APP |         46        3.34       98.91
        APA |         15        1.09      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = eta

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,335       96.81       96.81
        PPP |         40        2.90       99.71
        APA |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,371       99.42       99.42
        PPP |          5        0.36       99.78
        APA |          2        0.15       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = etd

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,316       95.43       95.43
        PPP |         57        4.13       99.56
        APA |          5        0.36       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukm

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,370       99.35       99.35
        PPP |          9        0.65      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukmf

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,370       99.35       99.35
        PPA |          6        0.44       99.78
        PPP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvf

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,264       91.66       91.66
        PPP |        111        8.05       99.71
        APA |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = lukpvs

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,266       91.81       91.81
        PPP |        109        7.90       99.71
        APA |          3        0.22       99.93
        APP |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sak

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |      1,065       77.23       77.23
        AAA |        299       21.68       98.91
        APA |         10        0.73       99.64
        APP |          5        0.36      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sasx

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,363       98.84       98.84
        PPA |         14        1.02       99.85
        APA |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = scn

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |      1,217       88.25       88.25
        AAA |        143       10.37       98.62
        APP |         15        1.09       99.71
        APA |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sea

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,069       77.52       77.52
        PPP |        295       21.39       98.91
        APA |         12        0.87       99.78
        APP |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seb

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,265       91.73       91.73
        PPP |        109        7.90       99.64
        APA |          3        0.22       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sec

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,145       83.03       83.03
        PPP |        225       16.32       99.35
        APA |          5        0.36       99.71
        APP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sed

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,307       94.78       94.78
        PPP |         66        4.79       99.56
        APA |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = see

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,374       99.64       99.64
        PPP |          4        0.29       99.93
        APA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seg

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        753       54.60       54.60
        AAA |        590       42.78       97.39
        APP |         20        1.45       98.84
        APA |         16        1.16      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seh

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,239       89.85       89.85
        PPP |        134        9.72       99.56
        APA |          4        0.29       99.85
        APP |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sei

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        741       53.73       53.73
        AAA |        586       42.49       96.23
        APP |         33        2.39       98.62
        APA |         13        0.94       99.56
        PPA |          6        0.44      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sej

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,305       94.63       94.63
        PPP |         69        5.00       99.64
        APA |          5        0.36      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = selr

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,309       94.92       94.92
        PPP |         67        4.86       99.78
        APA |          3        0.22      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = sep

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,264       91.66       91.66
        PPP |        108        7.83       99.49
        APA |          4        0.29       99.78
        APP |          2        0.15       99.93
        PPA |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = seu

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        PPP |        725       52.57       52.57
        AAA |        587       42.57       95.14
        APP |         57        4.13       99.27
        APA |         10        0.73      100.00
------------+-----------------------------------
      Total |      1,379      100.00

----------------------------------------------------------------------------------------------------------------------------------
-> type = virulence, site = tsst1

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      1,112       80.64       80.64
        PPP |        255       18.49       99.13
        APA |          8        0.58       99.71
        APP |          4        0.29      100.00
------------+-----------------------------------
      Total |      1,379      100.00


. 
. 
. 
. noi tab site ValueA, m

               |                                   ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPA        PPP |     Total
---------------+-----------------------------------------------------------------------------+----------
      aac6aph2 |     1,299          0          3          1          0          0         76 |     1,379 
    aaddaph4ia |     1,287          0          6          0          0          0         86 |     1,379 
    aadeant6ia |     1,326          0         30          2          0          0         21 |     1,379 
        ant9ia |     1,226          0          5          3          0          0        145 |     1,379 
        ant9ib |     1,379          0          0          0          0          0          0 |     1,379 
        aph2ic |     1,379          0          0          0          0          0          0 |     1,379 
  apha3aph3iii |     1,326          0          1          1          0          0         51 |     1,379 
          arca |     1,372          0          1          0          0          0          6 |     1,379 
          arcb |     1,372          0          1          0          0          6          0 |     1,379 
          arcc |     1,372          0          1          0          0          6          0 |     1,379 
          arcd |     1,372          0          1          0          0          6          0 |     1,379 
          blaz |       125          0        116          7          0          1      1,130 |     1,379 
           cat |     1,379          0          0          0          0          0          0 |     1,379 
          ccra |     1,004          0          7          3          0          0        365 |     1,379 
          ccrb |     1,003          9          8         22          0          1        336 |     1,379 
         ccrca |     1,334          0         12          1          0          9         23 |     1,379 
         ccrcb |     1,329          0         26          0          0         22          2 |     1,379 
         ccrcc |     1,335          0         19          1          0          6         18 |     1,379 
           cfr |     1,375          0          1          1          0          0          2 |     1,379 
           chp |       435          0         15         46          0          0        883 |     1,379 
          dfra |     1,339          0          5          0          0          1         34 |     1,379 
          dfrb |     1,297          0          0          0          1          0         81 |     1,379 
          dfrc |     1,339          0          2          3          0         34          1 |     1,379 
          dfrd |     1,379          0          0          0          0          0          0 |     1,379 
          dfrg |     1,324          0          2          0          0          0         53 |     1,379 
          dfrk |     1,373          0          0          0          0          0          6 |     1,379 
          erma |     1,225          0          5          5          0          0        144 |     1,379 
          ermb |     1,375          0          1          0          0          0          3 |     1,379 
          ermc |     1,171          0         30          2          0          0        176 |     1,379 
          ermt |     1,359          0          0          0          0          0         20 |     1,379 
          ermy |     1,379          0          0          0          0          0          0 |     1,379 
           eta |     1,335          0          4          0          0          0         40 |     1,379 
           etb |     1,371          0          2          1          0          0          5 |     1,379 
           etd |     1,316          0          5          1          0          0         57 |     1,379 
          fusa |     1,320          2          0          0         57          0          0 |     1,379 
          fusb |     1,351          0          6          0          0          0         22 |     1,379 
          fusc |     1,300          0          3          2          0          0         74 |     1,379 
          grla |     1,072          1          0          0          7          0        299 |     1,379 
          gyra |     1,086          0          1          0          0          1        291 |     1,379 
          iles |     1,379          0          0          0          0          0          0 |     1,379 
          isab |     1,379          0          0          0          0          0          0 |     1,379 
          lnua |     1,364          6          0          0          0          0          9 |     1,379 
          lnub |     1,377          0          1          0          0          0          1 |     1,379 
          lukm |     1,370          0          0          0          0          0          9 |     1,379 
         lukmf |     1,370          0          0          0          0          6          3 |     1,379 
        lukpvf |     1,264          0          4          0          0          0        111 |     1,379 
        lukpvs |     1,266          0          3          1          0          0        109 |     1,379 
          meca |       987          0         13          2          0          0        377 |     1,379 
          mecc |     1,361          0          1          0          0          0         17 |     1,379 
          mphc |     1,361          0          1          0          0          0         17 |     1,379 
          msra |     1,359          0          2          0          0          0         18 |     1,379 
          mupa |     1,362          0          0          2          0          0         15 |     1,379 
          mupb |     1,379          0          0          0          0          0          0 |     1,379 
          qaca |     1,329          0          5          1          0          0         44 |     1,379 
          qacb |     1,329          0          6          0          0         44          0 |     1,379 
       qaccsmr |     1,307          0         19          2          0          1         50 |     1,379 
          rpob |     1,354          0          1          0          1          0         23 |     1,379 
           sak |       299          0         10          5          0          0      1,065 |     1,379 
          sasx |     1,363          0          2          0          0         14          0 |     1,379 
          sat4 |     1,325          0          4          1          0          0         49 |     1,379 
           scn |       143          0          4         15          0          0      1,217 |     1,379 
           sea |     1,069          0         12          3          0          0        295 |     1,379 
           seb |     1,265          0          3          2          0          0        109 |     1,379 
           sec |     1,145          0          5          4          0          0        225 |     1,379 
           sed |     1,307          0          6          0          0          0         66 |     1,379 
           see |     1,374          0          1          0          0          0          4 |     1,379 
           seg |       590          0         16         20          0          0        753 |     1,379 
           seh |     1,239          0          4          2          0          0        134 |     1,379 
           sei |       586          0         13         33          0          6        741 |     1,379 
           sej |     1,305          0          5          0          0          0         69 |     1,379 
          selr |     1,309          0          3          0          0          0         67 |     1,379 
           sep |     1,264          0          4          2          0          1        108 |     1,379 
           seu |       587          0         10         57          0          0        725 |     1,379 
           str |     1,375          0          0          0          0          0          4 |     1,379 
          tetk |     1,262          0         14          4          0          0         99 |     1,379 
          tetl |     1,376          0          1          0          0          0          2 |     1,379 
          tetm |     1,339          0          1          1          0          0         38 |     1,379 
          teto |     1,379          0          0          0          0          0          0 |     1,379 
         tsst1 |     1,112          0          8          4          0          0        255 |     1,379 
          vana |     1,379          0          0          0          0          0          0 |     1,379 
          vanb |     1,379          0          0          0          0          0          0 |     1,379 
          vanc |     1,379          0          0          0          0          0          0 |     1,379 
          vgaa |     1,378          0          0          0          0          0          1 |     1,379 
          vgab |     1,379          0          0          0          0          0          0 |     1,379 
          vgba |     1,379          0          0          0          0          0          0 |     1,379 
---------------+-----------------------------------------------------------------------------+----------
         Total |   104,923         18        501        263         66        165     11,279 |   117,215 


. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |    117,215    .9913578    .0925615          0          1

. 
. noi di r(sum) " out of " r(N) " site predictions" agree
116202 out of 117215 site predictions1

. 
. noi di r(sum)/_N*100
99.135776

. 
. 
. 
. summ agree if strpos(type, "Aqu") |strpos(type, "Chro")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     71,708    .9932643    .0817947          0          1

. 
. noi di r(sum) " out of " r(N) " aquired or chromosonal resistance site predictions" agree
71225 out of 71708 aquired or chromosonal resistance site predictions1

. 
. noi di r(sum)/r(N)*100
99.326435

. 
. drop agree

. 
. 
. 
. save pipeline_clean_all_values_wide, replace
file pipeline_clean_all_values_wide.dta saved

. 
. 
. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. 
. 
. * Compare the three methods in phenotype predictions

. 
. 
. 
. set li 130

. 
. 
. 
. cap log close
